/****************************************************************************/
/*	£Ð¥È¥ì¡¼¥¹¥í¥°¾ðÊó¼èÆÀÍÑ£ä£å£æ£é£î£åÌ¾	(1994.02.15)					*/
/****************************************************************************/

/****************************************/
/*	¾ÜºÙ¾ðÊódefine						*/
/****************************************/
#define	CMODE	1L						/* À¸À®¥â¡¼¥É						ˆÙ*/
#define	RD		1L						/* »ÈÍÑ²ÄÇ½¥ê¥¯¥¨¥¹¥È¼±ÊÌ»Ò			*/
#define	EVENT	29L						/* »ÈÍÑ²ÄÇ½¥¤¥Ù¥ó¥ÈÈÖ¹æ				*/
#define	CODE	0x0800					/* ¥¢¥Ü¡¼¥È¥³¡¼¥É					*/
#define	DETAIL	0x6c666963				/* ¥¢¥Ü¡¼¥È¾ÜºÙ¥³¡¼¥É(lfic=6c666963)*/

/****************************************/
/*	ÊÖµÑÃÍdefine						*/
/****************************************/
#define	MCLNORMAL	0L					/* Àµ¾ï½ªÎ»							*/
#define	MCLERPARM	-1L					/* ¥Ñ¥é¥á¡¼¥¿¥¨¥é¡¼					*/
#define	MCLEREXS1	-2L					/* ¥Õ¥¡¥¤¥ë´ûÂ¸(ŽÄŽÚŽ°Ž½Ãê½ÐŽÌŽ§Ž²ŽÙ)		*/
#define	MCLEREXS2	-3L					/* ¥Õ¥¡¥¤¥ë´ûÂ¸(ŽÄŽÚŽ°Ž½Ãê½ÐŽÌŽ§Ž²ŽÙ°Ê³°)	*/
#define	MCLERGTBF	-4L					/* ¥Ð¥Ã¥Õ¥¡³ÎÊÝÉÔ²Ä					*/
#define	MCLERDUPR	-5L					/* Æó½ÅÈ¯¹Ô¥¨¥é¡¼					*/
#define	MCLERIOER	-6L					/* ¥Õ¥¡¥¤¥ë£É¡¿£Ï¥¨¥é¡¼				*/
