/****************************************************************************/
/* 		ABORT関数定数定義ファイル           　                              */
/* 		mcabort.h					          　                                */
/* 		作成者　田中　宏之（９４／３／２）                                  */
/****************************************************************************/
/********************************************/
/* 型定義		                            */
/********************************************/
typedef		char			BYTE;		/* char								*/
typedef		short			WORD;		/* short							*/
typedef		long			LONG;		/* long								*/
typedef		unsigned char	UBYTE;		/* unsigned char					*/
typedef		unsigned short	UWORD;		/* unsigned char					*/
typedef		unsigned long	ULONG;		/* unsigned long					*/
/********************************************/
/* 登録時引数返却域							*/
/********************************************/
typedef struct
{
    long      mbid;                     /* ｱﾎﾞｰﾄ通知先ﾒｰﾙﾎﾞｯｸｽID			*/
    char      keikubun;                 /* 系区分		                    */
    char      yob1;		                /* 予備１		　                  */
    short     mid;		                /* 発行元ﾓｼﾞｭｰﾙID                   */
    long      appendix1;                /* 任意ﾃﾞｰﾀ1		                */
    long      appendix2;                /* 任意ﾃﾞｰﾀ2		                */
    long      appendix3;                /* 任意ﾃﾞｰﾀ3		                */
} RTNARA;
/********************************************/
/* MIA個別部フォーマット					*/
/********************************************/
typedef struct
{
    long      incode;                   /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ						*/
    short     mid;		                /* 発行元ﾓｼﾞｭｰﾙID                   */
    short     yob1;		                /* 予備１		　                  */
    long      appendix1;                /* 任意ﾃﾞｰﾀ1		                */
    long      appendix2;                /* 任意ﾃﾞｰﾀ2		                */
    long      appendix3;                /* 任意ﾃﾞｰﾀ3		                */
} MIAKOB;
/**************************************/
/* ﾃﾞｨﾌｧｲﾝ定義                       */
/**************************************/
#define	MC_SETN	0x4D435F53,0x45544E20	/* 関数名(前半・後半部)				*/
#define	MC_DELN	0x4D435F44,0x454C4E20	/* 関数名(前半・後半部)				*/
#define	MC_NTAB	0x4D435F4E,0x54414220	/* 関数名(前半・後半部)				*/
/********************************/
/*  ABORT通知関数ﾓｼﾞｭｰﾙID       */
/********************************/
#define		ABTENTMID		0x08f0		/* ｱﾎﾞｰﾄ通知登録ﾓｼﾞｭｰﾙID			*/
#define		ABTDELMID		0x08f1		/* ｱﾎﾞｰﾄ通知先抹消					*/
#define		ABTNOTEMID		0x08f2		/* ｱﾎﾞｰﾄ通知						*/
/********************************/
/*  ｱﾎﾞｰﾄ時詳細情報			    */
/********************************/
#define		ERPERR			0x01		/* 論理ｴﾗｰ							*/
/********************************/
/*  送信系区分（ＭＩＡ）        */
/********************************/
#define		GENYOUKEI		0x01		/* 現用系							*/
#define		YOBIKEI			0x02		/* 予備系							*/
/********************************/
/*  MKｺｰﾄﾞ		                */
/********************************/
#define		ABTMK1			0x03		/* MKｺｰﾄﾞ1							*/
#define		ABTMK2			0x11		/* MKｺｰﾄﾞ2							*/
#define		ABTMK3			0x00		/* MKｺｰﾄﾞ3							*/
#define		ABTMK4			0x00		/* MKｺｰﾄﾞ4							*/
/********************************/
/*  ｲﾝﾀﾌｪｰｽｺｰﾄﾞ	                */
/********************************/
#define		INTERFACEC		0x08f00000	/* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ						*/
/********************************/
/* 　その他		                */
/********************************/
#define		NULL			0			/* NULL								*/
#define		NORMAL			0			/* NORMAL							*/
