/*********************************************************************/
/*             include file                                          */
/*********************************************************************/
#include "mcs_0000.h"

/*********************************************************************/
/*             初期の型宣言                                   (T01)  */
/*********************************************************************/
typedef struct mcs_pform MCS_PFRM;
typedef struct mcs_cform MCS_CFRM;

/**********************************************************************/
/*            ﾌﾟﾛｾｽ起動ﾊﾟﾗﾒﾀ書式定義                                  */
/**********************************************************************/
#define PFORMFIX "-lf %s -MON %d -mf %s "

static struct mcs_pform{
    char    pf1[sizeof(PFORMFIX)-1];	/* ｽｹｼﾞｭｰﾗ固定部              */
    char    pf2[sizeof(PFORM)];         /* 利用者定義部               */
} rpform = 
{ PFORMFIX, PFORM };

/**********************************************************************/
/*            'call'ｺﾏﾝﾄﾞﾊﾟﾗﾒﾀ書式定義                                */
/**********************************************************************/
#define CFORMFIX "-MON %d -NVT -IRA -RDV -ELA -SAA -IRB -mf %s -mj "

static struct mcs_cform{
    char    cf1[sizeof(CFORMFIX)-1];    /* ｽｹｼﾞｭｰﾗ固定部              */
    char    cf2[sizeof(CFORM)];         /* 利用者定義部               */
} rcform =
{ CFORMFIX, CFORM };


/**********************************************************************/
/*                  参照外部ﾃｰﾌﾞﾙ定義                                 */
/**********************************************************************/

#define	 STNUM  2

static MCS_TNML rtnmlist[TNUM+STNUM] =
{
    "TCST","TPCT",                      /* ｽｹｼﾞｭｰﾗ固定部              */
    TNAME                               /* 利用者定義部               */
};

/**********************************************************************/
/*                  ﾓｼﾞｭｰﾙ初期化関数ﾘｽﾄ定義                           */
/**********************************************************************/
long   mcs_0100();

static MCS_FLIST initlist[MNUM+1] =
{
    mcs_0100,                           /* ｽｹｼﾞｭｰﾗ固定部              */
    INITFUNC                            /* 利用者定義部               */
};
 
/**********************************************************************/
/*                  ﾓｼﾞｭｰﾙ処理関数ﾘｽﾄ定義                             */
/**********************************************************************/
long   mcs_0200();

static MCS_FLIST distlist[MNUM+1] =
{
    mcs_0200,                           /* ｽｹｼﾞｭｰﾗ固定部              */
    DISTFUNC                            /* 利用者定義部               */
};

/**********************************************************************/
/*					配下ﾓｼﾞｭｰﾙ呼出し(ｻﾌﾞ ｺﾝﾄﾛｰﾗ)ﾘｽﾄ定義               */
/**********************************************************************/
long mcs_0500();
long mcs_0600();
long mcs_0a00();
long mcs_0b00();
long mcs_0400();
long mcs_0900();
long mcs_0400();
long mcs_0300();

static  MCS_FUNC  subfunc = 
{
	8,                          		/* モジュールエントリ数       */
	MCSSTTM ,0       ,0,0,mcs_0500,     /* タイマカウンタ処理　　     */
	MCSTIME,MCSBUFF  ,0,0,mcs_0600,     /* バッファ確保リトライ       */
	MCSTIME,MCSSAMPL ,0,0,mcs_0a00,     /* モニタサンプリング         */
	MCSTIME,MCSSTOP  ,0,0,mcs_0b00,     /* モニタサンプリング停止     */
	MCSEND ,0        ,0,0,mcs_0400,     /* プロセス終了指示	　　      */
	MCSSPMN,0        ,0,0,mcs_0900,     /* スポットモニタ要求         */
	MCSTERM,0        ,0,0,mcs_0400,     /* 強制閉塞依頼／完了         */
	MCSAPCMD,0       ,0,0,mcs_0300,     /* メッセージハンドラ　　　　 */
};	

	
/**********************************************************************/
/*      起動ﾊﾟﾗﾒﾀﾘｽﾄ展開域定義 (注) ｽｹｼﾞｭｰﾗ初期化にて設定             */
/**********************************************************************/
#define  SPNUM  3
static MCS_PRM  mcs_pprm[PNUM+SPNUM];

/**********************************************************************/
/* 'call'ｺﾏﾝﾄﾞﾊﾟﾗﾒﾀﾘｽﾄ展開域定義 (注) ﾒｯｾｰｼﾞﾊﾝﾄﾞﾗにて設定             */
/**********************************************************************/
#define  SCNUM  9
static MCS_PRM  mcs_cprm[CNUM+SCNUM];

/**********************************************************************/
/* 外部ﾃｰﾌﾞﾙｱﾄﾞﾚｽﾘｽﾄ展開域定義 (注) ｽｹｼﾞｭｰﾗ初期化にて設定             */
/**********************************************************************/
static	long	tblplist[TNUM+STNUM];


/**********************************************************************/
/*				ﾒｯｾｰｼﾞﾘｽﾄ定義		    							  */
/**********************************************************************/
#define SMSGNUM 14
static MCS_MLIST msglist[MSGNUM+SMSGNUM] =
{
	{"SCS0","%02x\t%02x","%04x-%08x"},
	{"SCS1","%02x\t%02x",0},
	{"SCS2",0,0},
	{"SCS3",0,0},
	{"SCS4",0,0},
	{"SCS5",0,"%04x-%08x"},
	{"SCS6",0,0},
	{"SCS7",0,0},
	{"SCS8",0,"%04x-%08x"},
	{"SCS9",0,"%04x-%08x"},
	{"SCSA",0,0},
	{"SCSB",0,"%04x-%08x"},
	{"SCSC",0,"%04x-%08x"},
	{"SCSD",0,0},
	ADMSG
};

/**********************************************************************/
/*              ﾌﾟｰﾙﾊﾞｯﾌｧﾕﾆｯﾄｻｲｽﾞ最大値（ROS制約値）                  */
/**********************************************************************/
#define  PBMX	0x1fff0

/**********************************************************************/
/*              ｽｹｼﾞｭｰﾗ変数定義域                                     */
/**********************************************************************/
MCS_SDEF mcs_sdef =
{
    TNUM+STNUM,                 /* 参照外部ﾃｰﾌﾞﾙ数                    */
    rtnmlist,                   /* 参照外部ﾃｰﾌﾞﾙ名ﾘｽﾄﾎﾟｲﾝﾀ            */
	tblplist,					/* 参照外部ﾃｰﾌﾞﾙﾎﾟｲﾝﾀﾘｽﾄ              */
	PNUM+SPNUM,					/* ﾌﾟﾛｾｽ起動ﾊﾟﾗﾒﾀ数                   */
    (char *)(&rpform),          /* ﾌﾟﾛｾｽ起動ﾊﾟﾗﾒﾀ書式ﾎﾟｲﾝﾀ            */
    (char *)(&rcform),          /* 'call'ｺﾏﾝﾄﾞﾊﾟﾗﾒﾀ書式ﾎﾟｲﾝﾀ          */
    IRBIFUNC,                   /* IRB数決定付加ﾙｰﾁﾝﾎﾟｲﾝﾀ             */
    MSGHFUNC,                   /* ﾒｯｾｰｼﾞﾊﾝﾄﾞﾗ付加ﾙｰﾁﾝﾎﾟｲﾝﾀ           */
    SMPLFUNC,                   /* ﾓﾆﾀｻﾝﾌﾟﾙ間隔算出付加ﾙｰﾁﾝﾎﾟｲﾝﾀ      */
    SMONFUNC,                   /* ｽﾎﾟｯﾄﾓﾆﾀ付加ﾙｰﾁﾝﾎﾟｲﾝﾀ              */
    SMPLFUNC,                   /* ﾓﾆﾀｻﾝﾌﾟﾘﾝｸﾞ付加ﾙｰﾁﾝﾎﾟｲﾝﾀ           */
    TERMFUNC,                   /* ﾌﾟﾛｾｽ終了指示付加ﾙｰﾁﾝﾎﾟｲﾝﾀ         */
    MNUM+1,                     /* ﾓｼﾞｭｰﾙ数                           */
    initlist,                   /* ﾓｼﾞｭｰﾙ初期化関数ﾘｽﾄﾎﾟｲﾝﾀ           */
    distlist,                   /* ﾓｼﾞｭｰﾙｻﾌﾞｺﾝﾄﾛｰﾗ関数ﾙｰﾁﾝﾘｽﾄﾎﾟｲﾝﾀ    */
	mcs_pprm,					/* 起動ﾊﾟﾗﾒﾀ展開域ﾘｽﾄﾎﾟｲﾝﾀ			  */
	mcs_cprm,					/* 'call'ｺﾏﾝﾄﾞﾊﾟﾗﾒﾀ展開域ﾘｽﾄﾎﾟｲﾝﾀ	  */
	NVTSIZ,                     /* NVTﾌﾟﾛｸﾞﾗﾑ固有部の大きさ           */
	SAASIZ,						/* SAAﾌﾟﾛｸﾞﾗﾑ固有部の大きさ 		  */
	&subfunc,					/* 配下ﾓｼﾞｭｰﾙ呼出しﾘｽﾄﾎﾟｲﾝﾀ			  */
	MSGNUM+SMSGNUM,				/* ﾒｯｾｰｼﾞﾘｽﾄ配列数                    */
	msglist,					/* ﾒｯｾｰｼﾞﾘｽﾄﾎﾟｲﾝﾀ					  */
	PBMX,						/* PBﾕﾆｯﾄｻｲｽﾞ制約値(ROS) '92.6.12(M02)*/
	RMETHOD,					/* ﾒｯｾｼﾞ受信方法(ﾒｯｾｼﾞ長) os..mspr/msr*/
	ITBREG,                     /* 内部ﾃｰﾌﾞﾙ領域指定　LMpbf/LMshm     */
	CMORLM,						/* osrcvmsr時のﾊﾞｯﾌｧ種別 CM/LM        */
	0,							/* 予備                               */
	0							/* 予備                               */
};
