/********************************/
/*                              */
/*   DCP ŽÍŽÂŽÀŽÞŽ°                  */
/*                              */
/********************************/

/********************************/
/*   SMP ŽºŽ°ŽÙ ŽÉ ŽÍŽÝŽ·ŽÔŽ¸ŽÁ           */
/********************************/

#include <mdretv.h>              /* DCP SMP ŽºŽ°ŽÙ ŽÍŽÝŽ·Ž¬Ž¸ŽÁ     */

/********************************/
/*   MIA (Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ) ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²    */
/********************************/

#include <mcmia.h>               /* MIA (Ž·Ž®Ž³ŽÂŽ³ŽÌŽÞ) ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²  */
/********************************/
/*   md_tint ŽÖŽ³ ŽÍŽÂŽÀŽÞŽ° ŽÌŽ±Ž²ŽÙ      */
/*   63.09.08 Ž»Ž¸ Ž¼ŽÞŽ®            */
/********************************/
