/**************************************/
/*                                    */
/*        mdc_lppn.h                  */
/*                                    */
/**************************************/
struct mdlppnf {                        /* TPCT Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¶Ž¸ŽÉŽ³Ž²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ  */
         char      mdlppnm[8] ;         /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²              */
         long      mdlpnmb ;            /* ŽÒŽ°ŽÙŽÎŽÞŽ¯Ž¸Ž½ Ž¼Ž·ŽÍŽÞŽÂŽ¼            */
         long      mdlppkn ;            /* ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ ŽºŽÍŽÞŽÂ ŽÊŽÞŽÝŽºŽÞŽ³        */
};
typedef struct mdlppnf  MDLPPNF;


/**************************************/
/*                                    */
/*    ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽØŽ½ŽÄ                      */
/*                                    */
/**************************************/
#define   LPPNOMAL    0l                /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³              */
#define   LPPIVPRM   0xff130011         /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž°                 */
#define   LPPTELPH   0xff130012         /* TLPH Ž´Ž×Ž°                   */
#define   LPPTEPAT   0xff130013         /* TPAT Ž´Ž×Ž°                   */
