/**************************************/
/*                                    */
/*        mdc_fhno.h                  */
/*                                    */
/**************************************/
struct mdfhnof {                        /* Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž¶Ž¸ŽÉŽ³Ž²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ        */
        short       mdfhent;            /* Ž´ŽÝŽÄŽØno.                    */
        short       mdfhyob1;           /* ŽÖŽËŽÞ                        */
        long        mdfhadd;            /* Ž¶ŽÞŽ²ŽÄŽ³ŽºŽÍŽÞŽÂŽÌŽÞ Ž¾ŽÝŽÄŽ³ Ž±ŽÄŽÞŽÚŽ½     */
};
typedef struct mdfhnof MDFHNOF;


/**************************************/
/*   ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽØŽ½ŽÄ                       */
/**************************************/
#define   FHNNOMAL        0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³              */
#define   FHNIVPRM   0xff020001         /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž°                 */
