/**************************************/
/*                                    */
/*        mdc_wspn.h                  */
/*                                    */
/**************************************/
struct mdwspnf {                        /* TPCT Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¶Ž¸ŽÉŽ³Ž²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ  */
         char      mdwspnm[8] ;         /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²              */
         long      mdwsnmb ;            /* ŽÒŽ°ŽÙŽÎŽÞŽ¯Ž¸Ž½ Ž¼Ž·ŽÍŽÞŽÂŽ¼            */
         long      mdwspkn ;            /* ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ ŽºŽÍŽÞŽÂ ŽÊŽÞŽÝŽºŽÞŽ³        */
};
typedef struct mdwspnf  MDWSPNF;


/**************************************/
/*                                    */
/*    ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽØŽ½ŽÄ                      */
/*                                    */
/**************************************/
#define   WSPNOMAL    0l                /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³              */
#define   WSPIVPRM   0xff130001         /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž°                 */
#define   WSPTELGT   0xff130002         /* TLGT Ž´Ž×Ž°                   */
#define   WSPTEPAT   0xff130003         /* TPAT Ž´Ž×Ž°                   */
