/**************************************/
/*                                    */
/*   mdpnam.h                         */
/*                                    */
/**************************************/
/**************************************/
/*   ŽØŽÀŽ°ŽÝ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· Ž¶ŽÝŽØŽÌŽÞ              */
/**************************************/
struct mdprkan {
          short     mdprlusu;           /* ŽÂŽ³ŽÁ LU Ž½Ž³                  */
          char      mdpryob1[2];        /* ŽÖŽËŽÞ                        */
};
typedef struct mdprkan MDPRKAN;
/**************************************/
/*   ŽØŽÀŽ°ŽÝ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· ŽºŽÍŽÞŽÂŽÌŽÞ             */
/**************************************/
struct mdprkob {
          char      mdprlutp;           /* LU Ž¼Ž­ŽÍŽÞŽÂ                   */
          char      mdpryob2;           /* ŽÖŽËŽÞ                        */
          short     mdprluno;           /* LUno.                      */
          short     mdprwsno;           /* WSno.                      */
          char      mdpryob3[2];        /* ŽÖŽËŽÞ                        */
          char      mdprpnam[8];        /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²              */
};
typedef struct mdprkob MDPRKOB;
/**************************************/
/*   ŽÖŽ³Ž·Ž­Ž³ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· Ž¶ŽÝŽØŽÌŽÞ             */
/**************************************/
struct mdpnkan {
          short     mdpnlusu;           /* LU Ž½Ž³                      */
          char      mdpnyob1[2];        /* ŽÖŽËŽÞ                        */
};
typedef struct mdpnkan MDPNKAN;
/**************************************/
/*   ŽÖŽ³Ž·Ž­Ž³ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· ŽºŽÍŽÞŽÂŽÌŽÞ            */
/**************************************/
struct mdpnkob {
          short     mdpnluno;           /* LUno.                      */
          char      mdpnyob2[2];        /* ŽÖŽËŽÞ                        */
};
typedef struct mdpnkob MDPNKOB;

/**************************************/
/*                                    */
/*    ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽØŽ½ŽÄ                      */
/*                                    */
/**************************************/
#define   NOTLUTYP  -99l                /* Ž¼Ž­ŽÍŽÞŽÂ ŽÁŽ¶ŽÞŽ² (020 ŽÍŽÝŽ·Ž¬Ž¸ŽÁ)    */
