/****************************************************************************/
/*	著作権	１９９３														*/
/*			  ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*	収容物　ＭＤＵＳＣＫ　ＭＤＰＴＣＫ										*/
/****************************************************************************/
#define MDDCPEBL	0x01				/* 電文制御区分[0] : DCP使用可		*/
#define MDPTHEBL	0x01				/* 電文制御区分[1] : 論理ﾊﾟｽ使用可	*/

#define	MDUSCK	((((long)mdpsptr <= 0) || \
						(mdpsptr->mdpsdsts[0] != MDDCPEBL))? 0:1)
										/* DCP域ﾎﾟｲﾝﾀ無効 or DCP使用不可	*/
										/* の場合　偽　else  真				*/

#define MDPTCK	(((!MDUSCK) || (mdpsptr->mdpsdsts[1] != MDPTHEBL))? 0:1)
										/* MDUSCKが偽 or 論理ﾊﾟｽ使用不可	*/
										/* の場合  偽  else  真				*/
