/********************************/
/*                              */
/*   EDP ŽÍŽÂŽÀŽÞŽ°                  */
/*                              */
/********************************/

/********************************/
/*   SMP ŽºŽ°ŽÙ ŽÉ ŽÍŽÝŽ·ŽÔŽ¸ŽÁ           */
/********************************/

#include <meretv.h>              /* EDP SMP ŽºŽ°ŽÙ ŽÍŽÝŽ·Ž¬Ž¸ŽÁ     */

/********************************/
/*   MIA (Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ) ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²    */
/********************************/

#include <mcmia.h>               /* MIA (Ž·Ž®Ž³ŽÂŽ³ŽÌŽÞ) ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²  */
