/*************************************************/
/*                                               */
/*                  mdag.h                       */
/*                                               */
/*          Ž±Ž°Ž·ŽÞŽ­ŽÒŽÝŽÄ Ž¶ŽÝŽØŽ²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                */
/*                                               */
/*************************************************/

struct mdagarea {
	long	mdagarad;        /* Ž±Ž°Ž·ŽÞŽ­ŽÒŽÝŽÄŽ²Ž· Ž±ŽÄŽÞŽÚŽ½        */
	short	mdagmax ;        /* Ž»Ž²ŽÀŽÞŽ² Ž¶ŽÝŽØŽ½Ž³             */
	short	mdagyob1;        /* ŽÖŽËŽÞ1                    */
};
typedef struct mdagarea MDAGAREA;
