/**********************************************************************/
/*      MEC_MSND ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define MSNNOMAL         0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³               */
#define MSNOTHER     0xff310001        /* ŽÀŽ¹Ž² Ž¿Ž³Ž¼ŽÝ Ž²Ž¼ŽÞŽ®Ž³              */
#define MSNMBERR     0xff310002        /* ŽÒŽ°ŽÙ ŽÎŽÞŽ¯Ž¸Ž½ Ž²Ž¼ŽÞŽ®Ž³             */
#define MSNSYSER     0xff310003        /* Ž¼Ž½ŽÃŽÑ Ž¶ŽÝŽ·Ž®Ž³ Ž²Ž¼ŽÞŽ®Ž³            */
#define MSNPRMER     0xff310004        /* ŽËŽ·Ž½Ž³ Ž¾Ž¯ŽÃŽ² Ž²Ž¼ŽÞŽ®Ž³             */
#define MSNIFAER     0xff310005        /* Ž²ŽÝŽÀŽÌŽªŽ°Ž½ Ž´Ž×Ž°                 */
