/**********************************************************************/
/*      MEC_HENQ ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define HENNOMAL         0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³               */
#define HENNOENQ     0xff250001        /* Ž½ŽÃŽÞŽÆ Ž¾ŽÝŽÕŽ³ Ž½ŽÞŽÐ               */
#define HENTMOUT     0xff250002        /* ŽÀŽ²ŽÑ Ž±Ž³ŽÄ                     */
#define HENENQER     0xff250003        /* Ž¾ŽÝŽÕŽ³ Ž¼Ž¯ŽÊŽßŽ²                  */
#define HENIFAER     0xff250004        /* Ž²ŽÝŽÀŽÌŽªŽ°Ž½ Ž´Ž×Ž°                 */
