/**********************************************************************/
/*      MEC_ITPN ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define ITPNOMAL         0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³               */
#define ITPPNGNO     0xff2c0001        /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³ ŽÌŽ¾Ž²           */
#define ITPLPPTR     0xff2c0002        /* TLPT ŽÎŽßŽ²ŽÝŽÀ Ž²Ž¼ŽÞŽ®Ž³            */
#define ITPFAPTR     0xff2c0003        /* TFAP ŽÎŽßŽ²ŽÝŽÀ Ž²Ž¼ŽÞŽ®Ž³            */
#define ITPLPTER     0xff2c0004        /* TLPT ŽÐŽ¼ŽÖŽ³                   */
#define ITPFAPER     0xff2c0005        /* TFAP ŽÐŽ¼ŽÖŽ³                   */
#define ITPFACER     0xff2c0006        /* TFAC ŽÐŽ¼ŽÖŽ³                   */
