/**********************************************************************/
/*      MEC_HTPN ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define HTPNOMAL         0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³               */
#define HTPPNGNO     0xff280001        /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³ ŽÅŽ¼            */
#define HTPLPPTR     0xff280002        /* TLPH ŽÎŽßŽ²ŽÝŽÀ Ž²Ž¼ŽÞŽ®Ž³            */
#define HTPFAPTR     0xff280003        /* TFAH ŽÎŽßŽ²ŽÝŽÀ Ž²Ž¼ŽÞŽ®Ž³            */
#define HTPLPHER     0xff280004        /* TLPH ŽÐŽ¼ŽÖŽ³                   */
#define HTPFAHER     0xff280005        /* TFAH ŽÐŽ¼ŽÖŽ³                   */
#define HTPDADER     0xff280006        /* TDAD ŽÐŽ¼ŽÖŽ³                   */
