/**********************************************************************/
/*      MEC_PNCK ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define PNCNOMAL         0l            /* Ž¼ŽÖŽ³Ž¶ŽÉŽ³                      */
#define PNCPNGCM     0xff340001        /* ŽºŽÏŽÝŽÄŽÞ ŽºŽ°ŽÄŽÞ Ž·ŽÃŽ²Ž¶ŽÞŽ²           */
#define PNCPNGNO     0xff340002        /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³ Ž·ŽÃŽ²Ž¶ŽÞŽ²        */
#define PNCPNGAD     0xff340003        /* Ž¼ŽÃŽ² Ž±ŽÄŽÞŽÚŽ½ Ž²Ž¼ŽÞŽ®Ž³             */
#define PNCPNGSZ     0xff340004        /* Ž¼ŽÃŽ² Ž»Ž²Ž½ŽÞ Ž²Ž¼ŽÞŽ®Ž³              */
#define PNCPNGPN     0xff340005        /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³ ŽÌŽ¾Ž²           */
#define PNCIFAER     0xff340006        /* Ž²ŽÝŽÀŽÌŽªŽ°Ž½ Ž´Ž×Ž°                 */
