/**********************************************************************/
/*      MEC_HTLN ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define HTLNOMAL         0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³               */
#define HTLFAPTR     0xff270001        /* TFAH ŽÎŽßŽ²ŽÝŽÀ Ž²Ž¼ŽÞŽ®Ž³            */
#define HTLDADER     0xff270002        /* TDAD ŽÐŽ¼ŽÖŽ³                   */
#define HTLPNGFH     0xff270003        /* TFAHŽ´ŽÝŽÄŽØNO. Ž²Ž¼ŽÞŽ®Ž³           */
