/**********************************************************************/
/*      MEC_HREQ ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
                                       /* ŽÖŽ³Ž·Ž­Ž³ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¾ŽÝŽÄŽ³ Ž±ŽÄŽÞŽÚŽ½     */
#define HREPBFER     0xff260001        /* ŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§ Ž¶Ž¸ŽÎ Ž²Ž¼ŽÞŽ®Ž³         */
#define HRETBLER     0xff260002        /* ŽÃŽ°ŽÌŽÞŽÙ ŽÑŽ¼ŽÞŽ­ŽÝ                 */
#define HREPNGNO     0xff260003        /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³ ŽÅŽ¼            */
#define HREIFAER     0xff260004        /* Ž²ŽÝŽÀŽÌŽªŽ°Ž½ Ž´Ž×Ž°                 */
