/**********************************************************************/
/*      MEC_IENQ ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
#define IENNOMAL         0l            /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³               */
#define IENNOENQ     0xff2a0001        /* Ž½ŽÃŽÞŽÆ Ž¾ŽÝŽÕŽ³ Ž½ŽÞŽÐ               */
#define IENTMOUT     0xff2a0002        /* ŽÀŽ²ŽÑ Ž±Ž³ŽÄ                     */
#define IENENQER     0xff2a0003        /* Ž¾ŽÝŽÕŽ³ Ž¼Ž¯ŽÊŽßŽ²                  */
#define IENIFAER     0xff2a0004        /* Ž¾ŽÝŽÕŽ³ Ž¼Ž¯ŽÊŽßŽ²                  */
