/**********************************************************************/
/*      MEC_ATSR ŽÍŽ¯ŽÀŽÞ ŽÌŽ§Ž²ŽÙ                    V/R =  0/0   88.01.08   */
/**********************************************************************/
/******************************************/
/*      ŽÂŽ³ŽÁ Ž¼ŽÞŽÖŽ³ŽÎŽ³Ž²Ž· ŽÉ ŽÌŽµ-ŽÏŽÂŽÄ             */
/******************************************/
struct metujo {
        long   atekaadd;         /* Ž±ŽÃŽ»Ž· Ž¶ŽÝŽØŽ²Ž· ŽºŽÍŽÞŽÂŽÌŽÞ Ž±ŽÄŽÞŽÚŽ½    */
        short  atekaent;         /* Ž±ŽÃŽ»Ž· Ž¶ŽÝŽØŽ²Ž· ŽºŽÍŽÞŽÂŽÌŽÞ Ž´ŽÝŽÄŽØ NO. */
        short  yobi    ;         /* ŽÖŽËŽÞ                        */
        char   meatedst;         /* ŽÍŽÝŽ¼Ž­Ž³ Ž½ŽÃŽ°ŽÀŽ½                */
        char   meatakbn;         /* Ž±ŽÃŽ»Ž· Ž¸ŽÌŽÞŽÝ                  */
        char   meatfndt;         /* Ž»Ž²Ž¼Ž­Ž³ ŽÃŽÞŽ°ŽÀ Ž¼Ž­ŽÍŽÞŽÂ           */
        char   meatkkst;         /* Ž¹Ž²Ž¶ŽÝ Ž½ŽÃŽ°ŽÀŽ½                 */
        short  meatptno;         /* ŽÛŽÝŽØŽÊŽßŽ½ NO.                 */
        short  meatanod;         /* Ž±ŽÃŽ»Ž· ŽÉŽ°ŽÄŽÞ                  */
        char   meatfwcd[2];      /* ŽÌŽØŽÜŽ¹ ŽºŽ°ŽÄŽÞ                  */
        char   meatyob1[2];      /* ŽÖŽËŽÞ1                       */
        char   meatpsid[8];      /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²              */
        long   meatmsad;         /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¶ŽÝŽØŽ²Ž· Ž±ŽÄŽÞŽÚŽ½         */
};
typedef struct metujo METUJO;

/******************************************/
/*      ŽÃŽÞŽ¨ŽÌŽ§Ž²ŽÝ                           */
/******************************************/
#define  ATSNOMAL     0l         /* Ž¾Ž²Ž¼ŽÞŽÖŽ³ Ž¼ŽÕŽ³ŽØŽÖŽ³              */
#define  ATSIVPRM   0xff210001   /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž°                 */
#define  ATSSROUT   0xff210002   /* Ž»Ž°ŽÁ Ž±Ž³ŽÄ                    */
#define  ATSIFERR   0xff210003   /* Ž²ŽÝŽÀŽÌŽªŽ°Ž½ Ž´Ž×Ž°                */
