/**********************************************************************/
/*                                                                    */
/*             me_cedt        ŽÍŽ¯ŽÀŽÞŽÌŽ§Ž²ŽÙ       (mecedt.h)               */
/*                                                                    */
/**********************************************************************/
/**************************************/
/*           edtŽ²ŽÝŽÀŽÌŽªŽ°Ž½Ž¥Ž´ŽØŽ± ŽÌŽ«Ž°ŽÏŽ¯ŽÄ    */
/**************************************/
struct edifarea {
    char       edifscod;                /* Ž¼Ž®ŽØŽºŽ°ŽÄŽÞ                    */
    char       ediftkbn;                /* ŽÍŽÝŽ¼Ž­Ž³ Ž¸ŽÌŽÞŽÝ                 */
    short      edifptno;                /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³              */
    long       edifedad;                /* MIAŽ±ŽÄŽÞŽÚŽ½                   */
    short      edifedsz;                /* MIAŽ»Ž²Ž½ŽÞ                    */
    short      edifyob1;                /* ŽÖŽËŽÞ1                       */
    long       edifatkb;                /* Ž±ŽÃŽ»Ž· Ž¶ŽÝŽØŽ²Ž· ŽºŽÍŽÞŽÂŽÌŽÞ Ž±ŽÄŽÞŽÚŽ½    */
    long       edifmskn;                /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¶ŽÝŽØŽ²Ž· Ž±ŽÄŽÞŽÚŽ½         */
    long       edifhkak;                /* ŽËŽ¶Ž¸ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· Ž±ŽÄŽÞŽÚŽ½         */
    long       ediftuci;                /* Ž±ŽÃŽ»Ž· ŽÂŽ³ŽÁŽ¼ŽÞŽ®Ž³ŽÎŽ³ Ž±ŽÄŽÞŽÚŽ½       */
    long       edifhttb;                /* ŽÎŽ½ŽÄ ŽÃŽ°ŽÌŽÞŽÙŽ¼ŽÞŽ®Ž³ŽÎŽ³ Ž±ŽÄŽÞŽÚŽ½      */
    long      *edifdtad;                /* ŽÃŽÞŽ°ŽÀŽ±ŽÄŽÞŽÚŽ½ Ž¶Ž¸ŽÉŽ³Ž²Ž· ŽÉ  Ž±ŽÄŽÞŽÚŽ½  */
    short     *edifdtsz;                /* ŽÃŽÞŽ°ŽÀŽ»Ž²Ž½ŽÞ  Ž¶Ž¸ŽÉŽ³Ž²Ž· ŽÉ  Ž±ŽÄŽÞŽÚŽ½  */
};
typedef struct edifarea EDIFAREA;
/**************************************/
/*        ŽËŽ¶Ž¸ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ         */
/**************************************/
struct hkakarea {
    char       hkakedst;                /* ŽÍŽÝŽ¼Ž­Ž³ Ž½ŽÃŽ°ŽÀŽ½                */
    char       hkakakbn;                /* Ž±ŽÃŽ»Ž· Ž¸ŽÌŽÞŽÝ                  */
    char       hkakfndt;                /* Ž»Ž²Ž¼Ž­Ž³ ŽÃŽÞŽ°ŽÀŽ¸ŽÌŽÞŽÝ             */
    char       hkakkkst;                /* Ž¹Ž²Ž¶ŽÝ Ž½ŽÃŽ°ŽÀŽ½                 */
    short      hkakptno;                /* ŽÛŽÝŽØŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³              */
    short      hkakanod;                /* Ž±ŽÃŽ»Ž· ŽÉŽ°ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³           */
    char       hkakfwcd[2];             /* Ž¹Ž²Ž¶ŽÝ ŽÌŽØŽÜŽ¹ ŽºŽ°ŽÄŽÞ             */
    char       hkakyobi[2];             /* ŽÖŽËŽÞ                        */
    char       hkakpsid[8];             /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²              */
    long       hkakmsad;                /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¶ŽÝŽØŽ²Ž· Ž±ŽÄŽÞŽÚŽ½         */
};
typedef struct hkakarea HKAKAREA;
/**************************************/
/*        ŽËŽ¶Ž¸ Ž´ŽÝŽ»ŽÞŽÝ ŽÖŽ³                */
/**************************************/
struct longdata {
    long longdt1;
    long longdt2;
};
typedef struct longdata LONGDATA;
/**************************************/
/*        ŽÍŽÝŽ·Ž¬Ž¸ŽÁ                      */
/**************************************/
#define  MEEQUAL    01
#define  MENOTEQ  -100
#define  SPACE     ' '
