/**************************************/
/*                        V/R = 0/0   */
/*            mecget.h                */
/*                                    */
/*       me_cget ﾍｯﾀﾞｰ  ﾌｧｲﾙ          */
/*                                    */
/**************************************/
/**********************************************************************/
/*    		 ＜設計修正者名＞ 　 　		営業店システム担当(ﾒｰｶ:ｺﾑｱｯﾌﾟ)*/
/*    		 ＜設計修正年月日及び修正ＩＤ＞   １９９３年７月１日  PD01*/
/*                                             rd管理情報変更の為     */
/**********************************************************************/

/*********************************************************************/
/*    cget  ｲﾝﾀｰﾌｪｰｽ  ｴﾘｱ                                            */
/*********************************************************************/
struct cgeifa {
     long  gimiaadd ;                   /*  MIA  ｱﾄﾞﾚｽ               */
     long  girscmad ;                   /*  ｵｳﾄｳ ｺﾏﾝﾄﾞ ﾘｮｳｲｷ ｱﾄﾞﾚｽ   */
     long  girbufad ;                   /*  ｼﾞｭｼﾝ  ﾊﾞｯﾌｧ  ｱﾄﾞﾚｽ      */
     short gimiasiz ;                   /*  MIA  ｻｲｽﾞ                */
     short girscmsz ;                   /*  ｵｳﾄｳ ｺﾏﾝﾄﾞ ﾘｮｳｲｷ ｻｲｽﾞ    */
     short girbfsiz ;                   /*  ｼﾞｭｼﾝ  ﾊﾞｯﾌｧ  ｻｲｽﾞ       */
	 short gireserv1;					/*  ﾖﾋﾞ						 */
     long  giretv   ;                   /*  ﾍﾝｷｬｸﾁ (me_cget)         */
     long  gifunc   ;                   /*  ﾅｲﾌﾞ ｶﾝｽｳ ﾒｲ             */
     long  gisbret  ;                   /*  ﾍﾝｷｬｸﾁ (rosｼｽﾃﾑ ｺｰﾙ)     */
     long  gird     ;                   /*  ﾘｸｴｽﾄ  ｼｷﾍﾞﾂｼ            */
     long  giosaret ;                   /*  osanyrl  ﾉ  ﾍﾝｷｬｸﾁ       */
     short giuse    ;                   /*  ｼﾖｳ  ﾓｸﾃｷ            PD01*/
     short gitimid  ;                   /*  ﾀｲﾏ id                   */
     char  giflag   ;                   /*  ﾌﾗｸﾞ                     */
     char  gidtar;                      /*  ﾃﾞｰﾀ ｶｸﾉｳｲｷ              */
	 char  gireserv2[2];				/*                       PD01*/
     short gipathno ;                   /*  ﾛﾝﾘﾊﾟｽ ﾊﾞﾝｺﾞｳ            */
     short giargsiz ;                   /*  ｱｰｷﾞｭﾒﾝﾄ ｲｷ ｻｲｽﾞ         */
     long  giargadd ;                   /*  ｱｰｷﾞｭﾒﾝﾄ ｲｷ ｱﾄﾞﾚｽ        */
	 long  giusid   ;                   /*  ﾕｰｻﾞｰﾘｸｴｽﾄ ｼｷﾍﾞﾂｼ        */
     union argar  {                     /*  ｱｰｷﾞｭﾒﾝﾄ  ｲｷ             */
         char arg[48];                  /*  ｷｬﾗｸﾀ ｶﾀ ﾀｲｵｳ        PD01*/
         long argda;                    /*  ﾛﾝｸﾞ ｶﾀ  ﾀｲｵｳ            */
     } argar    ;
     long  giitptr;                     /*  i/oｶﾞﾜ ｼﾞｮｳﾎｳｲｷ ﾎﾟｲﾝﾀ    */
     long  gihtptr;                     /*  ﾎｽﾄ ｶﾞﾜ ｼﾞｮｳﾎｳｲｷ ﾎﾟｲﾝﾀ L */
};
typedef struct cgeifa CGEIFA;

/*********************************************************************/
/*       ﾃﾞｨﾌｧｲﾝ  ｺｰﾄﾞ                                               */
/*********************************************************************/
#define CGLM      1l                    /*  LM ﾌﾟｰﾙ ﾊﾞﾂﾌｱ            */
#define CGESTAER -100                   /*  ｽﾃｰﾀｽ  ｴﾗｰ               */
#define CGEACAGN -101                   /*  ﾒｰﾙ ｱｸｾｽ ｱｹﾞｲﾝ           */
#define CGEARGER -102                   /*  ｱｰｷﾞｭﾒﾝﾄ ｲｷ ｴﾗｰ          */
#define CGEADERR -103                   /*  ｱｰｷﾞｭﾒﾝﾄ ｱﾄﾞﾚｽ ｴﾗｰ       */
/********************************************* End of mdcget.h********/

/*********************************************************************/
/*       MKｺｰﾄﾞｼｭﾙｲ                                                  */
/*********************************************************************/
#define MKCODE1  0x05                       /*  MKｺｰﾄﾞ1 (ｼｮﾘｶﾝﾘｮｳﾂｳﾁ)*/
#define MKCODE2  0x04                       /*  MKｺｰﾄﾞ2 (ﾛﾝﾘﾀﾝﾏﾂ)    */
#define MKCDREAD 01                         /*  ﾘｰﾄﾞ              PD01*/
#define MKCDWRIT 02                         /*  ﾗｲﾄ               PD01*/
#define MKCDWSNS 03                         /*  ﾗｲﾄ&ｾﾝｽ           PD01*/
#define MKCDSENS 04                         /*  ｾﾝｽ               PD01*/
#define MKCDCONT 05                         /*  ｺﾝﾄﾛｰﾙ　　　　    PD01*/

											/*------------------------*/
											/* 入力元区分		PD01  */
											/*------------------------*/
#define MIAIKB00	0x00					/* 未使用			  PD01*/
#define MIAIKBPA 	0X11                    /* 論理ﾊﾟｽ番号 　     PD01*/
#define MIAIKBLN 	0X21                    /* 回線番号 　　　    PD01*/
