/**********************************************************************/
/*                                                                    */
/*  me_cput  ŽÍŽÂŽÀŽÞŽÌŽ±Ž²ŽÙ      (mecput.h) 88.02.02  V/R = 0/0             */
/*                                                                    */
/**********************************************************************/
/**************************************/
/*    Ž´Ž×- ŽÍŽÝŽ·ŽÔŽ¸ŽÁŽØŽ½ŽÄ ŽÌŽµ-ŽÏŽÂŽÄ            */
/**************************************/
struct mertkyo {
    short   meryobi;                    /* ŽÖŽËŽÞ                        */
    short   mertrten;                   /* ŽÍŽÝŽ·ŽÔŽ¸ŽÁ Ž´ŽÝŽÄŽØŽ½Ž³              */
};
typedef struct mertkyo MERTKYO;
struct mertkob {
    char    mertakbn;                   /* Ž±ŽÃŽ»Ž· Ž¸ŽÌŽÞŽÝ                  */
    char    mertyobi;                   /* ŽÖŽËŽÞ                        */
    short   mertptno;                   /* ŽÜ-Ž¸Ž½ŽÃ-Ž¼ŽÖŽÝ ŽÊŽÞŽÝŽºŽÞŽ³           */
    short   mertanod;                   /* Ž±ŽÃŽ»Ž· ŽÉ-ŽÄŽÞ                  */
    char    mertfwcd[2];                /* ŽÌŽØŽÜŽ¹ Žº-ŽÄŽÞ                  */
    char    mertpsid[8];                /* ŽÌŽßŽÛŽ¾Ž½Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²               */
    long    mertrtrn;                   /* ŽØŽÀ-ŽÝŽº-ŽÄŽÞ                   */
};
typedef struct mertkob MERTKOB;
/**************************************/
/*   ŽÊŽÂŽ¼ŽÝŽÓŽÄ Ž¹Ž²Ž¸ŽÌŽÞŽÝ ŽÍŽÂŽÀŽÞŽÌŽ±Ž²ŽÙ           */
/**************************************/
#define  MIASETUS   0X01                /* ŽÂŽ³Ž¼ŽÝŽ¹Ž²                     */
#define  MIASESYO   0x02                /* Ž¼ŽÖŽØŽ¹Ž²                      */
/**************************************/
/*   Ž¿Ž³Ž¼ŽÝŽ»Ž· Ž¹Ž²Ž¸ŽÌŽÞŽÝ ŽÍŽÂŽÀŽÞŽÌŽ±Ž²ŽÙ           */
/**************************************/
#define  MIARETUS   0x01                /* ŽÂŽ³Ž¼ŽÝŽ¹Ž²                     */
#define  MIARESYO   0x02                /* Ž¼ŽÖŽØŽ¹Ž²                      */
/**************************************/
/*        Ž±ŽÃŽ»Ž·Ž¸ŽÌŽÞŽÝ ŽÍŽÂŽÀŽÞŽÌŽ±Ž²ŽÙ           */
/**************************************/
#define  MEATKARA   0x00                /* Ž±Ž·                         */
#define  MEATHOST   0x01                /* ŽÜ-Ž¸Ž½ŽÃ-Ž¼ŽÖŽÝ ŽÊŽÞŽÝŽºŽÞŽ³ (HOST)    */
#define  MEATFURI   0x02                /* ŽÌŽØŽÜŽ¹Žº-ŽÄŽÞ                   */
#define  MEATPROC   0x03                /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²              */
#define  MEATLPAS   0x04                /* ŽÛŽÝŽØ ŽÊŽßŽ½ ŽÊŽÞŽÝŽºŽÞŽ³ (HOST)   AA */
/**************************************/
/*        ŽÍŽÝŽ¼ŽÕŽ³Ž½ŽÃ-ŽÀŽ½ ŽÍŽÂŽÀŽÞŽÌŽ±Ž²ŽÙ         */
/**************************************/
#define  EDSTNOUS   0x00                /* Ž±Ž·                         */
#define  EDSTEING   0x01                /* ŽÍŽÝŽ¼ŽÕŽ³ŽÁŽÕŽ³                   */
