/**********************************************************************/
/*                                                                    */
/*      HCP ŽÖŽ³Ž·Ž­Ž³ ŽÌŽ«Ž°ŽÏŽ¯ŽÄ(Ž·Ž®Ž³ŽÂŽ³ŽÌŽÞ)    mdhikyo.h        (61.12.  )      */
/*                                                                    */
/**********************************************************************/

struct mdhikyo {
	char	mdhimkcd[4] ;              /* MKŽºŽ°ŽÄŽÞ                  */
	long	mdhiapar    ;              /* APŽ¼ŽÖŽ³Ž²Ž·                 */
	long	mdhismid    ;              /* ŽÊŽ¯Ž¼ŽÝŽÓŽÄ MB ID            */
	long	mdhirmid    ;              /* Ž¿Ž³Ž¼ŽÝŽÓŽÄ MB ID            */
	char	mdhirest    ;              /* Ž¼Ž®ŽØŽ¹Ž¯Ž¶ ŽÂŽ³ŽÁ ŽÓŽ°ŽÄŽÞ         */
	char	mdhilpkb    ;              /* ŽÌŽÞŽÂŽØ ŽÛŽÝŽØ Ž¸ŽÌŽÞŽÝ         * */
	short	mdhilnno    ;              /* Ž¶Ž²Ž¾ŽÝ ŽÊŽÞŽÝŽºŽÞŽ³           * */
	long	mdhiokid    ;              /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ ŽÂŽ³ŽÁ Ž»Ž· MB ID     */
	long	mdhingid    ;              /* Ž²Ž¼ŽÞŽ®Ž³  ŽÂŽ³ŽÁ Ž»Ž· MB ID     */
	short	mdhiwsno    ;              /* ŽÜŽ°Ž¸Ž½ŽÃŽ°Ž¼Ž®ŽÝ NO.           */
	char	mdhipuno    ;              /* PU NO.                  */
	char	mdhiluno    ;              /* LU NO.                  */
};
typedef struct mdhikyo MDHIKYO;

/**********************************************************************/
/*   Ž¼ŽÖŽØŽ¹ŽÂŽ¶ ŽÂŽ³ŽÁŽÓŽ°ŽÄŽÞ                                                   */
/**********************************************************************/

#define   RESMOK   0x00                    /* Ž¾Ž²Ž¼ŽÞŽÖŽ³ Ž²Ž¼ŽÞŽÖŽ³ Ž½ŽÍŽÞŽÃ ŽÂŽ³ŽÁ   */
#define   RESMNG   0x01                    /* Ž²Ž¼ŽÞŽÖŽ³ ŽÀŽÞŽ¹ ŽÂŽ³ŽÁ           */

/**********************************************************************/
/*   ŽÌŽÞŽÂŽØ ŽÛŽÝŽØ Ž¸ŽÌŽÞŽÝ                                                    */
/**********************************************************************/

#define   PLKPAS   0x00                    /* ŽÛŽÝŽØ ŽÀŽ²ŽµŽ³                */
#define   PLKLIN   0x01                    /* ŽÌŽÞŽÂŽØ ŽÀŽ²ŽµŽ³               */
