/**********************************************************************/
/*                                                                    */
/*    HOST Ž¶ŽÞŽÜ ŽÃŽ°ŽÌŽÞŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ    mehtinf.h      (63.01.08)     */
/*                                                     V/R = 0/0      */
/**********************************************************************/

struct mehtinf {
	long	mehtmbid    ;               /* HCP ŽÒŽ°ŽÙŽÎŽÞŽ¯Ž¸Ž½ ID            */
	char	mehtpuno    ;               /* PU NO.                     */
	char	mehtluno    ;               /* LU NO.                     */
	short	mehtlnno    ;               /* Ž¶Ž²Ž¾ŽÝ ŽÊŽÞŽÝŽºŽÞŽ³                */
	short	mehtread    ;               /* Ž¼ŽÞŽ­Ž¼ŽÝ ŽÃŽÞŽÝŽÌŽÞŽÝ Ž¶Ž¸ŽÉŽ³ Ž±ŽÄŽÞŽÚŽ½ Ž²ŽÁ */
	short	mehtresz    ;               /* Ž¼ŽÞŽ­Ž¼ŽÝ ŽÃŽÞŽÝŽÌŽÞŽÝ Ž»Ž²Ž½ŽÞ       Ž²ŽÁ */
	short	mehtwrad    ;               /* Ž¿Ž³Ž¼ŽÝ  ŽÃŽÞŽÝŽÌŽÞŽÝ Ž¶Ž¸ŽÉŽ³ Ž±ŽÄŽÞŽÚŽ½ Ž²ŽÁ */
	short	mehtwrsz    ;               /* Ž¿Ž³Ž¼ŽÝ  ŽÃŽÞŽÝŽÌŽÞŽÝ Ž»Ž²Ž½ŽÞ       Ž²ŽÁ */
};
typedef struct mehtinf MEHTINF;

/**********************************************************************/
/*     Ž¶Ž²Ž¾ŽÝ Ž¼ŽÕŽÍŽÞŽÂ                                                     */
/**********************************************************************/
#define    TELL        'N'               /* ŽÃŽÞŽÝŽÜ ŽÓŽ³ Ž¶Ž²Ž¾ŽÝ              */
#define    DDXL        'D'               /* DDX ŽÓŽ³ Ž¶Ž²Ž¾ŽÝ               */
#define    NMLL        'T'               /* Ž¾ŽÝŽÖŽ³ Ž¶Ž²Ž¾ŽÝ                 */

