/**********************************************************************/
/*                                                    V/R = 0/0       */
/*      I/O Ž¶ŽÞŽÜ ŽÃŽ°ŽÌŽÞŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³Ž²Ž· ŽÌŽ«Ž°ŽÏŽ¯ŽÄ    meitinf.h    (63.01.13)      */
/*                                                                    */
/**********************************************************************/

struct meitinf {
	long	meittlpt     ;              /* TLPT ŽºŽÍŽÞŽÂŽÌŽÞ Ž±ŽÄŽÞŽÚŽ½      */
	long	meittfap     ;              /* TFAP ŽºŽÍŽÞŽÂŽÌŽÞ Ž±ŽÄŽÞŽÚŽ½      */
	long	meittfac     ;              /* TFAC ŽºŽÍŽÞŽÂŽÌŽÞ Ž±ŽÄŽÞŽÚŽ½      */
	char	meitipas     ;              /* ŽÊŽßŽ½ Ž½ŽÃŽ°ŽÀŽ½              */
	char	meitiatt     ;              /* ATT Ž½ŽÃŽ°ŽÀŽ½              */
	char	meitihdk     ;              /* ŽËŽÄŽÞŽ³Ž· Ž½ŽÃŽ°ŽÀŽ½            */
	char	meitiokd     ;              /* I/O Ž¼Ž­ŽÍŽÞŽÂ              */
	long	meitpsfd     ;              /* ŽÌŽ§Ž²ŽÙŽÃŽÞŽ¨Ž½Ž¸ŽØŽÌŽßŽÀ          */
	short	meitentn     ;              /* TLPT Ž´ŽÝŽÄŽØ NO.(ŽÊŽ²ŽÀ)     */
	short	meityob1     ;              /* ŽÖŽËŽÞ1                   */
};
typedef struct meitinf MEITINF;    

/**********************************************************************/
/*   ŽÊŽßŽ½ Ž½ŽÃŽ°ŽÀŽ½                                                        */
/**********************************************************************/

#define    IPSNUS    0x00            /* ŽÐŽ¼ŽÖŽ³                          */
#define    IPSOPN    0x10            /* OPEN ŽÁŽÕŽ³                      */
#define    IPSNML    0x20            /* Ž¿Ž³Ž¼ŽÞŽÕŽ¼ŽÝ Ž¶                     */
#define    IPSBSY    0xf0            /* ŽÁŽÔŽÈŽÙ ŽÍŽ²Ž¿Ž¸ ŽÁŽÕŽ³                 */

/**********************************************************************/
/*   ATT Ž½ŽÃŽ°ŽÀŽ½                                                        */
/**********************************************************************/

#define    IPANRQ    0x00            /* ŽÐŽÖŽ³Ž·ŽÕŽ³                        */
#define    IPAREQ    0x10            /* ATT ŽÖŽ³Ž·ŽÕŽ³ ŽÁŽÕŽ³                 */

/**********************************************************************/
/*   ŽËŽÄŽÞŽ³Ž· Ž½ŽÃŽ°ŽÀŽ½                                                      */
/**********************************************************************/

#define    IPHNRQ    0x00            /* ŽÐŽÖŽ³Ž·ŽÕŽ³                        */
#define    IPHREQ    0x10            /* ŽËŽÄŽÞŽ³Ž· ŽÖŽ³Ž·ŽÕŽ³ ŽÁŽÕŽ³               */

/**********************************************************************/
/*   I/O Ž¼ŽÕŽÍŽÞŽÂ                                                        */
/**********************************************************************/

#define    IOLOOP    0x00            /* ŽÙŽ°ŽÌŽß I/O                      */
#define    IO4WNT    0x40            /* 4W - NTM I/O                  */
#define    IO4W      0x44            /* 4W I/O                        */
