/****************************************************************************/
/*	著作権	１９９３														*/
/*			  ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*	収容物	ｍｅｐｌｓｔ．ｈ												*/
/****************************************************************************/
										/*----------------------------------*/
										/* Ｉ／Ｏの種別	iotype				*/
										/*----------------------------------*/
#define	MEIFLOP		0x00				/* HDLCﾙｰﾌﾟ接続						*/
#define	MEIF4W		0x44				/* ４ｗ接続							*/
#define	MEIF4WN		0x40				/* ４ｗ-ＮＴＭ接続					*/
										/*----------------------------------*/
										/* 論理パスの種別 pathtype			*/
										/*----------------------------------*/
#define	METCIOP		0x11				/* ＴＣ〜Ｉ／Ｏ間パス				*/
#define	MEHOSTP		0x10				/* ホスト〜Ｉ／Ｏ間パス				*/

										/*----------------------------------*/
										/* 論理パスリスト					*/
										/*----------------------------------*/
typedef struct{
	char	pathtype;					/* 論理パスの種別					*/
	char	iotype;						/* Ｉ／Ｏの種別						*/
	short	pathno;						/* 論理パス番号						*/
}	MEPINFO;							/* 論理ﾊﾟｽﾘｽﾄ型						*/
