/**********************************************************************/
/*      MEPSCK (ŽÛŽÝŽØŽÊŽßŽ½ Ž¼ŽÖŽ³ Ž¶ŽË ŽÁŽªŽ¯Ž¸ ŽÏŽ¸ŽÛ) ŽÍŽ¯ŽÀŽÞŽÌŽ§Ž²ŽÙ V/R =  0/0 88.03.15  */
/*     ¡ãÀß·×½¤Àµ¼ÔÌ¾¡ä					±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö(ŽÒŽ°Ž¶:ŽºŽÑŽ±Ž¯ŽÌŽß)*/
/*     ¡ãÀß·×½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä¡¡£±£¹£¹£³Ç¯£±£²·î£²£°Æü     PD04*/
/*                                      ÏÀÍýŽÊŽßŽ½»ÈÍÑ²ÄÈÝŽÁŽªŽ¯Ž¸¾ò·ïÊÑ¹¹   */
/**********************************************************************/
/*	£Å£Ä£Ð°èÅÅÊ¸À©¸æ»ÈÍÑ¶èÊ¬¡¥ÏÀÍý¥Ñ¥¹»ÈÍÑ¶èÊ¬¤¬Ìµ¸ú¤Ç¤¢¤ì¤Ð		  */
/*¡¡¡ÖMENOTUSE¡×¤Ç¸Æ¤Ó½Ð¤·¸µ¤ËÉüµ¢¤¹¤ë								  */
#define MEPSCK if(mdpsptr->mdpsdsts[1] <= 0l){				  /* PD04*/\
                   MELOG(0X33331099,mdpsptr->mdpsdsts,4l);    /* PD04*/\
                   return(MENOTUSE);\
               }

#define MEPTHCHK(NAME){												   \
			extern void mo_wlg4();									   \
			if(mdpsptr->mdpsdsts[1] == 0){							   \
            	mo_wlg4(NAME,0X33331099,mdpsptr->mdpsdsts,4);		   \
            	return(MENOTUSE);								       \
			}														   \
		}
