/*********************************************************************/
/*-------------------------------------------------------------------*/
/* ¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				 ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÉô¡¡µÜÏÆ		 	 */
/* ¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£¹Ç¯£°£³·î£³£±Æü	SPCY0146 */
/*			640M MOÁõÃÖÄÉ²Ã¤ËÈ¼¤¦½¤Àµ								 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*	ŽÌŽ±Ž²ŽÙ Ž¼ŽÞŽÖŽ³ŽÎŽ³ Ž¶Ž¸ŽÉŽ³ ŽÊŽÞŽÂŽÌŽ± < MFFINF >								 */
/*********************************************************************/
struct mffinf {
	char	mfitype;			/*	ŽÌŽ±Ž²ŽÙ ŽÀŽ²ŽÌŽß						 */
	char	mfidup;				/*	ŽÆŽ¼ŽÞŽÕŽ³Ž¶ / ŽË ŽÆŽ¼ŽÞŽÕŽ³Ž¶ ŽÌŽ×Ž¸ŽÞ			 */
	char	mficrt;				/*	ŽÌŽ±Ž²ŽÙ Ž¿Ž³Ž¾Ž² ŽÌŽ×Ž¸ŽÞ					 */
	char	mfidata;			/*	ŽÃŽÞŽ°ŽÀ Ž¼ŽÕŽ³ŽÖŽ³ ŽÜŽØŽ±Ž²					 */
	short	mfiblk;				/*	ŽÌŽÞŽÛŽÂŽ¸ ŽÁŽÖŽ³						 */
	short	mfirec;				/*	ŽÚŽºŽ°ŽÄŽÞ ŽÁŽÖŽ³						 */
	short	mfikmt;				/*	KMT Ž´ŽÝŽÄŽØ ŽÊŽÞŽÝŽºŽÞŽ³					 */
	short	mfikey;				/*	Ž·Ž° Ž½Ž³							 */
	long	mfiinit;			/*	ŽÌŽ±Ž²ŽÙ Ž¼ŽÖŽ·ŽÖŽ³ŽØŽÖŽ³					 */
	long	mfiextn;			/*	ŽÌŽ±Ž²ŽÙ Ž¶Ž¸ŽÁŽÖŽ³ŽÖŽ³ŽØŽÖŽ³					 */
	short	mfiexno;			/*	ŽÌŽ±Ž²ŽÙ Ž¶Ž¸ŽÁŽÖŽ³Ž¶Ž²Ž½Ž³					 */
	short	mfivmt;				/*	VMT Ž´ŽÝŽÄŽØ ŽÊŽÞŽÝŽºŽÞŽ³					 */
	long	mfieof;				/*	EOF ŽÃŽÞŽ°ŽÀ Ž²ŽÁ						 */
	long	mfierr;				/*	Ž´Ž×Ž° Ž¼ŽÞŽÖŽ³ŽÎŽ³						 */
	char	mfiname[16];		/*	ŽÛŽÝŽØ ŽÌŽ±Ž²ŽÙŽÒŽ²						 */
};
typedef struct mffinf MFFINF;

/*********************************************************************/
/*	Ž¹ŽÝŽ»Ž¸ Ž¼ŽÞŽÖŽ³Ž¹ŽÝ < MFCOND >											 */
/*********************************************************************/
struct mfcond {
	short	mfkno;				/*	Ž·Ž° ŽÊŽÞŽÝŽºŽÞŽ³						 */
	short	mfrsv1;				/*	ŽÖŽËŽÞ 1							 */
	short	mfoff;				/*	Ž·Ž° ŽµŽÌŽ¾Ž¯ŽÄ						 */
	short	mflen;				/*	Ž·Ž° ŽÉ ŽÅŽ¶ŽÞŽ»						 */
	char	mfatr;				/*	Ž·Ž° ŽÉ Ž¿ŽÞŽ¸Ž¾Ž²						 */
	char	mfopr;				/*	Ž¹ŽÝŽ»Ž¸ Ž´ŽÝŽ»ŽÞŽÝŽ¼						 */
	unsigned	char	mfopt;	/*	OR Ž¼ŽÞŽ®Ž³Ž¹ŽÝ Ž¼ŽÞŽ®Ž³ŽÎŽ³				 */
	char	mfrsv2;				/*	ŽÖŽËŽÞ 2							 */
	union {						/*	Ž·Ž° ŽÁ Ž±ŽÄŽÞŽÚŽ½						 */
		char	*mfcx;	
		short	*mfsx;	
		long	*mflx;
	}	mfkey;
};
typedef struct mfcond MFCOND;
																  /*%*/
/*********************************************************************/
/*	MFFMT ŽÌŽ§Ž²ŽÙ ŽÃŽÞŽ°ŽÀ Ž¶Ž¸ŽÉŽ³Ž²Ž·											 */
/*********************************************************************/
struct	mffmt	{
	short	mfftusex;			/* Ì¤»ÈÍÑ(ŽÄŽÞŽ³ŽÃŽ· FMT Ž¼ŽÖŽ³ŽÁŽÕŽ³ Ž¼ŽÞŽ´ŽÝŽÄŽØ NO)*/
	short	mfftunux;			/* Ì¤»ÈÍÑ(ŽÄŽÞŽ³ŽÃŽ· FMT ŽÐŽ¼ŽÖŽ³ Ž¼ŽÞ Ž´ŽÝŽÄŽØ NO) */
	char	mfftattr;			/* ŽÌŽ±Ž²ŽÙ Ž¿ŽÞŽ¸Ž¾Ž²						 */
								/*	 1... ....	ŽØŽ¶ŽÊŽÞŽØ ŽÖŽ³.ŽÌŽÖŽ³ Ž¼ŽÞŽ®Ž³ŽÎŽ³  */
								/*			'1'  ŽØŽ¶ŽÊŽÞŽØ ŽÀŽ²Ž¼Ž®Ž³		 */
								/*						MFFTRCV		 */
								/*			'0'  ŽØŽ¶ŽÊŽÞŽØ ŽÀŽ²Ž¼Ž®Ž³ ŽÃŽÞŽÅŽ²	 */
								/*	 .1.. ....	Ž¼ŽÞŽ¬Ž°ŽÅŽÙ Ž¼Ž­ŽÄŽ¸ŽÀŽÝŽ² Ž¼ŽÞŽ®Ž³ŽÎŽ³*/
								/*			'1'  Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽ¼Ž­ŽÄŽ¸ ŽºŽ³ŽÓŽ¸ŽÀŽÝŽ²  */
								/*						MFFTJNL		 */
								/*			'0'  Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽ¼Ž­ŽÄŽ¸ ŽÚŽºŽ°ŽÄŽÞŽÀŽÝŽ² */
								/*	 ..1. ....	2Ž¼ŽÞŽ­Ž³Ž¶ ŽÌŽ§Ž²ŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³	 */
								/*			'1'  2Ž¼ŽÞŽ­Ž³Ž¶ ŽÌŽ§Ž²ŽÙ		 */
								/*						MFFTDUPF	 */
								/*			'0'  ŽË 2Ž¼ŽÞŽ­Ž³Ž¶ ŽÌŽ§Ž²ŽÙ		 */
								/*	 ...1 ....	FIPŽ¶ŽÝŽØŽÀŽ²Ž¼Ž®Ž³ŽÌŽ§Ž²ŽÙŽ¼ŽÞŽ®Ž³ŽÎŽ³*/
								/*			'1'  FIPŽ¶ŽÝŽØŽÀŽ²Ž¼Ž®Ž³Ž¶ŽÞŽ²ŽÌŽ§Ž²ŽÙ  */
								/*						MFFTNFIP	 */
								/*			'0'  FIPŽ¶ŽÝŽØŽÀŽ²Ž¼Ž®Ž³ŽÌŽ§Ž²ŽÙ	 */
								/*	 .... 1...	ŽÖŽËŽÞ					 */
								/*	 .... .111	ŽÌŽ§Ž²ŽÙ ŽÀŽ²ŽÌŽß			 */
								/*						MFFTFTYPE	 */
								/*			'000'  Ž½ŽÄŽØŽ°ŽÑ Ž±Ž¸Ž¾Ž½	 (E) */
								/*						MFFTETYPE	 */
								/*			'001'  Ž¼ŽÞŽ­ŽÝ ŽÚŽºŽ°ŽÄŽÞ	 (A) */
								/*						MFFTATYPE	 */
								/*			'010'  ŽÁŽ®Ž¸Ž¾ŽÂ ŽÚŽºŽ°ŽÄŽÞ	 (B) */
								/*						MFFTBTYPE	 */
								/*			'011'  Ž×ŽÝŽÀŽÞŽÏŽ²Ž½ŽÞ ŽÎŽ³Ž¼Ž· (C) */
								/*						MFFTCTYPE	 */
								/*			'100'  Ž·Ž°Ž¹ŽÝŽ»Ž¸ ŽÎŽ³Ž¼Ž·	 (D) */
								/*						MFFTDTYPE	 */
	char	mfftstat;			/* ŽÌŽ±Ž²ŽÙ Ž½ŽÃ-ŽÀŽ½						 */
								/*	 1... ....	Ž¼Ž®Ž³Ž¶ŽÞŽ² Ž¼ŽÞŽ®Ž³ŽÎŽ³		 */
								/*			'1'  Ž¼Ž®Ž³Ž¶ŽÞŽ² ŽÁŽ­Ž³			 */
								/*						MFFTVERR	 */
								/*			'0'  Ž¼Ž®Ž³Ž¶ŽÞŽ² ŽÁŽ­Ž³ ŽÃŽÞŽÅŽ²	 */
								/*	 .1.. ....	Ž¿Ž³Ž¾Ž² Ž¼ŽÞŽ®Ž³ŽÎŽ³			 */
								/*			'1'  Ž¿Ž³Ž¾Ž² Ž½ŽÞŽÐ			 */
								/*						MFFTCRT		 */
								/*			'0'  ŽÐ Ž¿Ž³Ž¾Ž²				 */
								/*	 ..1. ....	ŽÌŽ§Ž²ŽÙ ŽÍŽ²Ž¿Ž¸ Ž¼ŽÞŽ®Ž³ŽÎŽ³	 */
								/*			'1'  ŽÌŽ§Ž²ŽÙ ŽÍŽ²Ž¿Ž¸ŽÁŽ­Ž³		 */
								/*						MFFTFERR	 */
								/*			'0'  ŽÌŽ§Ž²ŽÙ ŽÍŽ²Ž¿Ž¸ŽÁŽ­Ž³ ŽÃŽÞŽÅŽ²	 */
								/*	 .... 1...	ŽÌŽ§Ž²ŽÙ Ž¶Ž¸ŽÁŽ®Ž³ Ž¼ŽÞŽ®Ž³ŽÎŽ³	 */
								/*			'1'	ŽÌŽ§Ž²ŽÙ Ž¶Ž¸ŽÁŽ®Ž³ ŽÁŽ­Ž³		 */
								/*						MFFTEXTN	 */
								/*			'0'	ŽÌŽ§Ž²ŽÙ Ž¶Ž¸ŽÁŽ®Ž³ ŽÁŽ­Ž³ ŽÃŽÞŽÅŽ²	 */
								/*	 ...1 .111	ŽÖŽËŽÞ					 */
	short	mfftoth1;			/* ŽÖŽËŽÞ								 */
	char	mfftname[16];		/* ŽÛŽÝŽØ ŽÌŽ±Ž²ŽÙ ŽÒŽ²						 */
	short	mfftvmtp;			/* Ì¤»ÈÍÑ(Ž¶Ž¸ŽÉŽ³ ŽÎŽÞŽØŽÕ-ŽÑ VMT Ž´ŽÝŽÄŽØ NO)	 */
	short	mfftsgtp;			/* Ì¤»ÈÍÑ(Ž¼ŽÖŽ¿ŽÞŽ¸ Ž¸ŽÞŽÙ-ŽÌŽß SGT Ž´ŽÝŽÄŽØ NO)	 */
	short	mfftfmtp;			/* Ì¤»ÈÍÑ(ŽÄŽÞŽ³Ž²ŽÂ Ž¸ŽÞŽÙ-ŽÌŽß Ž¼ŽÞ FMT Ž´ŽÝŽÄŽØNO)*/
	short	mfftdupp;			/* Ì¤»ÈÍÑ(ŽÆŽ¼ŽÞŽÕŽ³Ž¶ ŽÌŽ±Ž²ŽÙ Ž±Ž²ŽÃ FMT Ž´ŽÝŽÄŽØNO)*/
	long	mfftinsp;			/* ŽÌŽ±Ž²ŽÙ Ž¼ŽÖŽ· ŽÖŽ³ŽØŽÖŽ³					 */
	long	mfftexsp;			/* ŽÌŽ±Ž²ŽÙ Ž¶Ž¸ŽÁŽÖŽ³ ŽÖŽ³ŽØŽÖŽ³					 */
	short	mfftexno;			/* ŽÌŽ±Ž²ŽÙ Ž¶Ž¸ŽÁŽÖŽ³ Ž¶Ž²Ž½Ž³					 */
	short	mfftnear;			/* ŽÆŽ± Ž´ŽÝŽÄŽÞ ŽÂŽ³ŽÁ ŽÜŽØŽ±Ž²					 */
	short	mfftblks;			/* ŽÌŽÞŽÛŽÂŽ¸ ŽÁŽÖŽ³						 */
	short	mfftrecs;			/* ŽÚŽº-ŽÄŽÞ ŽÁŽÖŽ³						 */
	short	mfftkmtp;			/* Ì¤»ÈÍÑ(KMT Ž´ŽÝŽÄŽØ NO)				 */
	short	mfftkeyn;			/* Ž·- Ž½Ž³							 */
	long	mffteof;			/* EOF Ž¼ŽÞŽÖŽ³ŽÎŽ³						 */
	long	mfftercd;			/* Ì¤»ÈÍÑ(Ž´Ž×- Ž¼ŽÞŽÖŽ³ŽÎŽ³)				 */
};
typedef	struct	mffmt	MFFMT;

/*********************************************************************/
/*	ŽÌŽ§Ž²ŽÙ ŽÃŽÞŽ°ŽÀ Ž¶Ž¸ŽÉŽ³Ž²Ž· ŽÅŽ² Žº-ŽÄŽÞ ŽÃŽ²Ž·ŽÞ									 */
/*********************************************************************/
#define	MFFTRCV		0x80		/* FMTŽÌŽ§Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² ŽØŽ¶ŽÊŽÞŽØŽÀŽ²Ž¼Ž®Ž³ŽÌŽ§Ž²ŽÙ		 */
#define	MFFTJNL		0x40		/* FMTŽÌŽ§Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽ¼Ž­ŽÄŽ¸ŽÀŽÝŽ²ŽºŽ³ŽÓŽ¸	 */
#define	MFFTDUPF	0x20		/* FMTŽÌŽ§Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² 2Ž¼ŽÞŽ­Ž³Ž¶ ŽÌŽ§Ž²ŽÙ 		 */
#define	MFFTNFIP	0x10		/* FMTŽÌŽ§Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² FIPŽ¶ŽÝŽØŽÀŽ²Ž¼Ž®Ž³Ž¶ŽÞŽ²ŽÌŽ§Ž²ŽÙ	 */
#define	MFFTFTYPE	0x07		/* FMTŽÌŽ±Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² ŽÌŽ±Ž²ŽÙŽÀŽ²ŽÌŽß			 */
#define	MFFTETYPE	0x00		/* FMTŽÌŽ±Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² Ž½ŽÄŽØŽ°ŽÑ Ž±Ž¸Ž¾Ž½	  (E)	 */
#define	MFFTATYPE	0x01		/* FMTŽÌŽ±Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² Ž¼ŽÞŽ­ŽÝ ŽÚŽºŽ°ŽÄŽÞ	  (A)	 */
#define	MFFTBTYPE	0x02		/* FMTŽÌŽ±Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² ŽÁŽ®Ž¸Ž¾ŽÂ ŽÚŽºŽ°ŽÄŽÞ   (B)	 */
#define	MFFTCTYPE	0x03		/* FMTŽÌŽ±Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² Ž×ŽÝŽÀŽÞŽÏŽ²Ž½ŽÞ ŽÎŽ³Ž¼Ž· (C)	 */
#define	MFFTDTYPE	0x04		/* FMTŽÌŽ±Ž²ŽÙŽ¿ŽÞŽ¸Ž¾Ž² Ž·Ž°Ž¹ŽÝŽ»Ž¸ ŽÎŽ³Ž¼Ž·   (D)	 */

#define	MFFTVERR	0x80		/* FMTŽÌŽ§Ž²ŽÙŽ½ŽÃŽ°ŽÀŽ½ Ž¼Ž®Ž³Ž¶ŽÞŽ²ŽÁŽ­Ž³			 */
#define	MFFTCRT		0x40		/* FMTŽÌŽ§Ž²ŽÙŽ½ŽÃŽ°ŽÀŽ½ Ž¿Ž³Ž¾Ž²Ž½ŽÞŽÐ 			 */
#define	MFFTFERR	0x20		/* FMTŽÌŽ§Ž²ŽÙŽ½ŽÃŽ°ŽÀŽ½ ŽÍŽ²Ž¿Ž¸ŽÁŽ­Ž³ 			 */
#define	MFFTEXTN	0x08		/* FMTŽÌŽ§Ž²ŽÙŽ½ŽÃŽ°ŽÀŽ½ ŽÌŽ§Ž²ŽÙ Ž¶Ž¸ŽÁŽ®Ž³ ŽÁŽ­Ž³		 */
#define	MFFTNCRT	0x00		/* FMTŽÌŽ§Ž²ŽÙŽ½ŽÃŽ°ŽÀŽ½ ŽÌŽ§Ž²ŽÙ Ì¤ÁÏÀ®		TD37 */
																  /*%*/
/*********************************************************************/
/*	ŽÍŽÝŽ·ŽÔŽ¸ŽÁ															 */
/*********************************************************************/
#define MFNORMAL	  0L		/*	Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³					 */
#define MFNORMX 	  1L	 	/*	Ž¼ŽÞŽ®Ž³Ž¹ŽÝŽÂŽ· Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³			 */
#define MFEOF		  0L		/*	ŽÃŽÞ-ŽÀ ŽÉ ŽµŽÜŽØ						 */
#define MFNEAREND	  2L 		/*	ŽÆŽ±.Ž´ŽÝŽÄŽÞ(Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³)			 */
#define MFEXTEN		  3L 		/*	Ž¶Ž¸ŽÁŽ®Ž³ŽØŽ®Ž³Ž²Ž· Ž¶Ž·ŽºŽÐ(Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³)	 */
#define MFERROR 	 -1L 		/*	Ž²Ž¼ŽÞŽÖŽ³ Ž¼ŽÕŽ³ŽØŽÖŽ³					 */
#define MFIVPARM	 -2L 		/*	ŽÊŽßŽ×ŽÒŽÀ ŽÌŽÄŽ³						 */
#define MFNOEXIST	 -3L 		/*	Ž¿ŽÝŽ»ŽÞŽ²Ž¼ŽÅŽ²						 */
#define MFNOMEM 	 -4L 		/*	ŽÒŽÓŽØ ŽÌŽÞŽ¿Ž¸						 */
#define MFMNTERR	 -5L		/*	FIP Ž¼ŽÖŽ·Ž¶Ž¼ŽÞ ŽÎŽÞŽØŽÕŽ°ŽÑŽÏŽ³ŽÝŽÄ Ž´Ž×Ž°		 */
#define MFSPERR		 -6L		/*	FIP Ž¼ŽÖŽ·Ž¶Ž¼ŽÞ Ž¾ŽÏŽÌŽµ Ž»Ž¸Ž¾Ž² Ž´Ž×Ž°		 */
#define MFALREADY	 -7L		/*	Ž½ŽÃŽÞŽÆ Ž¾ŽÝŽÕŽ³ŽÁŽÕŽ³					 */
#define MFUNMAT 	 -8L		/*	ŽÎŽÞŽØŽÕŽ°ŽÑŽ¼Ž·ŽÍŽÞŽÂŽÒŽ² ŽÌŽ²ŽÂŽÁ				 */
#define MFNOMOUNT	 -9L		/*	ŽÎŽÞŽØŽÕŽ°ŽÑ ŽÐŽÏŽ³ŽÝŽÄ					 */
#define MFIVDEV		-10L		/*	Ž¿Ž³ŽÁ ŽÌŽÄŽ³ 						 */
#define MFIVBLK		-11L		/*	ŽÌŽÞŽÛŽÂŽ¸ŽÁŽÖŽ³ ŽÌŽÄŽ³					 */
#define MFDUPLI		-12L	 	/*	ŽÄŽÞŽ³Ž²ŽÂŽÌŽ§Ž²ŽÙ Ž¶ŽÞ Ž¿ŽÝŽ»ŽÞŽ²Ž½ŽÙ			 */
#define MFOVMAX		-13L		/*	ŽÜŽ°Ž¸ŽÌŽ±Ž²ŽÙ ŽÉ Ž¶Ž½ŽÞŽ¶ŽÞ SGŽÁ Žµ ŽºŽ´ŽÀ		 */
#define MFNOCON		-14L		/*	ŽÐ ŽÚŽÝŽ¹ŽÂ							 */
#define MFIVTYPE	-15L		/*	ŽÌŽ±Ž²ŽÙŽÀŽ²ŽÌŽß ŽÌŽÄŽ³					 */
#define MFNOEXTEN	-16L		/*	Ž¶Ž¸ŽÁŽ®Ž³ ŽÌŽÉŽ³						 */
#define MFIVKEY		-17L 		/*	Ž·Ž° ŽÉ ŽºŽ³Ž¼ŽÝŽÖŽ³Ž·ŽÕŽ³ Žµ Ž¼ŽÀ 			 */
#define MFINUSE		-18L 		/*	ŽÏŽ³ŽÝŽÄ Ž½ŽÞŽÐ , ŽÀ(Ž¼ŽÞ) ŽÌŽßŽÛŽ¾Ž½ ŽÃŽÞ Ž¼ŽÖŽ³ŽÁŽ­Ž³ */
#define MFTIMEOUT	-19L 		/*	Ž»Ž²ŽÀŽÞŽ² ŽÏŽÁŽ¼ŽÞŽ¶ŽÝ ŽµŽ°ŽÊŽÞŽ°				 */
#define MFSEQERR	-20L		/*	Ž¾ŽÝŽÕŽ³Ž¼ŽÞŽ­ŽÝŽ² Ž´Ž×Ž°					 */
#define MFJNLERR	-21L		/*	Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÍŽÝŽ¼Ž­Ž³ Ž´Ž×Ž°				 */
#define MFFILERR	-22L		/*	ŽÌŽ§Ž¨ŽÙ ŽÍŽ²Ž¿Ž¸ ŽÁŽ­Ž³					 */
#define MFVOLERR	-23L		/*	ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž®Ž³Ž¶ŽÞŽ² ŽÁŽ­Ž³				 */
#define MFNOSPACE	-24L		/*	ŽØŽ®Ž³Ž²Ž· ŽÌŽÞŽ¿Ž¸ Ž´Ž×Ž°					 */
#define MFFILOVER	-25L		/*	ŽºŽÈŽ¸ŽÄŽ¶ŽÉŽ³Ž½Ž³ ŽµŽ°ŽÊŽÞŽ°					 */
#define MFCANCEL	-26L		/*									 */
#define MFIOERR		-27L		/*	I/O Ž´Ž×Ž° ŽÉ Ž´Ž×Ž° Ž¼Ž®ŽØ Ž¦ ŽµŽºŽÅŽ¯ŽÀ		 */
#define MFOTERR		-28L		/*	I/O Ž´Ž×Ž° ŽÃŽÞŽÅŽ² Ž´Ž×Ž°ŽºŽ°ŽÄŽÞ ŽÃŽÞ Ž±Ž¯ŽÀ		 */
#define MFNRERR		-29L		/*	I/O Ž´Ž×Ž° ( Ž¼ŽÖŽ³ ŽÌŽ¶ Ž´Ž×- )			 */
#define MFDRERR		-30L		/*	I/O Ž´Ž×Ž° ( Ž¿Ž³ŽÁ Ž´Ž×- ) 			 */
#define MFMDERR		-31L		/*	I/O Ž´Ž×Ž° ( ŽÊŽÞŽ²ŽÀŽ² Ž´Ž×- )			 */
#define MFACCUSE	-32L		/*	ACC Ž¶ŽÞ Ž½ŽÃŽÞŽÆ Ž»Ž²ŽÀŽÞŽ²Ž½Ž³ ŽÏŽ³ŽÝŽÄŽ½ŽÞŽÐTC1008*/
#define MFVOLBUSY	-33L		/*	ŽÀ(Ž¼ŽÞ) ŽÌŽßŽÛŽ¾Ž½ ŽÃŽÞ Ž¼ŽÖŽ³ŽÁŽ­Ž³	   TC1008*/
#define MFKEYERR	-34L		/*	Ž·Ž°ŽÃŽÞŽ°ŽÀÉÔÅö					TD24 */
#define MFMODERR	-35L		/*½ñ¤­¹þ¤ßÉÔ²ÄŽÎŽÞŽØŽ­Ž°ŽÑ¤Ø¤ÎŽÏŽ³ŽÝŽÄÍ×µá SM01*/
#define	MFFSTERR	-36L		/*	¥Õ¥¡¥¤¥ë¥¹¥Æ¡¼¥¿¥¹°Û¾ï	ST3202	 */

/*********************************************************************/
/*	ŽÍŽÝŽ·ŽÔŽ¸ŽÁ		   ( FD )											 */
/*********************************************************************/
#define MFNOSPF		-40L		/*	Ž¶ŽÞŽ²ŽÄŽ³ ŽÄŽ¸Ž¼Ž­ŽÌŽ§Ž²ŽÙ Ž¶ŽÞ ŽÅŽ²			 */
#define MFNOFILE	-41L		/*	Ž¶ŽÞŽ²ŽÄŽ³ ŽÌŽ§Ž²ŽÙ Ž¶ŽÞ ŽÅŽ² ( IBM Ž¹Ž²Ž¼Ž· ŽÉŽÐ ) */
#define MFNOMED		-42L		/*	FD ŽÊŽÞŽ²ŽÀŽ² ŽÅŽ¼ Ž´Ž×Ž°					 */
#define MFFEOF		-43L		/*	FD ŽØŽ®Ž³Ž²Ž·Ž¶ŽÞŽ² Ž±Ž¸Ž¾Ž½ Ž´Ž×Ž°			 */
#define MFNOLABL	-44L		/*	Ž×ŽÍŽÞŽÙŽ¼Ž®ŽØ Ž´Ž×Ž° ( IBM Ž¹Ž²Ž¼Ž· ŽÉŽÐ )		 */
#define MFFDERROR	-45L		/*	Ž¿ŽÉŽÀ Ž´Ž×Ž°							 */
#define MFEWRT		-46L		/*	Ž¶Ž·ŽºŽÐ ŽÌŽ¶ŽÉŽ³						 */
#define MFEDELS		-47L		/*	ŽÏŽ¯Ž¼Ž®Ž³ Ž¾Ž¸ŽÀ Ž´Ž×Ž°					 */
																  /*%*/
/*********************************************************************/
/*	NULL ŽÉ ŽÃŽ²Ž·ŽÞ														 */
/*********************************************************************/
#ifndef	MFNULL
#define	MFNULL		0			/* NULL ŽÉ ŽÃŽ²Ž·ŽÞ						 */
#endif
/*********************************************************************/
/*	mf_vget ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
#define MFVALL		0x7FFFFFFF	/*	ŽÁŽ´ŽÂŽ¸Ž½ŽÙ Ž±Ž·ŽÖŽ³ŽØŽÖŽ³ ŽÉ Ž»Ž²ŽÀŽÞŽ²ŽÁ 		 */
					
/*********************************************************************/
/*	mf_fget ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
#define MFSEQFL		0x01		/*	Ž¼ŽÞŽ­ŽÝŽÚŽº-ŽÄŽÞ Ž±Ž¸Ž¾Ž½ŽÀŽ²ŽÌŽß				 */
#define MFDIRFL		0x02		/*	ŽÁŽ®Ž¸Ž¾Ž½ŽÚŽº-ŽÄŽÞ Ž±Ž¸Ž¾Ž½ŽÀŽ²ŽÌŽß 			 */
#define MFRNDFL		0x03		/*	Ž×ŽÝŽÀŽÞŽÏŽ²Ž½ŽÞŽÎŽ³Ž¼Ž· ŽÁŽ®Ž¸Ž¾Ž½ŽÚŽº-ŽÄŽÞ Ž±Ž¸Ž¾Ž½ŽÀŽ²ŽÌŽß */
#define MFKEYFL		0x04		/*	Ž·-Ž¹ŽÝŽ»Ž¸ŽÎŽ³Ž¼Ž· ŽÁŽ®Ž¸Ž¾Ž½ŽÚŽº-ŽÄŽÞ Ž±Ž¸Ž¾Ž½ŽÀŽ²ŽÌŽß	 */
#define MFSTRFL		0x00		/*	Ž½ŽÄŽØ-ŽÑ Ž±Ž¸Ž¾Ž½ŽÀŽ²ŽÌŽß					 */
#define MFDOUBLE	1			/*	ŽÆŽ¼ŽÞŽ­Ž³Ž¶ŽÌŽ§Ž²ŽÙ						 */
#define MFSINGLE	0			/*	ŽË ŽÆŽ¼ŽÞŽ­Ž³Ž¶ ŽÌŽ§Ž²ŽÙ					 */
#define MFCREATE	1			/*	Ž¿Ž³Ž¾Ž² Ž½ŽÞŽÐ						 */
#define MFNOCRT		0			/*	ŽÐ Ž¿Ž³Ž¾Ž²							 */

/*********************************************************************/
/*	mf_wcrt ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
#define MFDELETE	1			/*	Ž»Ž¸Ž¼ŽÞŽÖ Ž¼ŽÃŽ²						 */
#define MFNODEL		0			/*	ŽË Ž»Ž¸Ž¼ŽÞŽÖ Ž¼ŽÃŽ² 					 */
					
/*********************************************************************/
/*	mf_fopn / mf_topn / mf_ffop ŽºŽÕŽ³ ŽÉ define ŽÁ						 */
/*********************************************************************/
#define MFREAD		0x00		/*	ŽÖŽÐŽºŽÐ ŽÓŽ°ŽÄŽÞ						 */
#define MFWRITE		0x80		/*	Ž¶Ž·ŽºŽÐ ŽÓŽ°ŽÄŽÞ						 */
#define MFUPDT		0x80		/*	ŽºŽ³Ž¼ŽÝ ŽÓŽ°ŽÄŽÞ						 */

#define MFUPDA		0x81		/*	ŽºŽ³Ž¼ŽÝ ŽÓŽ°ŽÄŽÞ 2						 */

#define MFDEFAULT	1			/*	Ž¶ŽÞŽ²ŽÄŽ³ŽÌŽ§Ž²ŽÙ ŽÀŽ²ŽÌŽß Ž±Ž¸Ž¾Ž½ 			 */
#define MFSTREAM	0			/*	Ž½ŽÄŽØ-ŽÑ Ž±Ž¸Ž¾Ž½						 */
#define MFNORM		0x0000		/*	ŽÂŽ³Ž¼ŽÞŽ®Ž³ ŽÓ-ŽÄŽÞ 					 */
#define MFHIGH		0x0020		/*	ŽºŽ³Ž¿Ž¸ ŽÓ-ŽÄŽÞ						 */

#define MFSDEN		0x00		/*	Ž·ŽÛŽ¸ŽÐŽÂŽÄŽÞ Ž¶ŽÀŽÒŽÝ ŽÀŽÝŽÐŽÂ				 */
#define MFDDEN		0x01		/*	Ž·ŽÛŽ¸ŽÐŽÂŽÄŽÞ ŽØŽ®Ž³ŽÒŽÝ ŽÊŽÞŽ²ŽÐŽÂ				 */
#define MFDDEN1		0x02		/*	µ­Ï¿Ì©ÅÙ¡§£±¡¥£°£Í¥â¡¼¥É	TD38 */
#define	MFDDEN2		0x04		/*	µ­Ï¿Ì©ÅÙ¡§£±¡¥£¶£Í¥â¡¼¥É	TD38 */
#define	MFDDEN3		0x08		/*	µ­Ï¿Ì©ÅÙ¡§£²¡¥£°£Í¥â¡¼¥É	TD38 */

#define MFMAXSIZE	-1L			/*	FIPºÇÂçŽ±Ž¸Ž¾Ž½Ž»Ž²Ž½ŽÞ»ØÄê			TD20 */

/*********************************************************************/
/*	mf_wopn ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
#define MFOWNWK		0			/*	Ž¼ŽÞŽ¹Ž² ŽÜ-Ž¸						 */
#define MFOTHWK		1			/*	ŽÀŽ¹Ž² ŽÜ-Ž¸ 						 */

/*********************************************************************/
/*	mf_tupd ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
#define MFRET		'R' 		/*	Ž¹ŽÝŽ»Ž¸ ŽÃŽÞŽ°ŽÀ ŽºŽ³Ž¼ŽÝ Ž¼Ž®ŽØ				 */
#define MFNORET		'D' 		/*	ŽÂŽ³Ž¼ŽÞŽ®Ž³ ŽÉ ŽºŽ³Ž¼ŽÝ Ž¼Ž®ŽØ				 */
																  /*%*/
/*********************************************************************/
/*	mf_fred / mf_tred ŽºŽÕŽ³ ŽÉ define ŽÁ								 */
/*********************************************************************/
#define MFDIRECT	0x0000		/*	ŽÚŽºŽ°ŽÄŽÞ Ž²ŽÁŽ¼ŽÃŽ² 					 */
#define MFSTART		0x0003		/*	Ž¹ŽÝŽ»Ž¸ŽÃŽÞŽ°ŽÀ Ž¿Ž³ŽÀŽ²Ž²ŽÁ Ž¼ŽÃŽ² 			 */
#define MFNEXT		0x0001		/*	ŽÂŽ·ŽÞŽÚŽºŽ°ŽÄŽÞ ŽÖŽÐŽºŽÐ Ž¼ŽÃŽ²				 */
#define MFBACK		0x0002		/*	ŽÏŽ´ŽÚŽºŽ°ŽÄŽÞ ŽÖŽÐŽºŽÐ Ž¼ŽÃŽ²				 */
#define MFTALL		-2L			/*	ŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÞŽÝŽÀŽ² 					 */
#define MFTCOM		-1L			/*	Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ 						 */
#define MFTSUB		0L			/*	Ž»ŽÌŽÞ Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ 					 */
					
/*********************************************************************/
/*	mf_fsrh / mf_frsh / mf_tsrh ŽºŽÕŽ³ ŽÉ define ŽÁ						 */
/*********************************************************************/
#define MFRESET		'R' 		/*	Ž¼ŽÝŽ· Ž¹ŽÝŽ»Ž¸						 */
#define MFAND		'&' 		/*	AND Ž¹ŽÝŽ»Ž¸						 */
#define MFOR		'|' 		/*	OR Ž¹ŽÝŽ»Ž¸ 						 */
#define MFEQ		'=' 		/*	=	ŽËŽÄŽ¼Ž²						 */
#define MFNE		'!' 		/*	!=	ŽËŽÄŽ¼Ž¸ŽÅŽ²						 */
#define MFGT		'<' 		/*	<	ŽÖŽØ ŽµŽµŽ·Ž²						 */
#define MFGE		'(' 		/*	<=	Ž²Ž¼ŽÞŽÖŽ³						 */
#define MFLT		'>' 		/*	>	ŽÖŽØ ŽÁŽ²Ž»Ž²						 */
#define MFLE		')' 		/*	>=	Ž²Ž¶							 */
								/* Ž¹ŽÝŽ»Ž¸Ž½ŽÙ Ž·Ž° ŽÉ Ž¿ŽÞŽ¸Ž¾Ž²				 */
#define MFCHAR		'C' 		/*	 ŽÓŽ¼ŽÞ							 */
#define MFSHORT		'S'			/*	 2 ŽÊŽÞŽ²ŽÄ ŽÉ ŽÌŽºŽÞŽ³ŽÂŽ· Ž½Ž³ŽÁ			 */
#define MFUSHORT	'U'			/*	 2 ŽÊŽÞŽ²ŽÄ ŽÉ ŽÌŽºŽÞŽ³ŽÅŽ¼ Ž½Ž³ŽÁ			 */
#define MFLONG		'L'			/*	 4 ŽÊŽÞŽ²ŽÄ ŽÉ ŽÌŽºŽÞŽ³ŽÂŽ· Ž½Ž³ŽÁ			 */
#define MFULONG		'V'			/*	 4 ŽÊŽÞŽ²ŽÄ ŽÉ ŽÌŽºŽÞŽ³ŽÅŽ¼ Ž½Ž³ŽÁ			 */
#define MFPACK		'P'			/*	 ŽÊŽßŽ¯Ž¸ Ž¹Ž²Ž¼Ž· ( 1-15 Ž¹ŽÀ )			 */
					
#define MFEND		0x7FFFFFFF	/*	Ž»Ž²Ž¼Ž­Ž³ ŽÚŽºŽ°ŽÄŽÞ Ž¼ŽÃŽ²					 */
#define MFALL		0x7FFFFFFF	/*	Ž¾ŽÞŽÝ ŽËŽ¯ŽÄŽÚŽºŽ°ŽÄŽÞ ŽÀŽ²Ž¼Ž®Ž³				 */

/*********************************************************************/
/*	mf_rfgt ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
/*	#define MFDOUBLE	1			  ŽÆŽ¼ŽÞŽ­Ž³Ž¶ŽÌŽ§Ž²ŽÙ					 */
#define MFMAIN		2			/*	Ž¾Ž² ŽÌŽ±Ž²ŽÙ 						 */
#define MFSUB		3			/*	ŽÌŽ¸ ŽÌŽ±Ž²ŽÙ 						 */
					
/*********************************************************************/
/*	mf_renq ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
/*	#define MFTSUB		0L			Ž»ŽÌŽÞ Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ 					 */
#define MFSHARE		'S' 		/*	Ž·Ž®Ž³ŽÖŽ³ ŽÖŽ³Ž·Ž­Ž³ 					 */
#define MFEXCLU		'E' 		/*	ŽÊŽ²ŽÀ ŽÖŽ³Ž·ŽÕŽ³						 */
#define MFWAIT		1			/*	ŽÏŽÂ								 */
#define MFNOWAIT	0			/*	ŽÏŽÀŽÅŽ²							 */

/*********************************************************************/
/*	FD Ž±Ž¸Ž¾Ž½ ŽºŽÕŽ³ ŽÉ define ŽÁ											 */
/*********************************************************************/
#define MFNOINF		0L			/*	Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÌŽÖŽ³						 */
#define MFONCL		0x01		/*	Ž·Ž®Ž³Ž¾Ž² ŽÌŽ×Ž¸ŽÞ ON					 */
#define MFOFFCL		0x00		/*	Ž·Ž®Ž³Ž¾Ž² ŽÌŽ×Ž¸ŽÞ OFF					 */

/*********************************************************************/
/*	mf_vjfm / mf_vrfm ŽºŽÕŽ³ ŽÉ define ŽÁ								 */
/*********************************************************************/
#define MFON		0x01		/*	ŽÌŽ§Ž²ŽÙ ŽÍŽ²Ž¿Ž¸ Ž¦ ŽµŽºŽÅŽ³				 */
#define MFOFF		0x00		/*	ŽÌŽ§Ž²ŽÙ ŽÍŽ²Ž¿Ž¸ Ž¶Ž²Ž¼ŽÞŽ®					 */

/*********************************************************************/
/*	mf_feioŽ¥mf_fioc ŽºŽÕŽ³ ŽÉ define ŽÁ	( TC2520 )				   TD-N6 */
/*********************************************************************/
#define MFDISK		'D'			/*	ŽÃŽÞŽ¨Ž½Ž¸ ŽÉ ŽÊŽÞŽ±Ž²					 */
#define MFODISK		'O'			/*	ACC ŽÉ ŽÊŽÞŽ±Ž²				   TD-N6 */
#define MFFDISK		'F'			/*	ŽÌŽÛŽ¯ŽËŽßŽ° ŽÃŽÞŽ¨Ž½Ž¸ ŽÉ ŽÊŽÞŽ±Ž²				 */
#define MFMT		'M'			/*	Ž¼ŽÞŽ· ŽÃŽ°ŽÌŽß ŽÉ ŽÊŽÞŽ±Ž²					 */
#define MF3ODISK	'3'			/*	3.5Ž²ŽÝŽÁ¸÷ŽÃŽÞŽ¨Ž½Ž¸¤Î¾ì¹ç		   TDN6	 */
#define MF5ODISK	'5'			/*	5Ž²ŽÝŽÁ¸÷ŽÃŽÞŽ¨Ž½Ž¸¤Î¾ì¹ç		   TDN6	 */
#define MFNDISK		'N'			/*	ŽÏŽÆŽ­Ž±ŽÙ·¿¸÷ŽÃŽÞŽ¨Ž½Ž¸¤Î¾ì¹ç	   TDN6	 */
#define MF6MODISK	'6'			/*	640M MOŽÃŽÞŽ¨Ž½Ž¸¤Î¾ì¹ç	   	SPCY0146 */
																  /*%*/
/*********************************************************************/
/*	ŽÌŽ±Ž²ŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž²Ž· ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²	( FD )								 */
/*********************************************************************/

struct	mffdinf{
	short	mfintsp;			/*	ŽÌŽ§Ž²ŽÙ ŽÖŽ³ŽØŽ®Ž³						 */
	short	mfeof;				/*	Ž¹ŽÞŽÝ ŽÌŽ§Ž²ŽÙ ŽÖŽ³ŽØŽ®Ž³					 */
	short	mfresp;				/*	Ž±Ž· ŽÖŽ³ŽØŽ®Ž³						 */
	short	mfrlen;				/*	ŽÌŽÞŽÂŽØ ŽÚŽºŽ°ŽÄŽÞ ŽÁŽ®Ž³ ( Ž¾Ž¸ŽÀ ŽÁŽ®Ž³ )		 */
	short	mfblen;				/*	ŽÌŽÞŽÛŽ¯Ž¸ ŽÁŽ®Ž³						 */
	char	mfftyp;				/*	ŽÌŽ§Ž²ŽÙ ŽºŽ³Ž¶ŽÝŽÀŽ²ŽÌŽß ŽËŽ®Ž³Ž¼Ž·				 */
	char	mfdum;				/*	ŽÖŽËŽÞ								 */
};
typedef struct mffdinf MFFDINF;

/*********************************************************************/
/*	Ž¶Ž·ŽºŽÐ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž²Ž·	( FD )											 */
/*********************************************************************/

struct	mfwinf{
	short	mfeod;				/*	ŽÃŽÞŽ°ŽÀ ŽÉ ŽµŽÜŽØ ( EOD Ž¼ŽÞŽ®Ž³ŽÎŽ³ )		 */
	short	mfres;				/*	ŽÖŽËŽÞ								 */
};
typedef struct mfwinf MFWINF;

/*********************************************************************/
/*	mf_vmnt2 ŽºŽÕŽ³ ŽÉ define ŽÁ	( SSCY0010 )							 */
/*********************************************************************/
#define MFREADMNT	1L			/*	ŽŽ¶Ž·ŽºŽÐ Ž·ŽÝŽ¼ ŽŽÉ ÊŽÞŽ±Ž²					 */
#define MFWRITMNT	0L			/*	ŽŽ¶Ž·ŽºŽÐ Ž¶ŽÉŽ³ ŽÉ ŽÊŽÞŽ±Ž²					 */
