/**************************** NTC-SMP-FIP ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		SCSIŽÊŽÞŽ½ ŽØŽ¾Ž¯ŽÄ Ž¼Ž®ŽØ ŽÖŽ³ ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mfscsi.h)				 */
/*																	 */
/*	2 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž²Ž¼Ž¬ : 													 */
/*		Ž»Ž¸Ž¾Ž²Ž¼Ž¬ : Ž½Ž½ŽÞŽ· ŽµŽ»ŽÑ 				'89/06/12 					 */
/*				  (SCSI ŽÊŽÞŽ½ ŽØŽ¾Ž¯ŽÄ Ž¼Ž®ŽØ ŽÂŽ²Ž¶ ŽÆ ŽÄŽÓŽÅŽ³ Ž»Ž¸Ž¾Ž²) --- TC2466	 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽÉ ŽÃŽ²Ž·ŽÞ													 */
/*********************************************************************/
#define MFTOUT		-100L		/*	ŽÀŽ²ŽÑ Ž±Ž³ŽÄ ŽÊŽ¯Ž¾Ž²					 */
