/*****************************************************************/
/*                                                               */
/*              mi_lprm.h                                        */
/*                                                               */
/*     mi_lprm ﾃｰﾌﾞﾙ ﾌｫｰﾏｯﾄ                                      */
/*                     作成  96.02.01     作成者  北西　智洋     */
/*                     変更  97.01.10     ST4566  北西　智洋  M01*/
/*                     変更  97.07.07     ST4896  北西　智洋  M02*/
/*****************************************************************/

struct michins  {
	char	tblename[4];			    /* ﾃｰﾌﾞﾙｼｷﾍﾞﾂｼ　				 	*/
	long	lmp1size;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ1ｻｲｽﾞ				*/
	long	lmp1unit;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ1個数				*/
	long	lmp2size;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ2ｻｲｽﾞ				*/
	long	lmp2unit;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ2個数				*/
	long	lmp3size;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ3ｻｲｽﾞ				*/
	long	lmp3unit;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ3個数				*/
	long	lmp4size;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ4ｻｲｽﾞ				*/
	long	lmp4unit;					/* ﾃﾞｰﾀ用ﾌﾟｰﾙﾊﾞｯﾌｧ4個数				*/
	short	crepasno;					/* LICP起動指定時論理ﾊﾟｽ数		M02 */
	char	psetflag;					/* ﾊﾟﾗﾒｰﾀ設定管理ﾌﾗｸﾞ				*/
	char	yobidesu[1];				/* 予備							M02	*/
};
typedef struct michins MICHIN;

