/****************************************************************************/
/*  Ãøºî¸¢  £±£¹£¹£·                                                        */
/*            £Î£Ô£Ô¥Ç¡¼¥¿ÄÌ¿®³ô¼°²ñ¼Ò                                      */
/*              ¶âÍ»¥·¥¹¥Æ¥à»ö¶ÈËÜÉô                                        */
/*  ¼ýÍÆÊª  £Á£Ã£Å¡Ý£Ó£Í£Ð¥½¡¼¥¹¥×¥í¥°¥é¥à									*/
/****************************************************************************/
/* ¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä                   £Á£Ã£Å¡Ý£Ó£Í£Ð                          */
/* ¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä                 £É£Ã£Ð									*/
/* ¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä               LICPÀ©¸æ								*/
/*--------------------------------------------------------------------------*/
/* ¡ãÅ¬ÍÑµ¡¼ïÌ¾¡ä                   £Á£Ã£Å                                  */
/* ¡ãÅ¬ÍÑ£Ï£Ó¡ä                     £Ô£Ò£Á£Ä£Å                              */
/* ¡ã³«È¯´Ä¶­¡ä                     £Ó£Õ£Î¡¡£Ó£Ð£Á£Ò£Ã                      */
/* ¡ãµ­½Ò¸À¸ì¡ä                     £Ã¸À¸ì                                  */
/* ¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä               ¥Ø¥Ã¥À¥Õ¥¡¥¤¥ë							*/
/*--------------------------------------------------------------------------*/
/* ¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä               £Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à                  */
/* ¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä             £µ£·£²£¶£°£±£´£²£±£°£°                  */
/*--------------------------------------------------------------------------*/
/* ¡ã³«È¯Ã´ÅöÌ¾¡ä                   ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö                      */
/* ¡ãÅÅÏÃÈÖ¹æ¡ä                     169-3573(03-5702-3573)                  */
/*--------------------------------------------------------------------------*/
/* ¡ãÀß·×¼ÔÌ¾¡ä                     ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö  »³¸ý(KSP)			*/
/* ¡ãÀß·×Ç¯·îÆü¡ä					£±£¹£¹£¸Ç¯£±£±·î£±£°Æü					*/
/* ¡ãÀß·×½¤Àµ¼Ô¡ä															*/
/* ¡ãÀß·×½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*--------------------------------------------------------------------------*/
/* ¡ã¥½¡¼¥¹ºîÀ®¼Ô¡ä¡¡¡¡             ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö  »³¸ý(KSP)			*/
/* ¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				£±£¹£¹£¸Ç¯£±£±·î£±£°Æü					*/
/* ¡ã¥½¡¼¥¹½¤Àµ¼Ô¡ä															*/
/* ¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*--------------------------------------------------------------------------*/
#if MI_LICP_DEF
#else

#define MI_LICP_DEF

typedef struct {
	char	stat;						/* ½ªÎ»¾õÂÖ							*/
	char	reserve;
	short	entryno;					/* TFAC¸ÄÊÌÉôÈÖ¹æ					*/
	long	pid;						/* ¥×¥í¥»¥¹¼±ÊÌ»Ò					*/
	short	puno;						/* ³ºÅö¥Á¥ã¥Í¥ë¤ÎPUÈÖ¹æ				*/
	short	chno;						/*               CHÈÖ¹æ				*/
	long	ecode;						/* °Û¾ï»þ¾ÜºÙ¥³¡¼¥É					*/
}	MILILST;

#define MIDLINIT	0					/* ²¿¤Ç¤â¤Ê¤¤¾õÂÖ					*/
#define MIDLWAIT	1					/* ½ªÎ»ÄÌÃÎÂÔ¤Á¾õÂÖ					*/
#define MIDLEND		2					/* ¾ÃÌÇ³ÎÇ§ºÑ¤ß¾õÂÖ					*/

/*--------------------------------------------------------------------------*/
/* Ì¾¾Î	: TFAC¥¢¥É¥ì¥¹»»½Ð½èÍý												*/
/* µ¡Ç½ : TFAC¥¢¥É¥ì¥¹¤òµá¤á¤ë												*/
/* °ú¿ô	: TCOMPAT	*TP														*/
/*--------------------------------------------------------------------------*/
#define MI_TFACADR(TP){\
    TCOMPAT		*adtcomp;       		/* TADT¶¦ÄÌÉô¥Ý¥¤¥ó¥¿			*/\
	TADTPSZ		*adtp;					/* TADT¸ÄÊÌÉô¥Ý¥¤¥ó¥¿			*/\
	register	i;\
    adtcomp = pscparea.psccmadt;\
    adtp = (TADTPSZ *)((long)adtcomp + (long)sizeof(TCOMPAT)\
                                        + (long)adtcomp->tcomsbps);\
										/* TFAC¥Æ¡¼¥Ö¥ë¥¢¥É¥ì¥¹¤ò¼èÆÀ	*/\
    for(i = 0 ; i < adtcomp -> tcomefen ; i++ ) {\
       (TP) = (TCOMPAT *)((long)adtcomp + adtp -> tadtadr);\
		if ('T' == (TP)->tcomtbid[0] &&\
            'F' == (TP)->tcomtbid[1] &&\
            'A' == (TP)->tcomtbid[2] &&\
            'C' == (TP)->tcomtbid[3]) {\
			break;\
        }\
        adtp++;\
    }\
	if (i >= adtcomp->tcomefen){\
		(TP) = (TCOMPAT *)MITBLERR;\
	}\
}


/*--------------------------------------------------------------------------*/
/* Ì¾¾Î	: £Ì£É£Ã£Ð¾ÃÌÇ³ÎÇ§¡¿Ì¤³ÎÇ§£Í£Ó£Ç½ÐÎÏ								*/
/* µ¡Ç½ : ¾åµ­£Í£Ó£Ç¤ò£Î£Ô£ÃÂåÉ½°¸¤Ë½ÐÎÏ¤¹¤ë								*/
/* °ú¿ô	: char	*ID MSG-ID													*/
/*		  short	PU  PUNO													*/
/*		  short	CH  Channel No												*/
/*		  longt	PID Process Id												*/
/*--------------------------------------------------------------------------*/
#define MI_WTOP(ID,PU,CH,PID) {\
	char	msgstr[128];\
	long	size;\
	size = sprintf(msgstr,"%s\t%d-%d\t%08x",(ID),(PU),(CH),(PID));\
	ms_wtop(msgstr,size,0x10,0x40,0,0);\
}


#endif
