/****************************************************************************/
/* ファイル名：　mi_mia.h                                                   */
/* 機能　　  ：  持回り要求／応答電文                                       */
/* 作成日　  ：  1993.12.13                                                 */
/* 変更日　  ：  1994.10.14                                             PD0A*/
/*   故障処理票(ST1761) 統合Ｉ／Ｏ対応                                      */
/* 変更日　　：  1995.06.13                                             PD0C*/
/*   仕様変更要求書(SSCY0062) 動的システム変更対応                          */
/* 変更日　　：  1995.08.09                                             PD0G*/
/*   仕様変更要求書(SSCY0098) 回線種別の無効化                              */
/* 変更日　　：  1997.05.12                                             PD0Z*/
/*   故障処理票(ST4834) LICP終了監視変更                                    */
/****************************************************************************/
#include    <mcmia.h>                   /* MIA共通域定義                    */
/************************************************/
/* ＭＩＡ共通域テンプレート                     */
/************************************************/
typedef struct {
    MCMIKYO   miaa;                     /* MIA共通域                        */
    long      miifcd;                   /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                     */
} MIKYO;
/************************************************/
/* 要求／応答電文利用者域テンプレート           */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                     */
    char  milineno[3];                  /* 回線番号                         */
    char  miketa;                       /* 電話番号桁数                     */
    char  mitpoint;                     /* 折返し箇所                       */
    char  mitype;                       /* 回線種別                         */
    short mipostcd;                     /* ﾎﾟｽﾄ ｺｰﾄﾞ                        */
    char  mibuteln[10];                 /* ﾊﾞｯｸｱｯﾌﾟ回線電話番号             */
    char  misadsz;                      /* 着ｻﾌﾞｱﾄﾞﾚｽｻｲｽﾞ               PD0A*/
    char  mipoolid;                     /* BU回線ﾌﾟｰﾙID                 PD0A*/
    char  mipword[4];                   /* ﾊﾟｽﾜｰﾄﾞ                          */
    char  misubad[23];                  /* 着ｻﾌﾞｱﾄﾞﾚｽ                   PD0A*/
    char  miyobi2;                      /* 予備2                        PD0A*/
} MIUSR;
/************************************************/
/* 一括処理要求／応答電文利用者域テンプレート   */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                     */
    char  mipword[4];                   /* ﾊﾟｽﾜｰﾄﾞ                          */
    short mingcnt;                      /* 切替失敗回線数                   */
    short mipostcd;                     /* ﾎﾟｽﾄ ｺｰﾄﾞ                        */
} MIBAT;
typedef struct {
    char  ngline[3];                    /* 切替失敗回線番号                 */
    char  blank;                        /* 空白                             */
} NGLINE;
/************************************************/
/* i/oﾌﾟﾛｾｽ要求／応答電文利用者域テンプレート   */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                     */
    short miwsno;                       /* 論理ﾊﾟｽ番号（WS番号）            */
    char  miendcd;                      /* 処理結果                         */
    char  miyobi1;                      /* 予備                             */
} MIIO;
/************************************************/
/* LANﾁｬﾈﾙ用利用者域テンプレート                */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                     */
    short milineno;                     /* 回線番号                         */
    char  miyobi1[2];                   /* 予備                             */
    long  mirtncd;                      /* ＯＳ返却値                       */
} MILAN;
/************************************************/
/* 要求電文データ域テンプレート                 */
/************************************************/
typedef struct {
    char  micomnam[9];                  /* 通知種別                         */
    char  yobi1;                        /* 空白１                           */
    char  milineno[3];                  /* 回線番号                         */
    char  yobi2;                        /* 空白２                           */
    char  miketa;                       /* 電話番号桁数                     */
    char  mibuteln[10];                 /* ﾊﾞｯｸｱｯﾌﾟ回線電話番号             */
    char  mipword[4];                   /* ﾊﾟｽﾜｰﾄﾞ                          */
} MIDATA;
/************************************************/
/* 一括処理要求電文データ域テンプレート         */
/************************************************/
typedef struct {
    char  micomnam[9];                  /* 通知種別                         */
    char  yobi1;                        /* 空白１                           */
    char  mipword[4];                   /* ﾊﾟｽﾜｰﾄﾞ                          */
} MIDBAT;
/************************************************/
/* LANﾁｬﾈﾙ用データ域テンプレート                */
/************************************************/
typedef struct {
    char  micomnam[9];                  /* 通知種別                         */
    char  yobi1;                        /* 空白１                           */
    char  milineno[3];                  /* 回線番号                         */
} MIDLAN;
/*----------------------------------*/
/* 電文送信ｲﾝﾀﾌｪｰｽｴﾘｱ型定義	        */
/*----------------------------------*/
typedef struct {
	long	mailid;						/* TSPﾌﾟﾛｾｽﾒｰﾙﾎﾞｯｸｽID				*/
	short	mid;						/* 送信要求元ﾓｼﾞｭｰﾙID				*/
	short	reserv1;					/* 予備								*/
	MILAN	usr;						/* MIA利用者域仮編集部				*/
}	MILNMSGI;
/************************************************/
/* ﾎｽﾄﾁｬﾈﾙ用利用者域テンプレート                */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                 PD0A*/
	short milineno;	                    /* 回線番号                     PD0A*/
	short mifaheno;	                    /* TFAHｴﾝﾄﾘNO                   PD0A*/
	short mirtn;                        /* 受付結果                     PD0A*/
	short misakiln;                     /* 切替先回線番号               PD0A*/
}	MIHOST;
/************************************************/
/* 排他区間要求利用者域テンプレート             */
/* （回線情報管理部）                           */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                 PD0C*/
    long  mitype;	                    /* 要求識別子                   PD0C*/
	short milcnt;	                    /* 回線情報個数                 PD0C*/
	short miyobi;                       /* 予備                         PD0C*/
}	MIHAIT;
/************************************************/
/* 排他区間要求利用者域テンプレート             */
/* （回線情報個別部）                           */
/************************************************/
typedef struct {
    char  mipuno;                       /* PU番号                       PD0C*/
    char  michno;	                    /* CH番号                       PD0C*/
	char  michgcd;	                    /* 変更対象                     PD0C*/
	char  misyoricd;                    /* 処理種別                     PD0C*/
}	MIHAITK;
/************************************************/
/* 排他区間応答利用者域テンプレート             */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                 PD0C*/
    long  mitype;	                    /* 要求識別子                   PD0C*/
	long  miecd;	                    /* 結果ｺｰﾄﾞ                     PD0C*/
	long  miescd;                       /* 結果詳細ｺｰﾄﾞ            PD0C PD0G*/
}	MIHAIRT;
/************************************************/
/* LICP終了通知利用者域テンプレート             */
/************************************************/
typedef struct {
    long  miifcd;                       /* ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ                 PD0Z*/
    long  miyobi[2];	                /* 予備                         PD0Z*/
	long  mipid;                        /* LICPﾌﾟﾛｾｽ識別名              PD0Z*/
	long  miendcd;                      /* 終了ｺｰﾄﾞ                     PD0Z*/
}	MILICPEND;
