/****************************************************************************/
/* ファイル名：　mi_tfah.h                                                  */
/* 機能  　　：  ＴＦＡＨテーブルテンプレート                               */
/*               ＴＦＡＨ定数情報                                           */
/* 作成日　  ：  1993.12.14                                                 */
/****************************************************************************/
#include    <tfah.h>                    /* ＴＦＡＨテーブルテンプレート     */

/**************************************/
/* ＴＦＡＨ論理回線ステータス         */
/**************************************/
#define CHSTINIT    0x00                /* 初期状態                         */
#define CHSTWAIT    0x30                /* 停止応答待状態                   */
#define CHSTSTOP    0x40                /* 停止状態                         */

