/****************************************************************************/
/* ファイル名：　mi_tlpt.h                                                  */
/* 機能  　　：  ＴＬＰＴテーブルテンプレート                               */
/*               ＴＬＰＴ定数情報                                           */
/* 作成日　  ：  1993.12.14                                                 */
/****************************************************************************/
#include    <tlpt.h>                    /* ＴＬＰＴテーブルテンプレート     */

/**************************************/
/* ＴＬＰＴ個別部表示                 */
/**************************************/
#define KHYODMMY       0x00              /* ﾀﾞﾐｰ                            */
#define KHYOUSE        0x01              /* 使用                            */

/**************************************/
/* ＴＬＰＴパスステータス             */
/**************************************/
#define IPASINIT       0x00              /* 初期状態                         */
#define IPASWAIT       0x10              /* ｵｰﾌﾟﾝ中                          */
#define IPASOPEN       0x20              /* ｵｰﾌﾟﾝ済み                        */
#define IPASHEI        0xf0              /* ﾁｬﾈﾙ閉塞中                       */

