/**********************************************************************/
/*                                                                    */
/*     Ž²ŽÍŽÞŽÝŽÄŽ¶ŽÝŽØ ŽÍŽ¯ŽÀŽÞ     mievent.h                                    */
/*                                                                    */
/**********************************************************************/
#define MINORMAL   0                     /* Ž¾Ž²Ž¼ŽÞŽ®Ž³Ž¼Ž­Ž³ŽØŽ®Ž³              */
#define MIIVPARM  -1                     /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž°                */
#define MIMEMANG  -2                     /* Ž²ŽÍŽÞŽÝŽÄŽ¶ŽÝŽØŽØŽ®Ž³Ž²Ž·Ž¶ŽÝŽØŽÌŽÞ ŽÌŽ¾Ž²    */
#define MIPBUFER  -3                     /* ŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§ Ž¶ŽÞ Ž¶Ž¸ŽÎ ŽÃŽÞŽ·ŽÅŽ²    */
#define MIIFAERR  -4                     /* Ž²ŽÝŽÀŽÌŽªŽ²Ž½ Ž´Ž×Ž°               */
#define MINOARID  -5                     /* Ž´ŽØŽ±Ž¼Ž·ŽÍŽÞŽÂŽ¼ ŽÐŽ¾Ž¯ŽÃŽ²           */
#define MINOTEXT  -6                     /* Ž±Ž·Ž¾ŽÙ ŽÅŽ¼                   */
#define MINOTDEF  -7                     /* Ž²ŽÍŽÞŽÝŽÄŽ¶ŽÝŽØŽØŽ®Ž³Ž²Ž· ŽÐŽ¿Ž³Ž¾Ž²       */
#define MINOEVID  -8                     /* Ž²ŽÍŽÞŽÝŽÄŽ¼Ž·ŽÍŽÞŽÂŽ¼ ŽÐŽ¾Ž¯ŽÃŽ²         */
#define MINOKEY   -9                     /* Ž¼ŽÃŽ² Ž·Ž° ŽÐŽÄŽ³ŽÛŽ¸              */
#define MIPKGERR -35                     /* ŽÊŽßŽ¯Ž¹Ž°Ž¼ŽÞ ŽÐŽ¼ŽÞŽ¯Ž¿Ž³            */
#define MIPATHER -36                     /* ŽÊŽßŽ½ ŽÒŽ² Ž±ŽÔŽÏŽØ               */
/**********************************************************************/

