/**********************************************************************/
/*                                                                    */
/*                      Ž²ŽÍŽÞŽÝŽÄŽ¶ŽÝŽØŽØŽ®Ž³Ž²Ž· ŽÍŽ¯ŽÀŽÞ                            */
/*                                                                    */
/*                      rdryoiki.h                                    */
/*                                                                    */
/**********************************************************************/
/***************************************/
/*        rdŽ·Ž®Ž³ŽÂŽ³ŽÌŽÞ                    */
/***************************************/
struct rdkyotu {
    short rdid;                          /* Ž´ŽØŽ± id                    */
    short ko_sosu;                       /* Ž¿Ž³ŽºŽÍŽÞŽÂŽÌŽÞŽ½Ž³                */
    short ko_size;                       /* ŽºŽÍŽÞŽÂŽÌŽÞŽ»Ž²Ž½ŽÞ                */
    short ko_kosu;                       /* ŽºŽÍŽÞŽÂŽÌŽÞŽºŽ½Ž³                 */
    long  start_ptr;                     /* start ŽÎŽßŽ²ŽÝŽÀ               */
    long  end_ptr;                       /* end ŽÎŽßŽ²ŽÝŽÀ                 */
    long  space_ptr;                     /* Ž±Ž·Ž´ŽØŽ± ŽÎŽßŽ²ŽÝŽÀ               */
};
typedef struct rdkyotu RDKYOTU;

/***************************************/
/*        rdŽºŽÍŽÞŽÂŽÌŽÞ                     */
/***************************************/
struct rdkobetu {
    long  next_ptr;                      /* next ŽÎŽßŽ²ŽÝŽÀ                */
    long  befor_ptr;                     /* befor ŽÎŽßŽ²ŽÝŽÀ               */
    long  request_id;                    /* ŽØŽ¸Ž´Ž½ŽÄŽ¼Ž·ŽÍŽÞŽÂŽ¼               */
};
typedef struct rdkobetu RDKOBETU;

/***************************************/
/*         ŽÛŽ¸ŽÞ Ž´ŽØŽ±                     */
/***************************************/
#if DBG
struct wlog {
    char name[8];                        /* Ž¶ŽÝŽ½Ž³ŽÒŽ²                    */
    long para[10];                       /* ŽÊŽßŽ×ŽÒŽ°ŽÀ  10ŽºŽÌŽÞŽÝ            */
};
typedef struct wlog WLOG;
#endif
struct wlog {
    long para[8];                       /* ŽÊŽßŽ×ŽÒŽ°ŽÀ  10ŽºŽÌŽÞŽÝ            */
};
typedef struct wlog WLOG;

#define LM 1                             /* ŽÛŽ°Ž¶ŽÙŽÒŽÓŽØ                   */
#define STOPFLG 0xffffffff               /* Ž½ŽÄŽ¯ŽÊŽß                     */

