/****************************************************************************/
/*  著作権　１９９４                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/*                                                                          */
/*                                                                          */
/*  収容物  ＡＣＥ−ＳＭＰシステム                                          */
/****************************************************************************/
/*                                                                          */
/*                                                                          */
/*        ＡＣＥ−ＳＭＰ　ＦＴＡＭプログラム 提供関数用ヘッダファイル       */
/*                                                                          */
/*                                                                          */
/*          <ml_aftam.h>                   FTAMﾌﾟﾛｸﾞﾗﾑ 提供関数ﾍｯﾀﾞﾌｧｲﾙ     */
/*                                                                          */
/*                                                                          */
/*＜修正：ＩＤ／年月日／氏名＞                                              */
/*  <FJ001> : １９９４年１０月２２日        楠田英幸                        */
/*            　仕様変更（ＳＳＣＹ００２８／２９）                          */
/*  <FJ002> : １９９４年１１月　８日        楠田英幸                        */
/*              サービスコール用ｉｎｃｌｕｄｅの変更                        */
/*                                                                          */
/*	95.07.04 K.Kubota ST2812: 回線番号省略値を -1 とする					*/
/*	95.07.04 K.Kubota SSCY0077: ファイル転送結果の返却						*/
/*	95.12.25 K.Kubota SSCY0106: ﾚｽﾎﾟﾝﾀﾞAP通知情報の追加                     */
/*								FC切断通知構造の追加						*/
/****************************************************************************/

#ifndef	ML_AFTAM						/*							<FJ001>	*/
#define	ML_AFTAM

/****************************************************************************/
/*********************************** ＤＥＦＩＮＥ部 *************************/
/****************************************************************************/

										/* ###ST2812 start					*/
/****************************************************************************/
/* 引き数関連の定数															*/
/****************************************************************************/
#ifndef ML_DEFLN
#define ML_DEFLN		0xFFFF			/* 回線番号省略値					*/
#endif
										/* ###ST2812 end					*/

/****************************************************************************/
/*  機能仕様書：コード一覧規定値定義                                        */
/****************************************************************************/

/****************************************************************************/
/*  ２．３．１．インタフェースコード                                        */
/****************************************************************************/
#define	MLH_SNDRQ		0x36000101		/* FTAMﾌｧｲﾙ送信要求					*/
#define	MLH_SNDRS		0x36000201		/* FTAMﾌｧｲﾙ送信応答					*/
#define	MLH_RCVRQ		0x36000102		/* FTAMﾌｧｲﾙ受信要求					*/
#define	MLH_RCVRS		0x36000202		/* FTAMﾌｧｲﾙ受信応答					*/
#define	MLH_STPRQ		0x36000103		/* FTAMﾌｧｲﾙ転送中止要求				*/
#define	MLH_STPRS		0x36000203		/* FTAMﾌｧｲﾙ転送中止応答				*/
#define	MLH_INQRQ		0x36000104		/* 転送中ﾌｧｲﾙ照会要求				*/
#define	MLH_INQRS		0x36000204		/* 転送中ﾌｧｲﾙ照会応答				*/
										/* START					<FJ002>	*/
#define	MLH_FCPRQ		0x36000405		/* FC確立許可依頼					*/
#define	MLH_FCPRS		0x36000805		/* FC確立許可応答					*/
#define	MLH_FBGIF		0x36000406		/* ﾌｧｲﾙ転送開始通知					*/
#define	MLH_FEDIF		0x36000407		/* ﾌｧｲﾙ転送終了通知					*/
#define	MLH_CREIF		0x36000408		/* ﾌｧｲﾙ生成開始通知					*/
#define	MLH_DELIF		0x36000409		/* ﾌｧｲﾙ削除開始通知					*/
#define	MLH_DCNIF		0x3600040A		/* FC切断通知						*/
										/* END						<FJ002>	*/


/****************************************************************************/
/*  返却値定義                                                              */
/*  対象：サービスコール、コマンド、ｍｌ＿ｐｉｎｔ，ｍｌ＿ｐｔｒｍ          */
/****************************************************************************/
#define		ML_NORMAL	0L				/* 正常終了(全対象共通)				*/

/****************************************************************************/
/***************************************** ｻｰﾋﾞｽｺｰﾙ専用返却値定義			*/
/****************************************************************************/
										/* START					<FJ001>	*/
#define		ML_DIDERR	-1L				/* 通信相手識別名設定ｴﾗｰ    (ﾊﾟﾗﾒｰﾀ)*/
										/* END						<FJ001>	*/
#define		ML_IFLERR	-2L				/* 転送元ﾌｧｲﾙ名設定ｴﾗｰ      (ﾊﾟﾗﾒｰﾀ)*/
#define		ML_OFLERR	-3L				/* 転送先ﾌｧｲﾙ名設定ｴﾗ-      (ﾊﾟﾗﾒｰﾀ)*/
#define		ML_MODERR	-4L				/* 転送先ﾌｧｲﾙ書込ﾓｰﾄﾞ設定ｴﾗｰ(ﾊﾟﾗﾒｰﾀ)*/
										/* 中止ﾓｰﾄﾞ設定ｴﾗｰ          (ﾊﾟﾗﾒｰﾀ)*/

#define		ML_PIDERR	-5L				/* 起動者識別子設定ｴﾗｰ      (ﾊﾟﾗﾒｰﾀ)*/
#define		ML_PWDERR	-6L				/* ﾌｧｲﾙｽﾄｱﾊﾟｽﾜｰﾄﾞ設定ｴﾗｰ    (ﾊﾟﾗﾒｰﾀ)*/
#define		ML_CHGERR	-7L				/* 課金先名称設定ｴﾗｰ        (ﾊﾟﾗﾒｰﾀ)*/
#define		ML_INTERR	-8L				/* データ転送間隔設定ｴﾗｰ    (ﾊﾟﾗﾒｰﾀ)*/
										/* START					<FJ001>	*/
#define		ML_LINERR	-9L				/* 回線番号設定ｴﾗｰ          (ﾊﾟﾗﾒｰﾀ)*/
										/* END						<FJ001>	*/
#define		ML_NOINFO	-10L			/* FTAMﾌﾟﾛｾｽ情報無し       (PCT情報)*/
#define		ML_NOMEM	-11L			/* メモリ不足    (ﾌﾟｰﾙﾊﾞｯﾌｧ確保失敗)*/
#define		ML_EOSERR	-12L			/* システムコールエラー				*/
										/* START					<FJ002>	*/
#define		ML_GIDERR	-13L			/* ファイルユーザ識別子取得エラー	*/
										/* END						<FJ002>	*/

#define		ML_PKDERR	-20L			/* 要求元種別設定ｴﾗｰ				*/
#define		ML_PNMERR	-21L			/* 要求元ﾌﾟﾛｾｽ識別名設定ｴﾗｰ			*/


/****************************************************************************/
/***************************************** ml_pint,ml_ptrm 専用返却値定義	*/
/****************************************************************************/
#define		ML_PIGERR	1				/* FTAMﾌﾟﾛｾｽ情報取得失敗(ml_pint)   */

/****************************************************************************/
/*  構造体構成データ長さ定義                                                */
/****************************************************************************/
#define	MLH_PRCNL	8					/* プロセス識別名長さ				*/
#define	MLH_FILNL	60					/* 転送ファイル名長さ				*/
#define	MLH_DSIDL	16					/* 通信相手識別名長さ				*/
#define	MLH_FSAPL	16					/* 通信相手識別名長さ				*/

#define	MLH_INITL	8					/* 起動者識別子名称長さ				*/
#define	MLH_PSWDL	8					/* ファイルストアパスワード長さ		*/
#define	MLH_CHRGL	8					/* 課金先名称長さ					*/
										/**** END ***************** <FJ002> */

										/*** START *****************<FJ003>**/
										/*** START **************** <FJ002> */
/****************************************************************************/
/*********************************** 構造体　宣言 ***************************/
/****************************************************************************/


/****************************************************************************/
/*  ＭＩＡ個別域構造      　　                                              */
/****************************************************************************/
typedef	struct	ML_ACOM_TAG				/* ＭＩＡ個別域構造					*/
{										/*									*/
	unsigned long	evnt_cd ;			/* インターフェースコード			*/
	unsigned long	reqid   ;			/* 要求識別子						*/
	unsigned long	status  ;			/* イベント完了情報					*/
	unsigned long	detail  ;			/* イベント完了情報詳細				*/
	unsigned long	charge  ;			/* 課金値							*/
										/* ###SSCY0077 start				*/
	long				trsrslt;		/* ﾌｧｲﾙ転送結果						*/
#define ML_TRANSOK		0				/*  転送成功						*/
#define ML_TRANSNG		-1				/*  転送失敗						*/
										/* ###SSCY0077 end					*/
	unsigned long	dummy2  ;			/* 予備エリア２						*/
	unsigned long	dummy3  ;			/* 予備エリア３						*/
}	ML_ACOM ;							/* ＭＩＡ個別域構造					*/
typedef	ML_ACOM	*ML_ACOM_P ;			/* ＭＩＡ個別域構造ポインタ			*/


/****************************************************************************/
/*  ＭＩＡデータ域構造(１)　　                                              */
/*  　　転送（送受信）要求／応答データ域構造                                */
/****************************************************************************/
typedef	struct	ML_ATRS_TAG				/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned short	dstidl ;			/* 通信相手識別名長さ		<FJ001>	*/
	unsigned short	orgfnml;			/* 転送元ファイル名長さ				*/
	unsigned short	dstfnml;			/* 転送先仮想ファイル名長さ			*/
	unsigned short	wrt_md ;			/* 転送先ファイル書き込みモード		*/
	unsigned short	dum_s1 ;			/* 予備（short１）					*/
	unsigned short	intrvl ;			/* データ送信間隔					*/
	unsigned short	itidl  ;			/* 起動者識別子長さ					*/
	unsigned short	fstpwdl;			/* ファイルストアパスワード長さ		*/
	unsigned short	chrgl  ;			/* 課金先名称長さ					*/
	unsigned short	lineno ;			/* 回線番号					<FJ001>	*/
	unsigned char	dst_id[MLH_DSIDL];	/* 通信相手識別名			<FJ001>	*/
	unsigned char	orgfnm[MLH_FILNL];	/* 転送元ファイル名					*/
	unsigned char	dstfnm[MLH_FILNL];	/* 転送先仮想ファイル名				*/
	unsigned char	itid[MLH_INITL] ;	/* 起動者識別子						*/
	unsigned char	fstpwd[MLH_PSWDL] ;	/* ファイルストアパスワード			*/
	unsigned char	chrg[MLH_CHRGL];	/* 課金先名称						*/
	unsigned short	usrid ;				/* ユーザＩＤ				<FJ002>	*/
	unsigned short	grpid ;				/* グループＩＤ				<FJ002>	*/
	unsigned short	dtyp   ;			/* 診断タイプ						*/
	unsigned short	dum_s3 ;			/* 予備（short３）					*/
	unsigned long	eid    ;			/* 診断識別子						*/
	unsigned short	erobs  ;			/* エラー検出元						*/
	unsigned short	ersrc  ;			/* エラー発生元						*/
	unsigned long	dum_l2 ;			/* 予備（long２）					*/
}	ML_ATRS ;							/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体		*/
typedef	ML_ATRS	*ML_ATRS_P ;			/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ域構造体ﾎﾟｲﾝﾀ	*/


/****************************************************************************/
/*  ＭＩＡデータ域構造(２)　　                                              */
/*  　　中止要求データ域構造　　　                                          */
/****************************************************************************/
typedef	struct							/* 中止要求データ域構造				*/
{										/*									*/
	unsigned short	stp_mode ;			/* 中止モード						*/
	unsigned short	rq  ;				/* 要求元種別						*/
	unsigned long	rd  ;				/* 中止完了要求識別子				*/
	unsigned short	rpil;				/* 要求元プロセス識別名長さ			*/
	unsigned short	dum ;				/* 予備								*/
	unsigned char	rpi[MLH_PRCNL] ;	/* 要求元プロセス識別名				*/
}	ML_ASTPRQ ;							/* 要求ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ域構造体ﾎﾟｲﾝﾀ	*/


/****************************************************************************/
/*  ＭＩＡデータ域構造(３)　　                                              */
/*  　　中止／照会応答データ域構造                                          */
/****************************************************************************/

/****************************************************************************/
/*		中止／照会応答データ域構造可変部									*/
/****************************************************************************/
typedef	struct	ML_ASTV_TAG				/*　応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned short	fcid ;				/* ＦＣＩＤ							*/
	unsigned short	dum1 ;				/* 予備１							*/
	unsigned short	rq   ;				/* 要求元種別						*/
	unsigned short	sr   ;				/* 送受信種別						*/
	unsigned long	rd   ;				/* 中止完了要求識別子				*/
	unsigned short	rpil ;				/* 要求元プロセス識別名長さ			*/
	unsigned short	didl ;				/* 通信相手識別名長さ		<FJ001>	*/
	unsigned short	flnl ;				/* 転送中止/転送中自側ファイル名長さ*/
	unsigned short	dum2 ;				/* 予備２							*/
	unsigned char	rpi[MLH_PRCNL] ;	/* 要求元プロセス識別名				*/
	unsigned char	did[MLH_DSIDL] ;	/* 通信相手識別名			<FJ001>	*/
	unsigned char	fln[MLH_FILNL] ;	/* 転送中止／転送中自側ファイル名	*/
}	ML_ASTV ;							/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体		*/

/****************************************************************************/
/*		中止／照会応答データ域構造固定部									*/
/****************************************************************************/
typedef	struct	ML_ASTP_TAG				/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned long	stpfno ;			/* 転送中止／転送中ファイル数		*/
	ML_ASTV		stp[4 * 3] ;			/* 中止応答ﾃﾞｰﾀ域可変部ﾃｰﾌﾞﾙ(ﾀﾞﾐｰ)	*/
} ML_ASTP ;								/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体		*/
typedef	ML_ASTP	*ML_ASTP_P ;			/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体ﾎﾟｲﾝﾀ	*/


/*** <FJ002> ****************************************************************/
/*  ＭＩＡデータ域構造(４)　　                                              */
/*  　　ＦＣ確立許可依頼／応答データ域構造                                  */
/****************************************************************************/
typedef	struct	 ML_AFCP_TAG			/*　応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned short	fcid ;				/* ＦＣＩＤ							*/
	unsigned short	rslt ;				/* 許可判定結果						*/
	unsigned short	didl ;				/* 通信相手識別名長さ				*/
	unsigned short	iidl ;				/* 起動者識別名長さ					*/
	unsigned char	did[MLH_DSIDL] ;	/* 通信相手識別名					*/
	unsigned char	iid[MLH_INITL] ;	/* 起動者識別名						*/
}	ML_AFCP ;							/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体		*/
typedef	ML_AFCP	*ML_AFCP_P ;			/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体ﾎﾟｲﾝﾀ	*/


/*** <FJ002> ****************************************************************/
/*  ＭＩＡデータ域構造(５)　　                                              */
/*  　　ファイル転送開始／生成・削除完了通知データ域構造                    */
/****************************************************************************/
typedef	struct	 ML_AINF_TAG			/*　応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned short	fcid ;				/* ＦＣＩＤ							*/
	unsigned short	dumy ;				/* 予備								*/
										/* ###SSCY0106 start				*/
	unsigned short	didl ;				/* 通信相手識別名長さ				*/
	unsigned short	iidl ;				/* 起動者識別名長さ					*/
										/* ###SSCY0106 end					*/
	unsigned short	srcd ;				/* 送受信種別						*/
	unsigned short	flnl ;				/* 自側ファイル名長さ				*/
										/* ###SSCY0106 start				*/
	unsigned char	did[MLH_DSIDL] ;	/* 通信相手識別名					*/
	unsigned char	iid[MLH_INITL] ;	/* 起動者識別名						*/
										/* ###SSCY0106 end					*/
	unsigned char	fln[MLH_FILNL] ;	/* 自側ファイル名					*/
}	ML_AINF ;							/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体		*/
typedef	ML_AINF	*ML_AINF_P ;			/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体ﾎﾟｲﾝﾀ	*/


/*** <FJ002> ****************************************************************/
/*  ＭＩＡデータ域構造(５)　　                                              */
/*  　　ファイル転送終了 ###SSCY0106				                        */
/****************************************************************************/
typedef	struct	 ML_AEND_TAG			/*　応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned short	fcid ;				/* ＦＣＩＤ							*/
										/* ###SSCY0106 start				*/
	unsigned short	didl ;				/* 通信相手識別名長さ				*/
	unsigned short	iidl ;				/* 起動者識別名長さ					*/
	unsigned short	flnl ;				/* 自側ファイル名長さ				*/
	unsigned char	did[MLH_DSIDL] ;	/* 通信相手識別名					*/
	unsigned char	iid[MLH_INITL] ;	/* 起動者識別名						*/
	unsigned char	fln[MLH_FILNL] ;	/* 自側ファイル名					*/
										/* ###SSCY0106 end					*/
}	ML_AEND ;							/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体		*/
typedef	ML_AEND	*ML_AEND_P ;			/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体ﾎﾟｲﾝﾀ	*/

										/* ###SSCY0106 start				*/
/****************************************************************************/
/*  ＭＩＡデータ域構造(６)　　                                              */
/*  　　ＦＣ切断通知データ域構造   						                    */
/****************************************************************************/
typedef	struct	 ML_ATRM_TAG			/*　応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体ﾀｸﾞ	*/
{										/*									*/
	unsigned short	fcid ;				/* ＦＣＩＤ							*/
	unsigned short	dumy ;				/* 予備								*/
	unsigned short	didl ;				/* 通信相手識別名長さ				*/
	unsigned short	iidl ;				/* 起動者識別名長さ					*/
	unsigned char	did[MLH_DSIDL] ;	/* 通信相手識別名					*/
	unsigned char	iid[MLH_INITL] ;	/* 起動者識別名						*/
}	ML_ATRM ;							/* 応答ｲﾝﾀｰﾌｪｰｽﾃﾞｰﾀ領域構造体		*/
typedef	ML_ATRM	*ML_ATRM_P ;			/* 応答ｲﾝﾀｰﾌｪｰｽデータ域構造体ﾎﾟｲﾝﾀ	*/
										/* ###SSCY0106 end					*/

/****************************************************************************/
/*						ＰＳＥＣＴ・ＦＴＡＭ構造体							*/
/****************************************************************************/
typedef	struct							/* PSECT･FTAM域構造体				*/
{										/*									*/
	unsigned long	mboxid;				/* ACE-SMP･FTAMﾌﾟﾛｾｽ,ﾒｰﾙﾎﾞｯｸｽID		*/
	unsigned char	pn[MLH_PRCNL];		/* ACE-SMP･FTAMﾌﾟﾛｾｽ,ﾌﾟﾛｾｽ識別名	*/
}	MLH_PSECT ;							/* PSECT･FTAM域構造体				*/
										/**** END ***************** <FJ002> */
										/**** END ******************<FJ003>**/


#endif
/*********************** <<<<< end of ml_aftam.h >>>>> **********************/
