/****************************************************************************/
/*  著作権　１９９４                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/*                                                                          */
/*                                                                          */
/*  収容物  ＡＣＥ−ＳＭＰシステム                                          */
/****************************************************************************/
/*                                                                          */
/*                                                                          */
/*                                                                          */
/*      ＡＣＥ−ＳＭＰ　ＦＴＡＭプログラムサービスコール用型定義ヘッダ      */
/*                                                                          */
/*      <ml_a0000.h>                                                        */
/*                                                                          */
/*                                                                          */
/*＜修正：ＩＤ／年月日／氏名＞                                              */
/*  <FJ001> : １９９４年１０月２２日        楠田英幸                        */
/*            　仕様変更（ＳＳＣＹ００２８／２９）                          */
/*  <FJ002> : １９９４年１１月　８日        楠田英幸                        */
/*            ・サービスコール用ｉｎｃｌｕｄｅの変更                        */
/*                                                                          */
/*                                                                          */
/****************************************************************************/


#ifndef	ML_A0000						/*							<FJ001>	*/
#define	ML_A0000


/****************************************************************************/
/******************************** 標準ヘッダ・ファイル **********************/
/****************************************************************************/
#include	<mc.h>						/* ＭＣ共通部定義ヘッダファイル		*/
#include	<mcmia.h>					/* ＭＩＡ共通部定義ヘッダファイル	*/

#include	<mo.h>						/* ＭＯ共通部定義ヘッダファイル		*/
#include	<mo_wlg.h>					/* Ｓトレース専用ヘッダファイル		*/

#include	<tcom.h>					/* ACE-SMPﾃｰﾌﾞﾙ共通部ﾍｯﾀﾞ			*/
#include	<tpct.h>					/* ＴＰＣＴヘッダファイル			*/
#include	<teft.h>					/* SMP FTAM SG ﾃｰﾌﾞﾙ定義ﾍｯﾀﾞﾌｧｲﾙ	*/
#include	<psect.h>					/* プロセス共通ＰＳＥＣＴヘッダ		*/


/****************************************************************************/
/*********************************** ＤＥＦＩＮＥ部 *************************/
/****************************************************************************/
#define	ZERO		0					/* 定数の定義						*/
#define	NORMAL		0					/* 定数の定義						*/


/****************************************************************************/
/*********************************** 型　宣言 *******************************/
/****************************************************************************/
typedef	unsigned char	u_char ;			/* ヘキサ文字列用					*/
typedef	unsigned short	u_short  ;			/* 符号無し２バイト					*/
typedef	unsigned long	u_long ;			/* 符号無し４バイト					*/

typedef	unsigned char	UBYTE ;			/* ヘキサ文字列用					*/
typedef          short	SHORT ;			/* 符号付き２バイト					*/
typedef	unsigned short	WORD  ;			/* 符号無し２バイト					*/
typedef	long			LONG  ;			/* 符号付き４バイト					*/
typedef	unsigned long	DWORD ;			/* 符号無し４バイト					*/

#endif									/*							<FJ001>	*/
/*********************** <<<<< end of ml_a0000.h >>>>> **********************/
