/****************************************************************************/
/*  著作権　１９９４                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/*                                                                          */
/*                                                                          */
/*  収容物  ＡＣＥ−ＳＭＰシステム                                          */
/****************************************************************************/
/*                                                                          */
/*                                                                          */
/*        ＡＣＥ−ＳＭＰ　ＦＴＡＭプログラム 提供関数用ヘッダファイル       */
/*                                                                          */
/*                                                                          */
/*          <ml_a0001.h>                   FTAMﾌﾟﾛｸﾞﾗﾑ 提供関数ﾍｯﾀﾞﾌｧｲﾙ     */
/*                                                                          */
/*                                                                          */
/*＜修正：ＩＤ／年月日／氏名＞                                              */
/*  <FJ001> : １９９４年１０月２２日        楠田英幸                        */
/*            　仕様変更（ＳＳＣＹ００２８／２９）                          */
/*  <FJ002> : １９９４年１１月　８日        楠田英幸                        */
/*            ・仕様変更（ＳＳＣＹ００？？）レスポンダ通知処理追加          */
/*            ・サービスコール用ｉｎｃｌｕｄｅの変更                        */
/*  <FJ003> : １９９6年5月　9日        田中宏之		                        */
/*            ・ST4341確認試験にて修正								        */
/*            ・mdc_gtadの型宣言の修正				                        */
/*                                                                          */
/****************************************************************************/


#ifndef	ML_A0001						/*							<FJ001>	*/
#define	ML_A0001


/****************************************************************************/
/*********************************** ＤＥＦＩＮＥ部 *************************/
/****************************************************************************/

/****************************************************************************/
/*  サービスコールパラメータ定義                                            */
/****************************************************************************/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*  転送先ファイル書き込みモード                                            */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define	MLH_WMD0	0					/* 転送先ファイル書き込みモード:0	*/
#define	MLH_WMD1	1					/* 転送先ファイル書き込みモード:1	*/
#define	MLH_WMD2	2					/* 転送先ファイル書き込みモード:2	*/
#define	MLH_WMD3	3					/* 転送先ファイル書き込みモード:3	*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*  中止モード                                                              */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define	MLH_STP1	1					/* 中止モード：１					*/
#define	MLH_STP2	2					/* 中止モード：２					*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*  要求元種別                                                              */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define	MLH_RQINT	1					/* 要求元種別：発呼側				*/
#define	MLH_RQRSP	2					/* 要求元種別：応答側				*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*  送受信種別                                                              */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define	MLH_FTSND	1					/* 送受信種別：送信中				*/
#define	MLH_FTRCV	2					/* 送受信種別：受信中				*/
#define	MLH_FIDOL	3					/* 送受信種別：未転送中				*/
#define	MLH_FTCRE	4					/* 送受信種別：生成中				*/


										/* START					<FJ001>	*/
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*  回線番号上限値                                                          */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define	MLH_PUMAX	1					/* ＰＵ番号上限値					*/
#define	MLH_CHMAX	63					/* ＣＨ番号上限値					*/
										/* END						<FJ001>	*/

/****************************************************************************/
/*  ＭＫコード定義                                                          */
/****************************************************************************/
#define	MK1_REF		0x03				/* ＭＫ１：持ち回り電文				*/
#define	MK2_TOOL	0x10				/* ＭＫ２：FROM TOOL(FTAM) TO AP	*/
#define	MK2_AP		0x20				/* ＭＫ２：FROM AP TO TOOL(FTAM)	*/
#define	MKX_00		0x00				/* ＭＫ３，４：ゼロ設定用			*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*  ＭＫコードの配置を異なる処理系でも吸収するための添え字定義              */
/*  ※　ＳＭＰコーディング規約＃ｉｆｄｅｆ機能に従う。                      */
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#ifdef	IBM
#define	MK1			3					/* ＭＫ１の配列位置					*/
#define	MK2			2					/* ＭＫ２の配列位置					*/
#define	MK3			1					/* ＭＫ３の配列位置					*/
#define	MK4			0					/* ＭＫ４の配列位置					*/
#else
#define	MK1			0					/* ＭＫ１の配列位置					*/
#define	MK2			1					/* ＭＫ２の配列位置					*/
#define	MK3			2					/* ＭＫ３の配列位置					*/
#define	MK4			3					/* ＭＫ４の配列位置					*/
#endif


/****************************************************************************/
/*  ＭＩＡ電文設定値定義													*/
/****************************************************************************/
#define	MIA_HCODE	0x02				/* MIA共通域：格納域種別(ﾃﾞｰﾀ有)	*/
#define	MIA_DCODE	0x10				/* MIA共通域：ﾃﾞｰﾀ種別(ﾃﾞｰﾀ有)		*/
#define	MIA_NODATA	0x00				/* MIA共通域：(上２の値=ﾃﾞｰﾀ無)		*/

										/* START					<FJ002>	*/
#define	MLH_GTUID	0					/* ﾕｰｻﾞ識別子取得ﾊﾟﾗﾒｰﾀ：ﾕｰｻﾞID		*/
#define	MLH_GTGID	1					/* ﾕｰｻﾞ識別子取得ﾊﾟﾗﾒｰﾀ：ｸﾞﾙｰﾌﾟID	*/
										/* END						<FJ002>	*/

/****************************************************************************/
/*  Ｓトレース情報識別子                                                    */
/****************************************************************************/
#define	ML_AESND	0x6D6C5F61,0x65736E64
#define	ML_AERCV	0x6D6C5F61,0x65726376
#define	ML_AESTP	0x6D6C5F61,0x65737470
#define	ML_AEINQ	0x6D6C5F61,0x65696E71
#define	ML_AGBER	0x6D6C5F61,0x67626572
#define	ML_AOSER	0x6D6C5F61,0x6F736572

#define	ML_FTSND	0x66747365,0x6E642020
#define	ML_FTRCV	0x66747265,0x63762020
#define	ML_FTSTP	0x66747374,0x6F702020
#define	ML_FTINQ	0x6674696E,0x71202020

#define	ML_PINT		0x6D6C5F70,0x696E7420
#define	ML_PTRM		0x6D6C5F70,0x74726D20


/****************************************************************************/
/*  モジュールＩＤ                                                          */
/****************************************************************************/
#define	ML_AESNDID	0x3601				/* ml_aesnd							*/
#define	ML_AERCVID	0x3602				/* ml_aercv							*/
#define	ML_AESTPID	0x3603				/* ml_aestp							*/
#define	ML_AEINQID	0x3604				/* ml_aeinq							*/

#define	ML_FTSNDID	0x3611				/* ftsend							*/
#define	ML_FTRCVID	0x3612				/* ftrecv							*/
#define	ML_FTSTPID	0x3613				/* ftstop							*/
#define	ML_FTINQID	0x3614				/* ftinq							*/

#define	ML_PINTID	0x3621				/* ｍｌ＿ｐｉｎｔ					*/
#define	ML_PTRMID	0x3622				/* ｍｌ＿ｐｔｒｍ					*/


/****************************************************************************/
/************************************ 外部変数宣言 **************************/
/****************************************************************************/
extern	PSCPSECT	pscparea ;			/* システム共通ＰＳＥＣＴ			*/


/****************************************************************************/
/******************************** 外部関数使用宣言 **************************/
/****************************************************************************/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	ＴＲＡＤＥシステムコール												*/
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
extern	long	ossenmsp();				/* ﾌﾟｰﾙﾊﾞｯﾌｧ上のﾒｯｾｰｼﾞ送信			*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	ＳＭＰ提供関数使用宣言													*/
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
extern	long	mo_gtbf();				/* ｱｸｾｽ権付きﾌﾟｰﾙﾊﾞｯﾌｧの確保		*/
extern	long	mo_frbf();				/* ﾌﾟｰﾙﾊﾞｯﾌｧの解放					*/
extern	void	mo_wlg4();				/* Ｓトレース情報取得関数(mo_wlg4)	*/
extern	void	mo_wlg6();				/* Ｓトレース情報取得関数(mo_wlg6)	*/

extern	long	mc_nclr();				/* 領域のＮＵＬＬクリア				*/
extern	long	mc_copy();				/* 領域間の指定文字数コピー			*/
extern	long	mc_ccpy();				/* 領域間のＮＵＬＬ文字までのコピー	*/

										/* START					<FJ001>	*/
extern	long	mdc_gtad();				/* 外部テーブルアドレス取得			*/
										/* 							<FJ003>	*/
										/* END						<FJ001>	*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
extern	long	ml_aesnd();				/* FTAMﾌｧｲﾙ送信要求					*/
extern	long	ml_aercv();				/* FTAMﾌｧｲﾙ受信要求					*/
extern	long	ml_aestp();				/* FTAM転送中ﾌｧｲﾙ中止要求			*/
extern	long	ml_aeinq();				/* FTAM転送中ﾌｧｲﾙ照会要求			*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
extern	long	ml_pint();				/* 提供関数：ｍｌ＿ｐｉｎｔ			*/
extern	long	ml_ptrm();				/* 提供関数：ｍｌ＿ｐｔｒｍ			*/

/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
extern	long	ml_agber();				/* バッファ確保エラー処理			*/
extern	long	ml_aoser();				/* メッセージ送信エラー処理			*/
										/* START					<FJ001>	*/
extern	void	ml_aset0();				/* ＭＩＡ共通部設定					*/
extern	void	ml_aset1();				/* ＭＩＡ個別部設定					*/
extern	long	ml_aset2();				/* ＭＩＡ個別部設定２		<FJ002>	*/

extern	long	ml_aepsc();				/* PSECT-FTAM情報設定ﾁｪｯｸ			*/
extern	long	ml_achk1();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:通信相手識別名		*/
extern	long	ml_achk2();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:転送ファイル名		*/
extern	long	ml_achk3();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:転送先ﾌｧｲﾙ書込ﾓｰﾄﾞ	*/
extern	long	ml_achk4();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:起動者識別子			*/
extern	long	ml_achk5();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:ﾌｧｲﾙｽﾄｱﾊﾟｽﾜｰﾄﾞ		*/
extern	long	ml_achk6();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:課金先名称			*/
extern	long	ml_achk7();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:データ送信間隔		*/
extern	long	ml_achk8();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:回線番号				*/
extern	long	ml_achk9();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:中止モード			*/
extern	long	ml_achka();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:要求元種別			*/
extern	long	ml_achkb();				/* ﾊﾟﾗﾒｰﾀﾁｪｯｸ:要求元ﾌﾟﾛｾｽ識別名		*/
										/* END						<FJ001>	*/


/****************************************************************************/
/******************************** 共通マクロ　定義 **************************/
/****************************************************************************/

/****************************************************************************/
/*  ルートチェック用ＰＲＩＮＴ文											*/
/****************************************************************************/
#ifdef	PRON
#define	MLH_PRINT(p0)						printf(p0)
#define	MLH_PRIN1(p0,p1 )					printf(p0,p1)
#define	MLH_PRIN2(p0,p1,p2)					printf(p0,p1,p2)
#define	MLH_PRIN3(p0,p1,p2,p3 )				printf(p0,p1,p2,p3)
#define	MLH_PRIN4(p0,p1,p2,p3,p4)			printf(p0,p1,p2,p3,p4)
#define	MLH_PRIN5(p0,p1,p2,p3,p4,p5)		printf(p0,p1,p2,p3,p4,p5)
#define	MLH_PRIN6(p0,p1,p2,p3,p4,p5,p6)		printf(p0,p1,p2,p3,p4,p5,p6)
#define	MLH_PRIN7(p0,p1,p2,p3,p4,p5,p6,p7)	printf(p0,p1,p2,p3,p4,p5,p6,p7)
#define	MLH_PRIN8(p0,p1,p2,p3,p4,p5,p6,p7,p8)	\
		   printf(p0,p1,p2,p3,p4,p5,p6,p7,p8)
#else
#define	MLH_PRINT(p0)							{;}
#define	MLH_PRIN1(p0,p1)						{;}
#define	MLH_PRIN2(p0,p1,p2 )					{;}
#define	MLH_PRIN3(p0,p1,p2,p3)					{;}
#define	MLH_PRIN4(p0,p1,p2,p3,p4)				{;}
#define	MLH_PRIN5(p0,p1,p2,p3,p4,p5)			{;}
#define	MLH_PRIN6(p0,p1,p2,p3,p4,p5,p6)			{;}
#define	MLH_PRIN7(p0,p1,p2,p3,p4,p5,p6,p7)		{;}
#define	MLH_PRIN8(p0,p1,p2,p3,p4,p5,p6,p7,p8)	{;}
#endif

#endif									/*							<FJ000>	*/
/*********************** <<<<< end of ml_a0001.h >>>>> **********************/
