/*****************************NTC-SMP-TOOL****************************/
/*                                                                   */
/*  1 ŽÌŽ±Ž²ŽÙŽÒŽ²                                                         */
/*     mlcdef.h                                                      */
/*                                                                   */
/*  2 Ž¸ŽÌŽÞŽÝ                                                           */
/*     Ž·ŽÖŽ³ŽÂŽ³ define ŽÌŽ±Ž²ŽÙ                                             */
/*                                                                   */
/*  3 ŽØŽÚŽ·                                                            */
/*     Ž¾ŽÂŽ¹Ž² Ž¼ŽÔ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ»                                          */
/*     Ž»Ž¸Ž¾Ž² Ž¼ŽÔ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ»             ,86/01/21                    */
/*     ŽÍŽÝŽºŽ³ Ž¼ŽÔ :                                                     */
/*                                                                   */
/*********************************************************************/
/*********************************************************************/
/*  ŽÍŽÝŽ·Ž¬Ž¸ŽÁ                                                           */
/*********************************************************************/
#define   MLCNMAL        0              /* Ž¾Ž²Ž¼ŽÞŽÖŽ³ Ž¼ŽÕŽ³ŽØŽÖŽ³             */
#define   MLCCONT     -104              /* Ž»Ž²ŽºŽÞ Ž¶ŽÞ Ž¸Ž·ŽÞŽØŽÓŽ¼ŽÞ ŽÃŽÞ Ž±ŽÂŽÀ    */
#define   MLCCHAR     -105              /* ŽÓŽ¼ŽÞŽÚŽÂ ŽÉ ŽÄŽÁŽ­Ž³ ŽÃŽÞ ŽµŽÜŽ¯ŽÀ      */
#define   MLCOVER     -108              /* Žµ-ŽÊŽÞ- ŽÌŽÛ-                 */
#define   MLCERR      -124              /* Ž´Ž×-                       */
#define   MLCBLK      -120              /* ŽºŽÏŽÝŽÄŽÞ ŽÓŽ¼ŽÞ Ž¶ŽÞ Žµ-ŽÙ ŽÌŽÞŽ×ŽÝŽ¸    */
#define   MLCIOER     -116              /* i/o Ž´Ž×-                   */
#define   MLCEND      -112              /* eof                       */
#define   MLCTOVR        1              /* ŽÀŽ²ŽÑŽµŽ°ŽÊŽÞ                   */
/*********************************************************************/
/*  Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÁ                                                         */
/*********************************************************************/
#define   MLCMAX         8              /* Ž·Ž°ŽÊŽßŽ× ŽÁŽªŽ¯Ž¸ ŽÃŽ°ŽÌŽÞŽÙ ŽÉ        */
                                        /* ŽµŽÍŽßŽ×ŽÝŽÄŽÞ ŽºŽ½Ž³ ŽÉ MAX         */
