/*****************************NTC-SMP-TOOL****************************/
/*                                                                   */
/*   1 ŽÌŽ§Ž²ŽÙŽÒŽ²                                                        */
/*      Ž¼Ž½ŽÃŽÑŽºŽ°ŽÙ Ž´Ž×Ž°Ž¼ŽÞ ŽÉ Ž¼Ž®ŽØŽÖŽ³ Ž²ŽÝŽ¸ŽÙŽ°ŽÄŽÞŽÌŽ§Ž²ŽÙ                            */
/*                                                                   */
/*   2 Ž¸ŽÌŽÞŽÝ                                                          */
/*      TOOL Ž·Ž®Ž³ŽÂŽ³                                                   */
/*                                                                   */
/*   3 ŽØŽÚŽ·                                                           */
/*      Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽºŽÞŽÄŽ³ Ž¶Ž½ŽÞŽÄ			88/05/27	(TC1239:Ž¼ŽÍŽÝ)         */
/*      Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽºŽÞŽÄŽ³ Ž¶Ž½ŽÞŽÄ 		88/05/27	(TC1239:Ž¼ŽÍŽÝ)         */
/*      ŽÍŽÝŽºŽ³ Ž¼Ž¬ :                                                    */
/*                                                                   */
/*********************************************************************/
#include "mc.h"
#include "tcom.h"
#include "psect.h"

extern PSCPSECT pscparea;
#define MLOSERR(p1,p2) (pscparea.pscoseki = p1, \
						pscparea.pscosede = p2)
