/*****************************NTC-SMP-TOOL****************************/
/*																	 */
/*	1 ŽÌŽ±Ž²ŽÙŽÒŽ²														 */
/*		mlcstr.h 													 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		Ž·ŽÖŽ³ŽÂŽ³ struct ŽÌŽ±Ž²ŽÙ											 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾ŽÂŽ¹Ž² Ž¼ŽÔ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ» 										 */
/*		Ž»Ž¸Ž¾Ž² Ž¼ŽÔ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ» 	'86/01/21							 */
/*		ŽÍŽÝŽºŽ³ Ž¼ŽÔ : Ž¼ŽÐŽ½ŽÞ ŽµŽ»ŽÑ		'88/07/20 (ŽºŽÒŽÝŽÄ)					 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*	ŽÌŽ«Ž°ŽÏŽ¯ŽÄ Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÃŽ°ŽÌŽÞŽÙ ( ml_cprt, ml_cpfm ŽÖŽ³ )						 */
/*********************************************************************/
struct	mlcftbl {
	long	mlcfptr;					/* ŽÍŽÝŽ¶ŽÝ ŽºŽÞ ŽÃŽÞ-ŽÀ Ž¶Ž¸ŽÉŽ³ Ž´ŽØŽ± ŽÉ	 */
										/* ŽµŽÌŽ¾Ž¯ŽÄ (Ž³ŽÒŽºŽÐ ŽÓŽ¼ŽÞŽÉ ŽµŽÌŽ¾Ž¯ŽÄ)	 */
	long	mlcflen;					/* ŽÍŽÝŽ¶ŽÝ ŽºŽÞ ŽÃŽÞ-ŽÀ ŽÁŽÖŽ³ 		 */
	char	mlcfatr;					/* ŽÍŽÝŽ¶ŽÝ Ž¿ŽÞŽ¸Ž¾Ž²				 */
										/*	'X','x' : 16Ž¼ŽÝ  ŽÍŽÝŽ¶ŽÝ	 */
										/*	'C','c' : ŽÓŽ¼ŽÞ   ŽÍŽÝŽ¶ŽÝ	 */
										/*	'D','d' : ŽÊŽÞŽ²ŽÅŽØ ŽÍŽÝŽ¶ŽÝ	 */
	char	mlcfdmh[3];					/* ŽÀŽÞŽÐ- 					 */
	long	mlcfbln;					/* ŽÍŽÝŽ¶ŽÝ ŽÏŽ´ ŽÃŽÞ-ŽÀ ŽÁŽÖŽ³ 		 */
	union { 							/* ŽÍŽÝŽ¶ŽÝ ŽÀŽ²Ž¼ŽÖŽ³ ŽØŽÖŽ³Ž²Ž· ŽÉ Ž±ŽÄŽÞŽÚŽ½	 */
		short	*mlcfsp;				/*	(short) 				 */
		long	*mlcflp;				/*	(long)					 */
		char	*mlcfcp;				/*	(char)					 */
	} mlcfbpt;
};
 
typedef	struct	mlcftbl	MLCFTBL;

/*********************************************************************/
/*	Ž·Ž°ŽÊŽßŽ×ŽÒŽÀ ŽÁŽªŽ¯Ž¸ ŽÃŽ°ŽÌŽÞŽÙ ( ml_ckyc ŽÖŽ³ )								 */
/*********************************************************************/
struct	mlcktbl	{
	char	mlckkey;					/* Ž·Ž°ŽÁ (Ž·Ž°ŽÊŽßŽ×ŽÒŽÀ ŽÉ ŽÓŽ¼ŽÞ)		 */
	char	mlckdy1;					/* dummy1					 */
	short	mlckcnt;					/* ŽÆŽ­Ž³ŽØŽ®Ž¸Ž»ŽÚŽÀ Ž·Ž° Ž½Ž³ (output)	 */
	char	mlckst1;					/* ŽµŽÍŽßŽ×ŽÝŽÄŽÞ ŽÖŽ³/ŽÌŽÖŽ³ Ž¼ŽÞŽ®Ž³ŽÎŽ³	 */
										/*	'Y' : ŽËŽ¯Ž½				 */
										/*	'N' : ŽÅŽ¼				 */
										/*	'D' : Ž¼Ž®Ž³ŽØŽ¬Ž¸ Ž¶ŽÉŽ³		 */
	char	mlckst2;					/* ŽËŽ¯Ž½ Ž·- Ž¶ Ž²ŽÅŽ¶ 			 */
										/*	'Y' : ŽËŽ¯Ž½				 */
										/*	'N' : Ž¼Ž®Ž³ŽØŽ¬Ž¸ Ž¶ŽÉŽ³		 */
	short	mlckmax;					/* Ž·- ŽÆŽ­Ž³ŽØŽ®Ž¸ MAX Ž½Ž³ 		 */
	short	mlckoid;					/* ŽÊŽ²ŽÀ Ž·- INDEX 			 */
										/*	-1  : ŽÑŽ¶ŽÝŽ¹Ž²				 */
	short	mlcksid;					/* Ž¼ŽÞŽ­Ž³Ž¿ŽÞŽ¸ Ž·- INDEX 		 */
										/*	-1  : ŽÑŽ¶ŽÝŽ¹Ž²				 */
	short	mlckpid;					/* Ž·Ž®Ž³ Ž¿ŽÞŽÝ Ž·- INDEX 		 */
										/*	-1  : ŽÑŽ¶ŽÝŽ¹Ž²				 */
	short	mlckdy2;					/* dummy2					 */
	char	*mlckopp[MLCMAX];			/* ŽµŽÍŽßŽ×ŽÝŽÄŽÞ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ (output) */
};
typedef	 struct mlcktbl	MLCKTBL;
