/**************************** NTC-SMP-TOOL ***************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		Ž·ŽÞŽ¼ŽÞ I/O ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mli.h)									 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		Ž·ŽÞŽ¼ŽÞ I/O													 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž²Ž¼Ž¬ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ»											 */
/*		Ž»Ž¸Ž¾Ž²Ž¼Ž¬ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ»											 */
/*		ŽÍŽÝŽºŽ³Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ				'87/11/19 (L01)				 */
/*				 (Ž¼ŽÞŽ­Ž¼ŽÝ ŽÒŽ¯Ž¾-Ž¼ŽÞ ŽØŽ®Ž³Ž²Ž· ŽÉ Ž¶Ž¸ŽÀŽÞŽ²) --- STC514 (bug)		 */
/*																	 */
/*********************************************************************/

/**************************************************/
/*   Ž·ŽÞŽ¼ŽÞ  IO define   		                      */
/**************************************************/
#define	UCHAR	unsigned char
#define	MSGMAX	2048L					/* STC514 87-11-19	   (L01) */
#define	MIAMAX	128L
#define	MKCOD1	0x030B0000				/* F-io -> B-io				 */
#define	MKCOD2	0x03060000				/* SCP  -> B-io 			 */
#define	FILNAME "/usr/smp/mlg "
#define	LIM		13
#define	DEV		" < /dev/console > /dev/console"
#define	DEVLEN	31
#define D_ON	1						/* DRV RUNNING	*/
#define D_OFF	0						/* DRV STOP		*/
#define	DRVPROC "drv000"

long	drv_mbid; 
