/*****************************NTC-SMP-TOOL****************************/
/*                                                                   */
/*   1 ŽÌŽ§Ž²ŽÙŽÒŽ²                                                        */
/*      defineŽÌŽÞŽÝ ŽÃŽ²Ž·ŽÞŽÌŽ§Ž²ŽÙ(mljdef.h)                                 */
/*                                                                   */
/*   2 Ž¸ŽÌŽÞŽÝ                                                          */
/*      Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÀŽÞŽÝŽÌŽß                                                 */
/*      Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÊŽßŽ¯ŽÁ                                                  */
/*                                                                   */
/*   3 ŽØŽÚŽ·                                                           */
/*      Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽºŽÞŽÄŽ³ Ž¶Ž½ŽÞŽÄ                        			         */
/*      Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽµŽÊŽÞŽÀ ŽÄŽ¼Žº                          			     */
/*      ŽÍŽÝŽºŽ³ Ž¼Ž¬ :                                                    */
/*                                                                   */
/*********************************************************************/
/*  ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽÉ DEFINEŽÌŽÞŽÝ                                               */
/*********************************************************************/
#define   MLJNML    0         /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ 							 */
#define   MLJMAT    5         /* Ž¶ŽÞŽ²ŽÄŽ³ŽÚŽºŽ°ŽÄŽÞ ŽºŽÃŽ²ŽÌŽÞŽÃŽÞŽ±ŽÙ/Ž¶ŽÞŽ²ŽÄŽ³ Ž½ŽÙ 		 */
#define   MLJENJ   10         /* ŽÚŽºŽ°ŽÄŽÞŽÁŽªŽ¯Ž¸ Ž¼Ž­Ž³ŽØŽ®Ž³ 					 */
#define   MLJERR   -1         /* Ž²Ž¼ŽÞŽ®Ž³ 								 */
#define   MLJNDP   -5         /* ŽÀŽÞŽÝŽÌŽßŽÀŽ²Ž¼Ž®Ž³ ŽÅŽ¼ 						 */
#define   MLJNMA  -10         /* Ž¶ŽÞŽ²ŽÄŽ³Ž¼ŽÅŽ² 							 */
#define   MLJKPE  -15         /* Ž·Ž°ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž° 						 */
#define   MLJPOE  -20         /* Ž·Ž°ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽµŽÍŽßŽ×ŽÝŽÄŽÞ Ž´Ž×Ž° 				 */
#define   MLJJFN  -25         /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙŽÒŽ² Ž´Ž×Ž° 					 */
#define   MLJJFO  -30         /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙ ŽµŽ°ŽÌŽßŽÝ Ž´Ž×Ž° 				 */
#define   MLJJFC  -35         /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙ ŽºŽÈŽ¸ŽÄ Ž´Ž×Ž° 				 */
#define   MLJOFN  -40         /* Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙŽÒŽ² Ž´Ž×Ž° 					 */
#define   MLJOFO  -45         /* Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙ ŽµŽ°ŽÌŽßŽÝ Ž´Ž×Ž° 				 */
#define   MLJOFC  -55         /* Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙ Ž¸ŽØŽ´Ž²ŽÄ Ž´Ž×Ž° 				 */
#define   MLJIFN  -60         /* ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙŽÒŽ² Ž´Ž×Ž°                    */
#define   MLJIFO  -65         /* ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙ ŽµŽ°ŽÌŽßŽÝ Ž´Ž×Ž°                */
#define   MLJIFC  -70         /* ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙ ŽºŽÈŽ¸ŽÄ Ž´Ž×Ž°                 */
#define   MLJOVR  -75         /* ŽÆŽ­Ž³ŽØŽ®Ž¸ ŽÓŽ¼ŽÞ ŽµŽ°ŽÊŽÞŽ°                    */
#define   MLJRED   15         /* ŽÚŽºŽ°ŽÄŽÞ Ž¼Ž­Ž³ŽØŽ®Ž³                        */
#define   MLJEND   20         /* Ž¼Ž­Ž³ŽØŽ®Ž³                              */
#define   MLJNXT   25         /* ŽºŽÏŽÝŽÄŽÞ 'N' ŽÆŽ®Ž³ŽØŽ®Ž¸                    */
#define   MLJSAV   30         /* ŽºŽÏŽÝŽÄŽÞ 'S' ŽÆŽ®Ž³ŽØŽ®Ž¸                    */
#define   MLJCNL   35         /* ŽºŽÏŽÝŽÄŽÞ 'C' ŽÆŽ®Ž³ŽØŽ®Ž¸                    */
#define   MLJSPC   40         /* ŽºŽÏŽÝŽÄŽÞ ' ' ŽÆŽ®Ž³ŽØŽ®Ž¸                    */
#define   MLJUPD   45         /* Ž¼Ž­Ž³Ž¾Ž²ŽºŽÏŽÝŽÄŽÞ ŽÆŽ­Ž³ŽØŽ®Ž¸                   */
/*********************************************************************/
/*  ŽÃŽ²Ž½Ž³ŽÁ ŽÉ DEFINEŽÌŽÞŽÝ                                                */
/*********************************************************************/
#define   MLJKPNM   17        /* Ž·Ž°ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž½Ž³ 						 */
#define   MLJOPMX   256		  /* ŽµŽÍŽßŽ×ŽÝŽÄŽÞ MAX 						 */
#define   MLJPNOM   20        /* Ž´Ž×Ž°ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¶ŽÍŽÝŽºŽ³ŽÓŽ¸ ŽÉ Ž¶Ž½ŽÞ 			 */
#define   MLJMLN    100       /* Ž´Ž×Ž°ŽÒŽÂŽ¾Ž°Ž¼ŽÞ ŽÁŽ®Ž³ 						 */
#define   MLJMGL    500       /* ŽÒŽÂŽ¾Ž°Ž¼ŽÞ ŽÁŽ®Ž³ 						 */
/*********************************************************************/
/*  ŽÃŽ²Ž½Ž³ŽÁ ŽÉ DEFINEŽÌŽÞŽÝ(Ž¹ŽÝŽ»Ž¸ŽÓŽ°ŽÄŽÞ)                                      */
/*********************************************************************/
#define	  MLJRS	    0		  /* SMPŽ´ŽØŽ±1							 */
#define	  MLJRE	    1		  /* SMPŽ´ŽØŽ±2							 */
#define	  MLJSQ	    2		  /* Ž¼Ž°Ž¹ŽÝŽ¼Ž¬ŽÙ							 */
#define	  MLJIJ	    3		  /* IJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJFJ	    4		  /* FJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJTJ	    5		  /* TJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJKJ	    6		  /* KJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJNJ	    7		  /* NJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJAJ	    8		  /* AJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJSJ	    9		  /* SJŽÃŽÞŽ°ŽÀ 							 */
#define	  MLJRJ	    10		  /* RJŽÃŽÞŽ°ŽÀ 							 */
