/*********************************************************************/
/*  ŽÒŽÂŽ¾-Ž¼ŽÞ ŽÉ ŽÄŽ³ŽÛŽ¸                                                    */
/*********************************************************************/
#define	MLJMGN	75
MLJMESG msgtbl[MLJMGN] = {
	{100,"JPAT:Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙŽÒŽ² Ž¦ ŽÆŽ­Ž³ŽØŽ®Ž¸Ž¼ŽÃŽ¸ŽÀŽÞŽ»Ž²\n"},
	{101,"JPAT:Ž»ŽÌŽÞŽºŽÏŽÝŽÄŽÞ Ž¦ ŽÆŽ­Ž³ŽØŽ®Ž¸Ž¼ŽÃŽ¸ŽÀŽÞŽ»Ž²\n"},
	{102,
"JPAT:ŽÀŽ²Ž¼ŽÖŽ³ŽÃŽÞŽ°ŽÀ Ž¦ ŽÒŽÆŽ­Ž° Ž¶Ž× Ž¾ŽÝŽÀŽ¸ Ž¼ŽÃŽ¸ŽÀŽÞŽ»Ž²\n\
    0  Ž¼Ž°Ž¹ŽÝŽ¼Ž¬ŽÙ              N ŽÂŽ·ŽÞŽÉŽÚŽºŽ°ŽÄŽÞ\n\
    1  FJ(ŽÌŽ§Ž²ŽÙ ŽºŽ³Ž¼ŽÝ ŽÃŽÞŽ°ŽÀ)   E ŽÚŽºŽ°ŽÄŽÞŽ¼Ž­Ž³ŽØŽ®Ž³\n\
    2  TJ(ŽÃŽ°ŽÌŽÞŽÙ ŽºŽ³Ž¼ŽÝ ŽÃŽÞŽ°ŽÀ)  C Ž·Ž¬ŽÝŽ¾ŽÙ\n\
    3  KJ(Ž¶ŽÝŽ¼ŽÞŽ®Ž³Ž¼Ž®Ž³ŽºŽÞŽ³ ŽÃŽÞŽ°ŽÀ)\n"},
	{103,"\
JPAT:ŽÀŽ²Ž¼ŽÖŽ³ŽÃŽÞŽ°ŽÀ Ž¦ ŽÒŽÆŽ­Ž° Ž¶Ž× Ž¾ŽÝŽÀŽ¸ Ž¼ŽÃŽ¸ŽÀŽÞŽ»Ž²\n\
    0  Ž¼Ž°Ž¹ŽÝŽ¼Ž¬ŽÙ              N ŽÂŽ·ŽÞŽÉŽÚŽºŽ°ŽÄŽÞ\n\
    1  SMPŽ´ŽØŽ±1              E ŽÚŽºŽ°ŽÄŽÞŽ¼Ž­Ž³ŽØŽ®Ž³\n\
    2  FJ(ŽÌŽ§Ž²ŽÙ ŽºŽ³Ž¼ŽÝ ŽÃŽÞŽ°ŽÀ)   C Ž·Ž¬ŽÝŽ¾ŽÙ\n\
    3  TJ(ŽÃŽ°ŽÌŽÞŽÙ ŽºŽ³Ž¼ŽÝ ŽÃŽÞŽ°ŽÀ)\n\
    4  KJ(Ž¶ŽÝŽ¼ŽÞŽ®Ž³Ž¼Ž®Ž³ŽºŽÞŽ³ ŽÃŽÞŽ°ŽÀ)\n\
    5  SMPŽ´ŽØŽ±2\n"},
	{104,"\
F.N =                                 \
                                \n\
ID =   \n\
R.N =           \n\
00000000                                     \n\
                                              \n",12,
{{6,64,'c'},{76,2,'c'},{85,10,'d'},{96,8,'x'},{106,8,'x'},{115,8,'x'},
{124,8,'x'},{133,8,'x'},{152,8,'x'},{161,8,'x'},
{170,8,'x'},{179,8,'x'}}},
	{105,"\
ADDR = 00000000\n\
OLD = 00000000000000000000000000000000\
00000000000000000000000000000000\n\
NEW =                                 \
00000000000000000000000000000000\n\
JPAT: Ž¾Ž°ŽÌŽÞ(S) / Ž·Ž¬ŽÝŽ¾ŽÙ(C)\n",3,
{{7,8,'x'},{22,64,'x'},{93,64,'x'}}},
	{106,"ŽÃŽÞŽ°ŽÀ Ž¶ŽÞ Ž¼Ž­Ž³ŽØŽ®Ž³Ž¼ŽÏŽ¼ŽÀ !! \n"},
};
