/*****************************NTC-SMP-TOOL****************************/
/*                                                                   */
/*   1 ŽÌŽ§Ž²ŽÙŽÒŽ²                                                        */
/*      ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ² ŽÃŽ²Ž·ŽÞŽÌŽ§Ž²ŽÙ(mljstr.h)                                   */
/*                                                                   */
/*   2 Ž¸ŽÌŽÞŽÝ                                                          */
/*      Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÀŽÞŽÝŽÌŽß                                                 */
/*                                                                   */
/*   3 ŽØŽÚŽ·                                                           */
/*      Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽºŽÞŽÄŽ³ Ž¶Ž½ŽÞŽÄ                        			         */
/*      Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽµŽÊŽÞŽÀ ŽÄŽ¼Žº                          			     */
/*      ŽÍŽÝŽºŽ³ Ž¼Ž¬ :                                                    */
/*                                                                   */
/*********************************************************************/
/*  ŽÌŽ§Ž²ŽÙ Ž¾Ž²Ž·ŽÞŽ®ŽÃŽ°ŽÌŽÞŽÙ                                                  */
/*********************************************************************/
struct mljfctb{
	 char  *mljofnm;          /* Ž¼Ž­ŽÂŽØŽ®Ž¸ ŽÌŽ§Ž²ŽÙŽÒŽ² 						 */
	 long   mljofd;           /* Ž¼Ž­ŽÂŽØŽ®Ž¸ ŽÌŽ§Ž²ŽÙ Ž·Ž¼ŽÞŽ­ŽÂŽ¼ 				 */
	 char  *mljjfnm;          /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÌŽ§Ž²ŽÙŽÒŽ²                       */
	 long   mljjfd;           /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÌŽ§Ž²ŽÙ Ž·Ž¼ŽÞŽ­ŽÂŽ¼                  */
};
typedef  struct mljfctb  MLJFCTB;

/*********************************************************************/
/*  Ž¼Ž­ŽÂŽØŽ®Ž¸ ŽÓŽ°ŽÄŽÞŽÃŽ°ŽÌŽÞŽÙ(A or S or D)                                    */
/*********************************************************************/
struct  mljdpmt{
	 char   mljdmpm;          /* Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž¹Ž²ŽÀŽ² 						 */
	 char   mljdumy[3];       /* ŽÀŽÞŽÐŽ° 								 */
};
typedef  struct  mljdpmt  MLJDPMT;

/*********************************************************************/
/*  ŽËŽ½ŽÞŽ¹Ž¼ŽÞŽºŽ¸ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                               */
/*********************************************************************/
struct  mljhcct{
	 unsigned char   mljstrh[4];       /* Ž¶Ž²Ž¼ ŽËŽ½ŽÞŽ¹ 							 */
	 unsigned char   mljendh[4];       /* Ž¼Ž­Ž³ŽØŽ®Ž³ ŽËŽ½ŽÞŽ¹ 						 */
	 unsigned char   mljstrc[4];       /* Ž¶Ž²Ž¼ Ž¼ŽÞŽºŽ¸ 							 */
	 unsigned char   mljendc[4];       /* Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¼ŽÞŽºŽ¸ 						 */
	 long   mljscfg;          /* Ž¶Ž²Ž¼ Ž¼ŽÞŽºŽ¸ ŽÁŽªŽ¯Ž¸ ŽÌŽ×Ž¸ŽÞ                  */
};
typedef  struct  mljhcct  MLJHCCT;

/*********************************************************************/
/*  ŽÚŽºŽ°ŽÄŽÞŽÂŽ³ŽÊŽÞŽÝ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                             */
/*********************************************************************/
struct  mljrckt{
	 long   mljstrr;          /* Ž¶Ž²Ž¼ŽÚŽºŽ°ŽÄŽÞ ŽÂŽ³ŽÊŽÞŽÝ 					 */
	 long   mljendr;          /* Ž¼Ž­Ž³ŽØŽ®Ž³ŽÚŽºŽ°ŽÄŽÞ ŽÂŽ³ŽÊŽÞŽÝ 					 */
 };
typedef  struct  mljrckt  MLJRCKT;

/*********************************************************************/
/*  ŽÚŽºŽ°ŽÄŽÞŽ²ŽÝŽÃŽÞŽ¯Ž¸Ž½ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                           */
/*********************************************************************/
struct  mljrict{
	 short  mljpnum;          /* -P ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljknum;          /* -K ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljbnum;          /* -B ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljnnum;          /* -N ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljmnum;          /* -M ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljpron[3];       /* ŽÌŽßŽÛŽ¾Ž½ ŽÊŽÞŽÝŽºŽÞŽ³ 						 */
	 char   mljgcd[3][4];     /* Ž¸ŽÞŽÙŽ°ŽÌŽß ŽºŽ°ŽÄŽÞ 						 */
	 char   mljisgc[4][4];    /* ŽÆŽ­Ž³ŽØŽ®Ž¸ Ž»ŽÌŽÞŽ¸ŽÞŽÙŽ°ŽÌŽß ŽºŽ°ŽÄŽÞ 				 */
	 char   mljusgc[4][4];    /* ŽºŽ³Ž¼ŽÝ Ž»ŽÌŽÞŽ¸ŽÞŽÙŽ°ŽÌŽß ŽºŽ°ŽÄŽÞ 				 */
	 short   mljwsnm[4];       /* ŽÀŽÝŽÏŽÂ ŽÊŽÞŽÝŽºŽÞŽ³ 						 */
};
typedef  struct  mljrict  MLJRICT;

/*********************************************************************/
/*  ŽÃŽÞŽ°ŽÀŽÌŽÞ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct  mljdtct{
	 short  mljinum;          /* -I ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljtnum;          /* -T ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 short  mljfnum;          /* -F ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
	 char   mljdaid[3][2];    /* ŽÃŽÞŽ°ŽÀ ID 							 */
	 char   mljtbnm[3][4];    /* ŽÃŽ°ŽÌŽÞŽÙ ŽÒŽ² 							 */
	 char   mljflnm[3][16];   /* ŽÌŽ§Ž²ŽÙ ŽÒŽ² 							 */
};
typedef  struct  mljdtct  MLJDTCT;

/*********************************************************************/
/*  Ž±ŽÄŽÞŽÚŽ½ Ž¹ŽÝŽ»Ž¸ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÃŽ°ŽÌŽÞŽÙ                                           */
/*********************************************************************/
struct  mljadpt{
	 long   mljaddr;          /* Ž¿Ž³ŽÀŽ² Ž±ŽÄŽÞŽÚŽ½ 						 */
	 char   mljopr[2];        /* Ž´ŽÝŽ»ŽÞŽÝ Ž¼ 							 */
	 char   mljdmmy[2];       /* ŽÀŽÞŽÐŽ° 								 */
	 long   mljdlen;          /* Ž±ŽÀŽ² ŽÉ ŽÅŽ¶ŽÞŽ» 					 	 */
	 char   mljdata[32];      /* Ž±ŽÀŽ² 								 */
};
typedef   struct  mljadpt  MLJADPT;

/*********************************************************************/
/*  -XŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                               */
/*********************************************************************/
struct  mljxpct{
	 long   mljxnum;          /* -X ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
  MLJADPT   mljxtbl[3];       /* Ž±ŽÄŽÞŽÚŽ½Ž¹ŽÝŽ»Ž¸ ŽÊŽßŽ×ŽÒŽ°ŽÀŽÃ-ŽÌŽÞŽÙ 				 */
};
typedef  struct  mljxpct  MLJXPCT;

/*********************************************************************/
/*  -VŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                               */
/*********************************************************************/
struct  mljvpct{
	 long   mljvnum;          /* -V ŽµŽÍŽßŽ×ŽÝŽÄŽÞŽ½Ž³ 						 */
  MLJADPT   mljvtbl[3];       /* Ž±ŽÄŽÞŽÚŽ½Ž¹ŽÝŽ»Ž¸ ŽÊŽßŽ×ŽÒŽ°ŽÀŽÃ-ŽÌŽÞŽÙ 				 */
};
typedef  struct  mljvpct  MLJVPCT;

/*********************************************************************/
/*  ŽÚŽºŽ°ŽÄŽÞŽ¼Ž­Ž³ŽØŽ®Ž³ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ                                            */
/*********************************************************************/
struct  mljrect{
	 char    mljyyhh[8];      /* ŽËŽ½ŽÞŽ¹ Ž¼ŽÞŽºŽ¸ 							 */
};
typedef  struct  mljrect  MLJRECT;

/*********************************************************************/
/*  Ž´Ž×Ž°ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÃŽ°ŽÌŽÞŽÙ                                           */
/*********************************************************************/
struct  mljempr{
	 union{
		  short *mljcsht;	/* short ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ						 */
		  long  *mljclng;	/* long ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ						 */
		  char  *mljcchr;	/* char ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ						 */
	 } mljchpr;
	 long   mljcnln;		/* ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»						 */
};
struct  mljempt{
	 long   mljprnm;		/* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž½Ž³							 */
	 struct mljempr emprt[MLJPNOM];	/* ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÉ ŽÊŽ²ŽÚŽÂ			 	 */
};
typedef  struct  mljempt  MLJEMPT;

/*********************************************************************/
/*  Ž´Ž×Ž°ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÃŽ°ŽÌŽÞŽÙ                                                  */
/*********************************************************************/
struct  mljermg{
	 long   errno;            /* Ž´Ž×Ž°ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ NO 						 */
	 char   errmg[MLJMLN];    /* Ž´Ž×Ž°ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ 							 */
	 long   permn;            /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž½Ž³ 							 */
	 struct mlcftbl pardat[MLJPNOM];	/* ŽÍŽÝŽ¶ŽÝŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÉ ŽÊŽ²ŽÚŽÂ		 */
};
typedef  struct  mljermg  MLJERMG;

/*****************************NTC-SMP-TOOL****************************/
/*                                                                   */
/*   1 ŽÌŽ§Ž²ŽÙŽÒŽ²                                                        */
/*      ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ² ŽÃŽ²Ž·ŽÞŽÌŽ§Ž²ŽÙ(mljstr.h)                                   */
/*                                                                   */
/*   2 Ž¸ŽÌŽÞŽÝ                                                          */
/*      Ž¼ŽÞŽ¬Ž°ŽÅŽÙ ŽÊŽßŽ¯ŽÁ                                                  */
/*                                                                   */
/*   3 ŽØŽÚŽ·                                                           */
/*      Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽºŽÞŽÄŽ³ Ž¶Ž½ŽÞŽÄ                        			         */
/*      Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÆŽÚŽÝŽ·ŽÞ ŽÉŽÌŽÞŽËŽÛ                       			     */
/*      ŽÍŽÝŽºŽ³ Ž¼Ž¬ :                                                    */
/*                                                                   */
/*********************************************************************/
/*  ŽÌŽ§Ž²ŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³ŽÃŽ°ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct  mljfitb{
	 char   *mljifnm;         /* ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙŽÒŽ²   					 */
	 long   mljifd;           /* ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽ­ŽÂŽ¼	                 */
	 char   *mljofnm;         /* Ž¼Ž­ŽÂŽ¸ŽÌŽ§Ž²ŽÙŽÒŽ²   	     				 */
	 long   mljofd;           /* Ž¼Ž­ŽÂŽ¸ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽ­ŽÂŽ¼	                     */
	 char   *mljjfnm;         /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙŽÒŽ²   					 */
	 long   mljjfd;           /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽ­ŽÂŽ¼	                 */
};
typedef  struct  mljfitb  MLJFITB;

/*********************************************************************/
/*  ŽÚŽºŽ°ŽÄŽÞŽ¾Ž²Ž·ŽÞŽ® ŽÃŽ°ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct  mljrctb{
	 long   mljrlen;          /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÚŽºŽ°ŽÄŽÞŽÁŽ®Ž³                      */
	 char   *mljprbf;         /* ŽÊŽßŽ¯ŽÁŽÖŽ³ŽÚŽºŽ°ŽÄŽÞŽÊŽÞŽ¯ŽÌŽ§   				 */
	 char   *mljcrbf;         /* Ž·Ž¬ŽÝŽ¾ŽÙŽÖŽ³ŽÚŽºŽ°ŽÄŽÞŽÊŽÞŽ¯ŽÌŽ§	         		 */
	 long   mljrflg;          /* ŽÚŽºŽ°ŽÄŽÞŽ¼ŽÞŽÂŽºŽ³Ž¼ŽÝŽÌŽ×Ž¸ŽÞ	                 */
};
typedef  struct  mljrctb  MLJRCTB;

/*********************************************************************/
/*  ŽÃŽÞŽ°ŽÀŽ¹ŽÝŽ»Ž¸ Ž¼ŽÞŽ®Ž³ŽÎŽ³ŽÃŽ°ŽÌŽÞŽÙ                                             */
/*********************************************************************/
struct  mljdsit{
	 long   mljsrmd;          /* Ž¹ŽÝŽ»Ž¸ŽÓŽ°ŽÄŽÞ                            */
	 long   mljdlen;          /* ŽÃŽÞŽ°ŽÀŽÁŽ®Ž³                             */
	 char   *mljdadr;         /* ŽÊŽßŽ¯ŽÁŽÀŽ²Ž¼Ž®Ž³ŽÃŽÞŽ°ŽÀŽÚŽºŽ°ŽÄŽÞŽÅŽ² Ž¿Ž³ŽÀŽ²Ž±ŽÄŽÞŽÚŽ½      */
	 long   mljdflg;          /* ŽÃŽÞŽ°ŽÀŽ¼ŽÞŽÂŽºŽ³Ž¼ŽÝŽÌŽ×Ž¸ŽÞ 	                 */
};
typedef  struct  mljdsit  MLJDSIT;

/*********************************************************************/
/*  ŽÃŽÞŽ°ŽÀŽ²ŽÝŽÃŽÞŽ¯Ž¸Ž½ ŽËŽ®Ž³Ž¼ŽÞŽÖŽ³ ŽÃŽ°ŽÌŽÞŽÙ                                        */
/*********************************************************************/
struct  mljdidt{
	 char   mljddid[2];       /* ŽËŽ®Ž³Ž¼ŽÞŽ½ŽÙ ŽÃŽÞŽ°ŽÀID                      */
	 char   mljdumy[2];       /* ŽÀŽÞŽÐŽ°                                */
	 long   mljdrcn;          /* ŽËŽ®Ž³Ž¼ŽÞŽ½ŽÙ ŽÚŽºŽ°ŽÄŽÞŽÂŽ³ŽÊŽÞŽÝ                  */
};
typedef  struct  mljdidt  MLJDIDT;

/*********************************************************************/
/*  Ž¼ŽÞŽ®Ž³ŽÎŽ³ŽÌŽ×Ž¸ŽÞ ŽÃŽ°ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct  mljifft{
	 long   mljkmod;          /* Ž·ŽÄŽÞŽ³ ŽÓŽ°ŽÄŽÞ                           */
	 long   mljomod;          /* Ž¼Ž­ŽÂŽØŽ®Ž¸ ŽÓŽ°ŽÄŽÞ                         */
	 long   mljofif;          /* Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙ ŽÕŽ³ŽÑ                      */
	 long   mljjfc;           /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙ ŽºŽÈŽ¸ŽÄŽÌŽ×Ž¸ŽÞ                 */
	 long   mljjfo;           /* Ž¼ŽÞŽ¬Ž°ŽÅŽÙŽÌŽ§Ž²ŽÙ ŽµŽ°ŽÌŽßŽÝŽÌŽ×Ž¸ŽÞ                */
};
typedef  struct  mljifft  MLJIFFT;

/*********************************************************************/
/*  ŽÒŽ¯Ž¾Ž°Ž¼ŽÞŽÊŽßŽ×ŽÒŽÀ ŽÃŽ°ŽÌŽÞŽÙ                                                */
/*********************************************************************/
struct  mljmgpr{
	 union{                   /* ŽÊŽßŽ×ŽÒŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ                       */
		  short    *mljpsht;
		  long     *mljplng;
		  char     *mljpchr;
	  } mljperm;
	  long	    mljplen;	  /* ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»						 */
};
typedef  struct  mljmgpr  MLJMGPR;

struct  mljmsgt{
	 long   mljprnm;          /* ŽÊŽßŽ×ŽÒŽÀ ŽÉ Ž¶Ž½ŽÞ                         */
	 MLJMGPR   mljmsgp[MLJPNOM];
};
typedef  struct  mljmsgt  MLJMSGT;

/*********************************************************************/
/*   ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÃŽ°ŽÌŽÞŽÙ                                                   */
/*********************************************************************/
struct  mljmesg{
	 long   msgno;            /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ NO 	    					 */
	 char   messg[MLJMGL];    /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ 							 */
	 long   permn;            /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž½Ž³ 							 */
	 struct mlcftbl pardat[MLJPNOM];	/* ŽÍŽÝŽ¶ŽÝŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÉ ŽÊŽ²ŽÚŽÂ		 */
};
typedef  struct  mljmesg  MLJMESG;

/*********************************************************************/
/*  Ž·Ž®Ž³ŽÂŽ³ŽÃŽ°ŽÌŽÞŽÙ Ž±ŽÄŽÞŽÚŽ½ŽÃŽ°ŽÌŽÞŽÙ                                            */
/*********************************************************************/
struct  mljctat{
	 MLJFCTB   *mljfctbp;     /* ŽÌŽ§Ž²ŽÙ Ž¾Ž²Ž·ŽÞŽ®ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 			 */
	 MLJDPMT   *mljdpmtp;     /* Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÓŽ°ŽÄŽÞ ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 			 */
	 MLJHCCT   *mljhcctp;     /* ŽËŽ½ŽÞŽ¹Ž¼ŽÞŽºŽ¸ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 		 */
	 MLJRCKT   *mljrcktp;     /* ŽÚŽºŽ°ŽÄŽÞŽÂŽ³ŽÊŽÞŽÝ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 		 */
	 MLJRICT   *mljrictp;     /* ŽÚŽºŽ°ŽÄŽÞŽ²ŽÝŽÃŽÞŽ¯Ž¸Ž½ŽÌŽÞ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ   */
	 MLJDTCT   *mljdtctp;     /* ŽÃŽÞŽ°ŽÀŽÌŽÞ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 			 */
	 MLJXPCT   *mljxpctp;     /* -XŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 		 */
	 MLJVPCT   *mljvpctp;     /* -VŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 		 */
	 MLJRECT   *mljrectp;     /* ŽÚŽºŽ°ŽÄŽÞŽ¼Ž­Ž³ŽØŽ®Ž³ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 	 */
	 MLCKTBL   *mljktblp;     /* Ž·Ž°ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÁŽªŽ¯Ž¸ŽÃŽ°ŽÌŽÞŽÙ ŽÍŽÉ ŽÎŽßŽ²ŽÝŽÀ 		 */
	 MLJFITB   *mljfitbp;     /* ŽÌŽ§Ž²ŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÃŽ°ŽÌŽÞŽÙ                   */
	 MLJRCTB   *mljrctbp;     /* ŽÚŽºŽ°ŽÄŽÞŽ¾Ž²Ž·ŽÞŽ® ŽÃŽ°ŽÌŽÞŽÙ                    */
	 MLJDSIT   *mljdsitp;     /* ŽÃŽÞŽ°ŽÀŽ¹ŽÝŽ»Ž¸ Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÃŽ°ŽÌŽÞŽÙ               */
	 MLJDIDT   *mljdidtp;     /* ŽÃŽÞŽ°ŽÀŽ²ŽÝŽÃŽÞŽ¯Ž¸Ž½ŽÌŽÞ ŽËŽ®Ž³Ž¼ŽÞ ŽÃŽ°ŽÌŽÞŽÙ           */
	 MLJIFFT   *mljifftp;     /* Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÌŽ×Ž¸ŽÞ ŽÃŽ°ŽÌŽÞŽÙ                   */
};
typedef  struct  mljctat  MLJCTAT;
