/*****************************NTC-SMP-TOOL****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		Ž±ŽÎŽÞ-ŽÄ/ŽÀŽÞŽ³ŽÝ Žº-ŽÄŽÞ ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mlncode.h)						 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		NDTP														 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ							 				 */
/*		Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ							 				 */
/*		ŽÍŽÝŽºŽ³ Ž¼Ž¬ : 													 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	Ž¼Ž­Ž³ŽØŽ®Ž³ Žº-ŽÄŽÞ ŽÉ ŽÃŽ²Ž·ŽÞ												 */
/*********************************************************************/

#define	MLENMAN		0x3000
#define	MLENBFE		0x3001
#define	MLENCMD		0x3002
#define	MLENEMC		0x3003
#define	MLENERR		0x3004
#define	MLENFBF		0x3005
#define	MLENFPM		0x3006
#define	MLENFRD		0x3007
#define	MLENGGC		0x3008
#define	MLENKCK		0x3009
#define	MLENKMT		0x300A
#define	MLENMDD		0x300B
#define	MLENMSG		0x300C
#define	MLENMSK		0x300D
#define	MLENTMU		0x300E
#define	MLENVCH		0x300F
#define	MLENWRT		0x3010
#define	MLENWTO		0x3011
#define	MLENWTR		0x3012
#define	MLENFDM		0x3020
#define	MLENDSC		0x3021
#define	MLENFDP		0x3022
#define	MLENKWR		0x3023
#define	MLENDMP		0x3024
#define	MLENRAD		0x3030
#define	MLENRUD		0x3040
#define	MLENPSC		0x3041
#define	MLENFDT		0x3042
#define	MLENBTU		0x3043
#define	MLENFDR		0x3044
#define	MLENUDW		0x3045
#define	MLENTDM		0x3050
#define	MLENTDP		0x3051
#define	MLENTPM		0x3060
#define	MLENENQ		0x3063
#define	MLENDEQ		0x3064
#define	MLENSTU		0x3066

/*********************************************************************/
/*	Ž¼Ž®Ž³Ž»Ž² Žº-ŽÄŽÞ ŽÉ ŽÃŽ²Ž·ŽÞ												 */
/*********************************************************************/

/*********************************/
/*	ŽÛŽÝŽØ Ž´Ž×- (0x01-0x3F)			 */
/*********************************/

#define	MLDPGMERR 	0x01000000	/* ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ ŽÛŽÝŽØ Ž´Ž×Ž°  				 */
#define	MLDDATERR 	0x02000000	/* ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ ŽÅŽ² ŽÃŽÞ-ŽÀ ŽÛŽÝŽØ Ž´Ž×Ž° 			 */
#define	MLDTBLERR	0x10000000	/* ŽÃ-ŽÌŽÞŽÙ Ž´Ž×-						 */
#define	MLDFBUFERR	0x11000000	/* ŽÌŽß-ŽÙ ŽÊŽÞŽ¯ŽÌŽ§ Ž¶Ž²ŽÎŽ³ Ž´Ž×-				 */
#define	MLDOSDATERR	0x12000000	/* ŽÏŽ¼ŽÝ ŽËŽ½ŽÞŽ¹ Ž¼ŽÞŽºŽ¸ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-			 */
#define	MLDPARMERR	0x30000000	/* NDTP ŽÅŽ² ŽÊŽßŽ×ŽÒŽÀ Ž´Ž×-				 */
#define	MLDPARMXERR	0x31000000	/* NDTP ŽÅŽ² ŽÊŽßŽ×ŽÒŽÀ ŽÅŽ²ŽÖŽ³ Ž´Ž×-			 */

/*********************************/
/*	ŽÊŽßŽ×ŽÒŽÀ Ž´Ž×- (0x40-0x7F)		 */
/*********************************/

#define MLDCCDVERR	0x40000000	/* ŽºŽÏŽÝŽÄŽÞ Ž¶Ž²Ž¾Ž· Ž¼ŽÞ ŽÉ Ž´Ž×-				 */
#define MLDCPRTERR	0x41000000	/* ŽÌŽßŽÛŽÝŽÌŽßŽÄ ŽÒŽ¯Ž¾-Ž¼ŽÞ Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž´Ž×-		 */
#define MLDCPFMERR	0x42000000	/* Ž´Ž×- ŽÒŽ¯Ž¾-Ž¼ŽÞ ŽÍŽÝŽ¼Ž­Ž³ Ž´Ž×-				 */
#define MLDCKYCERR	0x43000000	/* Ž·- ŽÊŽßŽ×ŽÒŽÀ ŽÁŽªŽ¯Ž¸ Ž´Ž×-				 */
#define MLDCDWTERR	0x44000000	/* ŽÀŽÞŽÝŽÌŽß ŽÃŽÞ-ŽÀ Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž´Ž×-			 */
#define MLDCWTRERR	0x44000000	/* ŽÀŽÞŽÝŽÌŽß ŽÃŽÞ-ŽÀ Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž´Ž×-			 */

#define MLDHCCNERR	0x45000000	/* ŽÃŽÞ-ŽÀ ŽÍŽÝŽ¶ŽÝ Ž´Ž×-					 */
#define MLDBCCNERR	0x46000000	/* ŽÃŽÞ-ŽÀ ŽÍŽÝŽ¶ŽÝ Ž´Ž×-					 */

#define MLDRFGTERR	0x50000000	/* ŽÌŽ§Ž²ŽÙ ŽÉ Ž¼Ž¹ŽÞŽÝ ŽÊŽÞŽÝŽºŽÞŽ³ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-		 */
#define MLDFCONERR	0x51000000	/* ŽÌŽ§Ž²ŽÙ ŽÚŽÝŽ¹ŽÂ Ž´Ž×-					 */
#define MLDFDCNERR	0x52000000	/* ŽÌŽ§Ž²ŽÙ ŽÚŽÝŽ¹ŽÂ Ž¶Ž²Ž¼ŽÞŽ® Ž´Ž×-				 */
#define MLDFOPNERR	0x53000000	/* ŽÌŽ§Ž²ŽÙ Žµ-ŽÌŽßŽÝ Ž´Ž×-					 */
#define MLDFCLSERR	0x54000000	/* ŽÌŽ§Ž²ŽÙ Ž¸ŽÛ-Ž½ŽÞ Ž´Ž×-					 */
#define MLDFREDERR	0x55000000	/* ŽÌŽ§Ž²ŽÙ ŽÖŽÐŽºŽÐ Ž´Ž×-					 */
#define MLDFWRTERR	0x56000000	/* ŽÌŽ§Ž²ŽÙ Ž¶Ž·ŽºŽÐ Ž´Ž×-					 */
#define MLDFWTXERR	0x57000000	/* ŽÌŽ§Ž²ŽÙ ŽÖŽÐŽºŽÐ Ž´Ž×-					 */
#define MLDFUPDERR	0x58000000	/* ŽÌŽ§Ž²ŽÙ ŽºŽ³Ž¼ŽÝ Ž´Ž×-					 */
#define MLDFSRHERR	0x59000000	/* ŽÌŽ§Ž²ŽÙ Ž»-ŽÁ Ž´Ž×-						 */
#define MLDFGETERR	0x5A000000	/* Ž²Ž¯ŽÊŽßŽÝ ŽÌŽ§Ž²ŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-		 */
#define MLDWOPNERR	0x5B000000	/* ŽÜ-Ž¸ ŽÌŽ§Ž²ŽÙ Žµ-ŽÌŽßŽÝ Ž´Ž×-				 */
#define MLDWGETERR	0x5C000000	/* ŽÜ-Ž¸ ŽÌŽ§Ž²ŽÙ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-			 */

#define MLDRTGTERR	0x60000000	/* ŽÃ-ŽÌŽÞŽÙ ŽÉ Ž¼Ž¹ŽÞŽÝ ŽÊŽÞŽÝŽºŽÞŽ³ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-		 */
#define MLDTOPNERR	0x61000000	/* ŽÃ-ŽÌŽÞŽÙ Žµ-ŽÌŽßŽÝ Ž´Ž×-					 */
#define MLDTCLSERR	0x62000000	/* ŽÃ-ŽÌŽÞŽÙ Ž¸ŽÛ-Ž½ŽÞ Ž´Ž×-					 */
#define MLDTREDERR	0x63000000	/* ŽÃ-ŽÌŽÞŽÙ ŽÖŽÐŽºŽÐ Ž´Ž×-					 */
#define MLDTSRHERR	0x64000000	/* ŽÃ-ŽÌŽÞŽÙ Ž»-ŽÁ Ž´Ž×-					 */

#define MLDUWTOERR	0x70000000	/* ŽÃ-ŽÌŽÞŽÙ Ž»-ŽÁ Ž´Ž×-					 */

/*********************************/
/*	Ž¼Ž¶Ž¸ ŽÄŽÞŽ³Ž· Ž´Ž×- (0x80-0x9F)	 */
/*********************************/

#define	MLDENQERR	0x80000000	/* Ž¼Ž¹ŽÞŽÝ Ž¾ŽÝŽÕŽ³ Ž´Ž×-					 */
#define	MLDDEQERR	0x81000000	/* Ž¼Ž¹ŽÞŽÝ Ž¾ŽÝŽÕŽ³ Ž¶Ž²Ž¼ŽÞŽ® Ž´Ž×-				 */
#define	MLDTIMEOUT	0x90000000	/* ŽµŽ³ŽÄŽ³ ŽÀŽ²ŽÑ Ž±Ž³ŽÄ Ž´Ž×-					 */

/*********************************/
/*	ŽÊ-ŽÄŽÞ Ž´Ž×- (0xA0-0xCF)		 */
/*********************************/

#define	MLDWRTERR	0xA0000000	/* ŽÌŽ§Ž²ŽÙ Ž¶Ž·ŽºŽÐ Ž´Ž×-					 */

/*********************************/
/*	Ž¼Ž¹ŽÞŽÝ ŽÌŽÞŽ¿Ž¸ Ž´Ž×- (0xD0-0xDF)	 */
/*********************************/

#define	MLDGBUFERR	0xD0000000	/* ŽÌŽß-ŽÙ ŽÊŽÞŽ¯ŽÌŽ§ Ž¶Ž¸ŽÎ Ž´Ž×-				 */
#define	MLDFEOFERR	0xD1000000	/* ŽÌŽ§Ž²ŽÙ ŽÖŽ³ŽØŽ®Ž³ Ž¶ŽÞ ŽÀŽØŽÅŽ²				 */

/*********************************/
/*	Ž¿ŽÉŽÀ ŽÉ Ž´Ž×- (0xE0-0xFF)		 */
/*********************************/

