#include "mf.h"
#include "mlcdef.h"
#include "mlcstr.h"
/*********************************************************************/
/*   ŽÆŽÕŽ³Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                          */
/*********************************************************************/
struct mlnioif {
	long iofrm;                         /* ŽÆŽÕŽ³Ž¼ŽÕŽÂŽØŽÖŽ¸Ž¹Ž²Ž¼Ž·             */
	long indes;                         /* ŽÆŽÕŽ³ŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙŽ·Ž¼ŽÞŽÕŽÂŽ¼          */
	long outdes;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙŽ·Ž¼ŽÞŽÕŽÂŽ¼          */
	long filpos;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙŽÖŽÐŽºŽÐŽ²ŽÁ          */
};
typedef	struct mlnioif	MLNIOIF;
MLNIOIF ioift;
/*********************************************************************/
/*   ŽÃ-ŽÌŽÞŽÙŽ±Ž¸Ž¾Ž½ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                          */
/*********************************************************************/
struct mlntlif{
	long tblfrm;                        /* ŽÃ-ŽÌŽÞŽÙ Ž¹Ž²Ž¼Ž·                */
	long tlfdes;                        /* ŽÃ-ŽÌŽÞŽÙŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼          */
	long tdofrm;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¹Ž²Ž¼Ž·               */
	long tdofds;                        /* ŽÀŽÞŽÝŽÌŽßŽ¹Ž¯Ž¶Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼ */
	char *tbldsc;                       /* ŽÃ-ŽÌŽÞŽÙŽ¼Ž·ŽÍŽÞŽÂŽ¼ ŽÎŽßŽ²ŽÝŽÀ         */
	long ykentn;                        /* ŽÕŽ³ŽºŽ³ Ž´ŽÝŽÄŽØŽ½Ž³               */
	long kbtlen;                        /* 1ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»            */
	long sublen;                        /* Ž»ŽÌŽÞŽ·ŽÖŽ³ŽÂŽ³ŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»         */
	long intbno;                        /* ŽÃ-ŽÌŽÞŽÙ ŽÉ Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³        */
	long tdtcb;                         /* ŽÃ-ŽÌŽÞŽÙ Ž¶ŽÝŽØ ŽÌŽÞŽÛŽÂŽ¸ Ž±ŽÄŽÞŽÚŽ½     */
};
typedef	struct mlntlif	MLNTLIF;
/*********************************************************************/
/*  ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ± ŽÃ-ŽÌŽÞŽÙ                                                  */
/*********************************************************************/
struct mlnbfif{
	char *bufadr;                       /* ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ± Ž±ŽÄŽÞŽÚŽ½           */
	char *bfitmt;                       /* ŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ  */
};
struct mlnbuft
{
	long bufn;                          /* ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ±Ž½Ž³               */
	struct mlnbfif bufitm[MLNMXBF];
};
typedef	struct mlnbuft	MLNBUFT;
/*********************************************************************/
/*   ŽÃ-ŽÌŽÞŽÙŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ                                   */
/*********************************************************************/
struct mlntbit{
	long kbtno;                         /* ŽºŽ³Ž¼ŽÝŽºŽÍŽÞŽÂŽÅŽÝŽÊŽÞ-             */
};
typedef	struct mlntbit	MLNTBIT;
/*********************************************************************/
/*   ŽÌŽ±Ž²ŽÙŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ                                    */
/*********************************************************************/
struct mlnfbit {
	long recno;                         /* ŽºŽ³Ž¼ŽÝŽÚŽº-ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³          */
	long bfpos;                         /* Ž²ŽÁ                        */
	long bflen;                         /* ŽÅŽ¶ŽÞŽ»                      */
	short bfkeyn;                       /* ŽºŽ³Ž¼ŽÝŽÚŽº-ŽÄŽÞ ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ Ž½Ž³ */
	short bfdmy;
	MFCOND *itmkey[MLNMXKY];
};
typedef	struct mlnfbit	MLNFBIT;
/*********************************************************************/
/*  ŽÌŽ±Ž²ŽÙŽ±Ž¸Ž¾Ž½ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                            */
/*********************************************************************/
struct mlnflif {
	long fdofrm;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¹Ž²Ž¼Ž·               */
	long fdofds;                        /* ŽÀŽÞŽÝŽÌŽßŽÂŽ¶ Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼*/
	long inflno;                        /* ŽÆŽÕŽ³ŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³     */
	long filadr;                        /* ŽÌŽ±Ž²ŽÙŽ¶ŽÝŽØ ŽÌŽÞŽÛŽÂŽ¸Ž±ŽÄŽÞŽÚŽ½        */
	char *flfnam;                       /* ŽÌŽÙŽÊŽßŽ½ŽÌŽ±Ž²ŽÙŽÒŽ²               */
	char *filnam;                       /* ŽÌŽ±Ž²ŽÙŽÒŽ² ŽÎŽßŽ²ŽÝŽÀ              */
	char filtyp;                        /* ŽÌŽ±Ž²ŽÙ ŽÀŽ²ŽÌŽß                 */
	char fildmy[3];                     /* ŽÀŽÞŽÐ-                      */
	long filrdl;                        /* ŽÚŽº-ŽÄŽÞ ŽÁŽÖŽ³                 */
	long filkyn;                        /* Ž·- Ž½Ž³                     */
	long filbkl;                        /* ŽÌŽÞŽÛŽÂŽ¸ ŽÁŽÖŽ³                 */
	long kmtno;                         /* KMT Ž´ŽÝŽÄŽØ-ŽÅŽÝŽÊŽÞ-            */
	char *dmbfad;                       /* ŽÀŽÞŽÐ-ŽÊŽÞŽÂŽÌŽ± Ž±ŽÄŽÞŽÚŽ½           */
};
typedef	struct mlnflif	MLNFLIF;
/*********************************************************************/
/*   ŽÂŽ²Ž¶ŽÚŽº-ŽÄŽÞ Ž¾ŽÂŽÃŽ²ŽÁ ŽÃ-ŽÌŽÞŽÙ                                            */
/*********************************************************************/
struct mlnespr {
	long addpos;                        /* Ž²ŽÁ                        */
	char *addpri;                       /* Ž±ŽÀŽ²                       */
	long addlen;                        /* ŽÅŽ¶ŽÞŽ»                      */
};
struct mlnadpr {
	char clear;                         /* Ž¸ŽØŽ±ŽÁ                      */
	char dum[3];                        /* ŽÀŽÞŽÐ-                      */
	long eprin;                         /* Ž¾ŽÂŽÃŽ²ŽÁŽ½Ž³                   */
	struct mlnespr estpri[MLNMAPR];
};
typedef	struct mlnadpr	MLNADPR;
/*********************************************************************/
/*   ŽºŽ³Ž¼ŽÝŽÚŽº-ŽÄŽÞ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                          */
/*********************************************************************/
struct mlnuddt {
	long rectn1;                        /* ŽÚŽº-ŽÄŽÞ ŽÂŽ³ŽÊŽÞŽÝ1              */
	long rectn2;                        /* ŽÚŽº-ŽÄŽÞ ŽÂŽ³ŽÊŽÞŽÝ2              */
	long updpos;                        /* Ž²ŽÁ                        */
	long updlen;                        /* ŽÅŽ¶ŽÞŽ»                      */
};
typedef	struct mlnuddt	MLNUDDT;
/*********************************************************************/
/*   ŽÌŽ±Ž²ŽÙ ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ                                         */
/*********************************************************************/
struct mlnrkey {
	long recn1;                         /* ŽÚŽº-ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³1             */
	long recn2;                         /* ŽÚŽº-ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³2             */
	long fipos;                         /* Ž²ŽÁ                        */
	long filen;                         /* ŽÅŽ¶ŽÞŽ»                      */
	short fikeyn;                       /* Ž·- Ž½Ž³                     */
	short fidmy;
	long	reckln[MLNMXKY];
	MFCOND  reckey[MLNMXKY];
};
typedef	struct mlnrkey	MLNRKEY;
/*********************************************************************/
/*   ŽÏŽ½Ž¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct mlnmkdt {
	long recpos;                        /* Ž²ŽÁ                        */
	long recopr;                        /* Ž´ŽÝŽ»ŽÞŽÝŽ¼                    */
	char *recky;                        /* Ž·- ŽÁ                      */
	long keylen;                        /* Ž·- ŽÁ ŽÁŽÖŽ³                  */
};
struct mlnmsln {
	long mskitm;                        /* Ž²ŽÁŽ·ŽÞŽÖŽ³ ŽÉ ŽÏŽ½Ž¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝŽ½Ž³      */
	struct mlnmkdt maskdt[MLNMITN];
};
struct mlnmask {
	long msklnn;                        /* ŽÏŽ½Ž¸ Ž·ŽÞŽÖŽ³Ž½Ž³                */
	struct mlnmsln msklin[MLNMLNN];
};
typedef	struct mlnmask	MLNMASK;
/*********************************************************************/
/*   Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞŽÊŽßŽ×ŽÒ-ŽÀ ŽÃ-ŽÌŽÞŽÙ                                           */
/*********************************************************************/
struct mlnempr {
	union	{                           /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ            */
		short	*cngpms;
		long	*cngpml;
		char	*cngpmc;
	} cngprm;
	long cnglen;                        /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»             */
};
struct mlnempt {
	long cngn;                          /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ              */
	struct mlnempr parmdt[MLNMEP];
};
typedef	struct mlnempt	MLNEMPT;
/*********************************************************************/
/*   Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞ ŽÃ-ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct mlnermg {
	long errno;                         /* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞNO              */
	char errmg[MLNELN];                 /* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞ                */
	long permn;                         /* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³                 */
	struct mlcftbl pardat[MLNMEP];
};
typedef	struct mlnermg 	MLNERMG;
/*********************************************************************/
/*   NDTPŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÃŽ°ŽÌŽÞŽÙ                                         */
/*********************************************************************/
struct mlnmgpr {
	union	{                           /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ            */
		short	*msgpms;
		long	*msgpml;
		char	*msgpmc;
	} msgprm;
	long msglen;                        /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»             */
};
struct mlnmgpt {
	long msgn;                          /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ              */
	struct mlnmgpr prmdtb[MLNMMP];
};
typedef	struct mlnmgpt	MLNMGPT;
/*********************************************************************/
/*   NDTP allŽÒŽ¯Ž¾Ž°Ž¼ŽÞŽÃŽ°ŽÌŽÞŽÙ                                             */
/*********************************************************************/
struct mlnalmg {
	long msgno;                         /* NDTPŽÒŽÂŽ¾-Ž¼ŽÞNO              */
	char allmsg[MLNMLN];                /* NDTPŽÒŽÂŽ¾-Ž¼ŽÞ                */
	long prmn;                          /* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³                 */
	struct mlcftbl prmdat[MLNMMP];
};
typedef	struct mlnalmg 	MLNALMG;
