/*********************************************************************/
/*   NDTP ŽÉ ŽÐŽÀŽÞŽ¼ ŽÃŽÞ-ŽÀ (Ž¶ŽÅ ŽÓŽ¼ŽÞ)										 */
/*********************************************************************/

/********************************/
/*   ŽÌŽ§Ž²ŽÙ ŽÀŽÞŽÝŽÌŽß ŽÉ ŽÐŽÀŽÞŽ¼ ŽÃŽÞ-ŽÀ		*/
/********************************/
#define	KANAKEYM	"\n  * Ž·- *\n\n"
#define	KANADTM1	"\n  * ŽÚŽº-ŽÄŽÞ * NO =      \n\n"
#define	KANADTM2	"\n  * ŽÃŽÞ-ŽÀ * NO =      \n\n"
#define	KANADTM3	"\n  * ŽÃŽÞ-ŽÀ *\n\n"

/********************************/
/*   ŽÃ-ŽÌŽÞŽÙ ŽÀŽÞŽÝŽÌŽß ŽÉ ŽÐŽÀŽÞŽ¼ ŽÃŽÞ-ŽÀ	*/
/********************************/
#define	KANAMD1	"\n  * Ž·Ž®Ž³ŽÂŽ³ŽÌŽÞ *\n\n"
#define	KANAMD2	"\n  * ŽºŽÍŽÞŽÂŽÌŽÞ * No =      \n\n"
#define	KANAMD3	"\n  * VCT ŽÃŽÞ-ŽÀ *\n    ADDR =           ST1 =       ST2 =       KEY.L =       KEY.S =     \n"
#define	KANAMD4	"                                             ARA.L =       ARA.S =     \n"

/********************************/
/*   Ž·Ž®Ž³ŽÂŽ³ ŽÀŽÞŽÝŽÌŽß ŽÉ ŽÐŽÀŽÞŽ¼ ŽÃŽÞ-ŽÀ	*/
/********************************/
#define	KANATDMD1	"\n\n ** ŽÃ-ŽÌŽÞŽÙ ŽÀŽÞŽÝŽÌŽß Ž¼ŽÞŽ®Ž³Ž¹ŽÝ **\n"
#define	KANATDPDAT	"\n\n ** ŽÃ-ŽÌŽÞŽÙ ŽÀŽÞŽÝŽÌŽß ŽØŽ½ŽÄ **                           DATE   /  /    TIME   :  :   \n\n TABLE ID =      \n"
#define	KANAFDMD1	"\n\n ** ŽÌŽ§Ž²ŽÙ ŽÀŽÞŽÝŽÌŽß Ž¼ŽÞŽ®Ž³Ž¹ŽÝ  **\n"
#define	KANAFDPDAT	"\n\n ** ŽÌŽ§Ž²ŽÙ ŽÀŽÞŽÝŽÌŽß ŽØŽ½ŽÄ **                            DATE   /  /    TIME   :  :   \n\n FILE NAME =                 \n"

