#include "mlsstr.h"
#include "mlcdef.h"
#include "mlcstr.h"
/*********************************************************************/
/*   ŽÆŽÕŽ³Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                          */
/*********************************************************************/
struct mlnioif {
	long iofrm;                         /* ŽÆŽÕŽ³Ž¼ŽÕŽÂŽØŽÖŽ¸Ž¹Ž²Ž¼Ž·             */
	long indes;                         /* ŽÆŽÕŽ³ŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙŽ·Ž¼ŽÞŽÕŽÂŽ¼          */
	long outdes;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙŽ·Ž¼ŽÞŽÕŽÂŽ¼          */
	long filpos;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙŽÖŽÐŽºŽÐŽ²ŽÁ          */
};
typedef	struct mlnioif	MLNIOIF;
MLNIOIF ioift;
/*********************************************************************/
/*   ŽÃ-ŽÌŽÞŽÙŽ±Ž¸Ž¾Ž½ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                          */
/*********************************************************************/
struct mlntlif{
	long tblfrm;                        /* ŽÃ-ŽÌŽÞŽÙ Ž¹Ž²Ž¼Ž·                */
	long tlfdes;                        /* ŽÃ-ŽÌŽÞŽÙŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼          */
	long tdofrm;                        /* Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¹Ž²Ž¼Ž·               */
	long tdofds;                        /* ŽÀŽÞŽÝŽÌŽßŽ¹Ž¯Ž¶Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼ */
	char *tbldsc;                       /* ŽÃ-ŽÌŽÞŽÙŽ¼Ž·ŽÍŽÞŽÂŽ¼ ŽÎŽßŽ²ŽÝŽÀ         */
	long ykentn;                        /* ŽÕŽ³ŽºŽ³ Ž´ŽÝŽÄŽØŽ½Ž³               */
	long kbtlen;                        /* 1ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»            */
	long sublen;                        /* Ž»ŽÌŽÞŽ·ŽÖŽ³ŽÂŽ³ŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»         */
	long intbno;                        /* ŽÃ-ŽÌŽÞŽÙ ŽÉ Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³        */
	long tdtcb;                         /* ŽÃ-ŽÌŽÞŽÙ Ž¶ŽÝŽØ ŽÌŽÞŽÛŽÂŽ¸ Ž±ŽÄŽÞŽÚŽ½     */
};
typedef	struct mlntlif	MLNTLIF;
/*********************************************************************/
/*  ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ± ŽÃ-ŽÌŽÞŽÙ                                                  */
/*********************************************************************/
struct mlnbfif{
	char *bufadr;                       /* ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ± Ž±ŽÄŽÞŽÚŽ½           */
	char *bfitmt;                       /* ŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ  */
};
struct mlnbuft
{
	long bufn;                          /* ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ±Ž½Ž³               */
	struct mlnbfif bufitm[MLNMXBF];
};
typedef	struct mlnbuft	MLNBUFT;
/*********************************************************************/
/*   ŽÃ-ŽÌŽÞŽÙŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ                                   */
/*********************************************************************/
struct mlntbit{
	long kbtno;                         /* ŽºŽ³Ž¼ŽÝŽºŽÍŽÞŽÂŽÅŽÝŽÊŽÞ-             */
};
typedef	struct mlntbit	MLNTBIT;
/*********************************************************************/
/*   Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞŽÊŽßŽ×ŽÒ-ŽÀ ŽÃ-ŽÌŽÞŽÙ                                           */
/*********************************************************************/
struct mlnempr {
	union	{                           /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ            */
		short	*cngpms;
		long	*cngpml;
		char	*cngpmc;
	} cngprm;
	long cnglen;                        /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»             */
};
struct mlnempt {
	long cngn;                          /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ              */
	struct mlnempr parmdt[MLNMEP];
};
typedef	struct mlnempt	MLNEMPT;
/*********************************************************************/
/*   Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞ ŽÃ-ŽÌŽÞŽÙ                                                 */
/*********************************************************************/
struct mlnermg {
	long errno;                         /* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞNO              */
	char errmg[MLNELN];                 /* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞ                */
	long permn;                         /* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³                 */
	struct mlcftbl pardat[MLNMEP];
};
typedef	struct mlnermg 	MLNERMG;
/*********************************************************************/
/*   NDTPŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÃŽ°ŽÌŽÞŽÙ                                         */
/*********************************************************************/
struct mlnmgpr {
	union	{                           /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ            */
		short	*msgpms;
		long	*msgpml;
		char	*msgpmc;
	} msgprm;
	long msglen;                        /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»             */
};
struct mlnmgpt {
	long msgn;                          /* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ              */
	struct mlnmgpr prmdtb[MLNMMP];
};
typedef	struct mlnmgpt	MLNMGPT;
/*********************************************************************/
/*   NDTP allŽÒŽ¯Ž¾Ž°Ž¼ŽÞŽÃŽ°ŽÌŽÞŽÙ                                             */
/*********************************************************************/
struct mlnalmg {
	long msgno;                         /* NDTPŽÒŽÂŽ¾-Ž¼ŽÞNO              */
	char allmsg[MLNMLN];                /* NDTPŽÒŽÂŽ¾-Ž¼ŽÞ                */
	long prmn;                          /* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³                 */
	struct mlcftbl prmdat[MLNMMP];
};
typedef	struct mlnalmg 	MLNALMG;
