#include	"mf.h"
#include	"mlcdef.h"
#include	"mlcstr.h"
/*********************************************************************/
/*	ŽÆŽÕŽ³Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnioif {
	long	iofrm;						/* ŽÆŽÕŽ³Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¹Ž²Ž¼Ž·			 */
										/*	MLNWW : ŽÆŽ­Ž³Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÄŽÓ ŽÀŽÝŽÏŽÂ */
										/*	MLNFF : ŽÆŽ­Ž³Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÄŽÓ ŽÌŽ§Ž²ŽÙ */
										/*	MLNFW : ŽÆŽ­Ž³ŽØŽ®Ž¸ ŽÉŽÐ ŽÌŽ§Ž²ŽÙ	 */
	long	indes;						/* ŽÆŽÕŽ³ŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼		 */
	long	outdes;						/* Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼		 */
	long	filpos;						/* Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ ŽÖŽÐŽºŽÐŽ²ŽÁ		 */
};
typedef	struct mlnioif	MLNIOIF;
/*********************************************************************/
/*	ŽÃ-ŽÌŽÞŽÙŽ±Ž¸Ž¾Ž½ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlntlif {
	long	tblfrm;						/* Ž¼Ž®ŽØ ŽÀŽ²Ž¼Ž®Ž³ ŽÃ-ŽÌŽÞŽÙ Ž¼Ž­ŽÍŽÞŽÂ	 */
										/*	0 : ŽÒŽÓŽØ  ŽÃŽ°ŽÌŽÞŽÙ			 */
										/*	1 : ŽÌŽ§Ž²ŽÙ ŽÃŽ°ŽÌŽÞŽÙ			 */
	long	tlfdes;						/* ŽÃ-ŽÌŽÞŽÙŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼			 */
	long	tdofrm;						/* Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¹Ž²Ž¼Ž·				 */
										/*	MLNLP : LP ŽÎŽ³Ž¼Ž·			 */
										/*	MLNBS : ŽÊŽÞŽ²ŽÄŽ½ŽÄŽØŽ°ŽÑ ŽÎŽ³Ž¼Ž·	 */
	long	tdofds;						/* ŽÀŽÞŽÝŽÌŽßŽ¹Ž¯Ž¶Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼ */
	char	*tbldsc;					/* ŽÃ-ŽÌŽÞŽÙŽ¼Ž·ŽÍŽÞŽÂŽ¼ ŽÎŽßŽ²ŽÝŽÀ		 */
	long	ykentn;						/* ŽÕŽ³ŽºŽ³ Ž´ŽÝŽÄŽØŽ½Ž³				 */
	long	kbtlen;						/* 1 ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»			 */
	long	sublen;						/* Ž»ŽÌŽÞŽ·ŽÖŽ³ŽÂŽ³ŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»		 */
	long	intbno;						/* ŽÃ-ŽÌŽÞŽÙ ŽÉ Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³		 */
	long	tdtcb;						/* ŽÃ-ŽÌŽÞŽÙ Ž¶ŽÝŽØ ŽÌŽÞŽÛŽÂŽ¸ Ž±ŽÄŽÞŽÚŽ½	 */
};
typedef	struct mlntlif	MLNTLIF;
/*********************************************************************/
/*	ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ± ŽÃ-ŽÌŽÞŽÙ													 */
/*********************************************************************/
struct	mlnbfif {
	char	*bufadr;					/* ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ± Ž±ŽÄŽÞŽÚŽ½			 */
	char	*bfitmt;					/* ŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ	 */
};
typedef	struct mlnbfif	MLNBFIF;
struct	mlnbuft {
	long	bufn;						/* ŽºŽ³Ž¼ŽÝŽÊŽÞŽÂŽÌŽ±Ž½Ž³				 */
	MLNBFIF bufitm[MLNMXBF];
};
typedef	struct mlnbuft	MLNBUFT;
/*********************************************************************/
/*	ŽÃ-ŽÌŽÞŽÙŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ									 */
/*********************************************************************/
struct	mlntbit {
	long	kbtno;						 /* ŽºŽ³Ž¼ŽÝŽºŽÍŽÞŽÂŽÅŽÝŽÊŽÞ-			 */
};
typedef	struct mlntbit	MLNTBIT;
																  /*%*/
/*********************************************************************/
/*	ŽÌŽ±Ž²ŽÙŽÊŽÞŽÂŽÌŽ± ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ									 */
/*********************************************************************/
struct	mlnfbit {
	long	recno;						/* ŽºŽ³Ž¼ŽÝŽÚŽº-ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³			 */
	long	bfpos;						/* Ž²ŽÁ						 */
	long	bflen;						/* ŽÅŽ¶ŽÞŽ»						 */
	short	bfkeyn;						/* ŽºŽ³Ž¼ŽÝŽÚŽº-ŽÄŽÞ ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ Ž½Ž³ */
	short	bfdmy;						/* dummy					 */
	MFCOND	*itmkey;					/* Ž¹ŽÝŽ»Ž¸Ž¼ŽÞŽ®Ž³Ž¹ŽÝ Ž¶Ž¸ŽÉŽ³ Ž±ŽÄŽÞŽÚŽ½	 */
};
typedef	struct mlnfbit	MLNFBIT;
/*********************************************************************/
/*	ŽÌŽ±Ž²ŽÙŽ±Ž¸Ž¾Ž½ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnflif {
	long	fdofrm;						/* Ž¼ŽÕŽÂŽØŽÖŽ¸ Ž¹Ž²Ž¼Ž·				 */
										/*	MLNWW : ŽÆŽ­Ž³Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÄŽÓ ŽÀŽÝŽÏŽÂ */
										/*	MLNFF : ŽÆŽ­Ž³Ž¼Ž­ŽÂŽØŽ®Ž¸ŽÄŽÓ ŽÌŽ§Ž²ŽÙ */
										/*	MLNFW : ŽÆŽ­Ž³ŽØŽ®Ž¸ ŽÉŽÐ ŽÌŽ§Ž²ŽÙ	 */
	long	fdofds;						/* ŽÀŽÞŽÝŽÌŽßŽ¹Ž¯Ž¶ Ž¼ŽÕŽÂŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼*/
	long	inflno;						/* ŽÆŽÕŽ³ŽØŽÖŽ¸ŽÌŽ±Ž²ŽÙ Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³	 */
	long	filadr;						/* ŽÌŽ±Ž²ŽÙŽ¶ŽÝŽØ ŽÌŽÞŽÛŽÂŽ¸Ž±ŽÄŽÞŽÚŽ½		 */
	char	*flfnam;					/* ŽÌŽÙŽÊŽßŽ½ŽÌŽ±Ž²ŽÙŽÒŽ²				 */
	char	*filnam;					/* ŽÌŽ±Ž²ŽÙŽÒŽ² ŽÎŽßŽ²ŽÝŽÀ				 */
	char	filtyp;						/* ŽÌŽ±Ž²ŽÙ ŽÀŽ²ŽÌŽß				 */
	char	fildmy[3];					/* ŽÀŽÞŽÐ-						 */
	long	filrdl;						/* ŽÚŽº-ŽÄŽÞ ŽÁŽÖŽ³				 */
	long	filkyn;						/* Ž·- Ž½Ž³					 */
	long	filbkl;						/* ŽÌŽÞŽÛŽÂŽ¸ ŽÁŽÖŽ³				 */
	long	kmtno;						/* KMT Ž´ŽÝŽÄŽØ-ŽÅŽÝŽÊŽÞ-			 */
	char	*dmbfad;					/* ŽÀŽÞŽÐ-ŽÊŽÞŽÂŽÌŽ± Ž±ŽÄŽÞŽÚŽ½			 */
};
typedef	struct mlnflif	MLNFLIF;
/*********************************************************************/
/*	ŽÂŽ²Ž¶ŽÚŽº-ŽÄŽÞ Ž¾ŽÂŽÃŽ²ŽÁ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnespr {
	long	addpos;						/* Ž²ŽÁ						 */
	char	*addpri;					/* Ž±ŽÀŽ²						 */
	long	addlen;						/* ŽÅŽ¶ŽÞŽ»						 */
};
typedef	struct mlnespr	MLNESPR;

struct	mlnadpr {
	char	clear;						/* Ž¸ŽØŽ±ŽÁ						 */
	char	dum[3];						/* ŽÀŽÞŽÐ-						 */
	long	eprin;						/* Ž¾ŽÂŽÃŽ²ŽÁŽ½Ž³					 */
	MLNESPR estpri[MLNMAPR];
};
typedef	struct mlnadpr	MLNADPR;
/*********************************************************************/
/*	ŽºŽ³Ž¼ŽÝŽÚŽº-ŽÄŽÞ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnuddt {
	long	rectn1;						/* ŽÚŽº-ŽÄŽÞ ŽÂŽ³ŽÊŽÞŽÝ1				 */
	long	rectn2;						/* ŽÚŽº-ŽÄŽÞ ŽÂŽ³ŽÊŽÞŽÝ2				 */
	long	updpos;						/* Ž²ŽÁ						 */
	long	updlen;						/* ŽÅŽ¶ŽÞŽ»						 */
};
typedef	struct mlnuddt	MLNUDDT;
																  /*%*/
/*********************************************************************/
/*	ŽÌŽ±Ž²ŽÙ ŽÆŽÕŽ³ŽØŽÖŽ¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnrkey {
	long	recn1;						/* ŽÚŽº-ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³1			 */
	long	recn2;						/* ŽÚŽº-ŽÄŽÞ ŽÊŽÞŽÝŽºŽÞŽ³2			 */
	long	fipos;						/* Ž²ŽÁ						 */
	long	filen;						/* ŽÅŽ¶ŽÞŽ»						 */
	short	fikeyn;						/* Ž·- Ž½Ž³					 */
	short	fidmy;
	char	kvaltyp[MLNMXKY];			/* Ž¼ŽÃŽ²Ž·Ž° Ž¿ŽÞŽ¸Ž¾Ž²				 */
	long	reckln[MLNMXKY];
	MFCOND	reckey[MLNMXKY];			/* Ž¹ŽÝŽ»Ž¸Ž¼ŽÞŽ®Ž³Ž¹ŽÝ Ž¶Ž¸ŽÉŽ³ Ž²Ž·		 */
};
typedef	struct mlnrkey	MLNRKEY;
/*********************************************************************/
/*	ŽÏŽ½Ž¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝ ŽÃ-ŽÌŽÞŽÙ													 */
/*********************************************************************/
struct	mlnmkdt {
	long	recpos;						/* Ž²ŽÁ						 */
	long	recopr;						/* Ž´ŽÝŽ»ŽÞŽÝŽ¼					 */
	char	*recky;						/* Ž·- ŽÁ						 */
	long	keylen;						/* Ž·- ŽÁ ŽÁŽÖŽ³					 */
};
typedef	struct mlnmkdt	MLNMKDT;

struct mlnmsln {
	long	mskitm;						/* Ž²ŽÁŽ·ŽÞŽÖŽ³ ŽÉ ŽÏŽ½Ž¸Ž¼ŽÞŽÖŽ³Ž¹ŽÝŽ½Ž³		 */
	MLNMKDT maskdt[MLNMITN];
};
typedef	struct mlnmsln	MLNMSLN;

struct	mlnmask {
	long	msklnn;						/* ŽÏŽ½Ž¸ Ž·ŽÞŽÖŽ³Ž½Ž³				 */
	MLNMSLN msklin[MLNMLNN];
};
typedef	struct mlnmask	MLNMASK;
																  /*%*/
/*********************************************************************/
/*	Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞŽÊŽßŽ×ŽÒ-ŽÀ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnempr {
	union {								/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ			 */
		short	*cngpms;
		long	*cngpml;
		char	*cngpmc;
	} cngprm;
	long	cnglen;						/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»			 */
};
typedef	struct mlnempr	MLNEMPR;

struct	mlnempt {
	long	cngn;						/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ				 */
	MLNEMPR parmdt[MLNMEP];
};
typedef	struct mlnempt	MLNEMPT;
/*********************************************************************/
/*	Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞ ŽÃ-ŽÌŽÞŽÙ													 */
/*********************************************************************/
struct	mlnermg {
	long	errno;						/* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞNO				 */
	unsigned char	errmg[MLNELN];		/* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞ				 */
	long	permn;						/* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³				 */
	MLCFTBL pardat[MLNMEP];
};
typedef	struct mlnermg 	MLNERMG;
/*********************************************************************/
/*	NDTPŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÊŽßŽ×ŽÒŽ°ŽÀ ŽÃŽ°ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mlnmgpr {
	union {								/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ			 */
		short	*msgpms;
		long	*msgpml;
		char	*msgpmc;
	} msgprm;
	long	msglen;						/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»			 */
};
typedef	struct mlnmgpr	MLNMGPR;

struct	mlnmgpt {
	long	msgn;						/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ				 */
	MLNMGPR prmdtb[MLNMMP];
};
typedef	struct mlnmgpt	MLNMGPT;
/*********************************************************************/
/*	NDTP allŽÒŽ¯Ž¾Ž°Ž¼ŽÞŽÃŽ°ŽÌŽÞŽÙ												 */
/*********************************************************************/
struct	mlnalmg {
	long	msgno;						/* NDTPŽÒŽÂŽ¾-Ž¼ŽÞNO				 */
	char	allmsg[MLNMLN];				/* NDTPŽÒŽÂŽ¾-Ž¼ŽÞ				 */
	long	prmn;						/* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³				 */
	MLCFTBL prmdat[MLNMMP];
};
typedef	struct mlnalmg 	MLNALMG;
/*********************************************************************/
/*	ŽÃŽ°ŽÌŽÞŽÙŽÎŽÞŽØŽ­Ž°ŽÑ ŽÏŽ³ŽÝŽÄ Ž¶ŽÝŽØ ŽÃŽ°ŽÌŽÞŽÙ							TC2729		 */
/*********************************************************************/
struct	mlnmnt	{
	unsigned char status;				/* ŽÏŽ³ŽÝŽÄ Ž¼ŽÞŽ®Ž³ŽÀŽ²				 */
										/*	0x00 : ŽÐŽÏŽ³ŽÝŽÄ			 */
										/*  0x01 : ŽÏŽ³ŽÝŽÄ ŽÁŽ­Ž³			 */
										/*  0xFF : ŽÊŽ²ŽÚŽÂ ŽÉ Ž½ŽÄŽ¯ŽÊŽß		 */
	char	yobi[3];					/*   ŽØŽ»ŽÞŽ°ŽÌŽÞ					 */
	char	filname[32];				/* ŽÃŽ°ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ ŽÌŽÙŽÊŽßŽ½ŽÒŽ²		 */
	char	volname[32];				/* ŽÏŽ³ŽÝŽÄŽÓŽÄ ŽÌŽÞŽÛŽ¯Ž¸ŽÄŽ¸Ž¼Ž­ ŽÌŽ§Ž²ŽÙŽÒŽ²	 */
	char	dirname[32];				/* ŽÏŽ³ŽÝŽÄŽ»Ž· ŽÌŽÞŽÛŽ¯Ž¸ŽÄŽ¸Ž¼Ž­ ŽÌŽ§Ž²ŽÙŽÒŽ²	 */
};
typedef	struct mlnmnt MLNMNT;
																  /*%*/
/*********************************************************************/
/*	Ž¶Ž²ŽÌŽÞ ŽÍŽÝŽ½Ž³ Ž¾ŽÝŽ¹ŽÞŽÝ													 */
/*********************************************************************/
										/*S 88-07-07	TC1239		 */
extern	MLNIOIF	ioift;					/* ŽÆŽ­Ž³Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž¼ŽÞŽ®Ž³ŽÎŽ³   ŽÃŽ°ŽÌŽÞŽÙ	 */
extern	MLNRKEY	rkeyt;					/* ŽÌŽ§Ž²ŽÙ  ŽÆŽ­Ž³ŽØŽ®Ž¸Ž¼ŽÞŽ®Ž³Ž¹ŽÝ ŽÃŽ°ŽÌŽÞŽÙ	 */
extern	MLNFLIF	flift;					/* ŽÌŽ§Ž²ŽÙ  Ž±Ž¸Ž¾Ž½ Ž¼ŽÞŽ®Ž³ŽÎŽ³  ŽÃŽ°ŽÌŽÞŽÙ	 */
extern	MLNTLIF	tlift;					/* ŽÃŽ°ŽÌŽÞŽÙ Ž±Ž¸Ž¾Ž½ Ž¼ŽÞŽ®Ž³ŽÎŽ³  ŽÃŽ°ŽÌŽÞŽÙ	 */
extern	MLNBUFT	buft;					/* ŽºŽ³Ž¼ŽÝ ŽÊŽÞŽ¯ŽÌŽ§ ŽÃŽ°ŽÌŽÞŽÙ			 */
extern	MLNMGPT msgpra; 				/* ŽÒŽÂŽ¾-Ž¼ŽÞŽÊŽßŽ×ŽÒ-ŽÀŽÃ-ŽÌŽÞŽÙ		 */
extern	char	command[4096];			/* ŽºŽÏŽÝŽÄŽÞ ŽÖŽÐŽºŽÐ ŽÊŽÞŽ¯ŽÌŽ§			 */
extern	char	rndkey[2][32];			/* Ž×ŽÝŽÀŽÞŽÏŽ²Ž½ŽÞŽÌŽ§Ž²ŽÙ ŽÉ Ž·Ž°ŽÁ Ž¶Ž¸ŽÉŽ³Ž²Ž· */
extern	char	kknkey[16][128];		/* Ž·Ž°Ž¹ŽÝŽ»Ž¸ŽÌŽ§Ž²ŽÙ ŽÉ Ž·Ž°ŽÁ Ž¶Ž¸ŽÉŽ³Ž²Ž·	 */
extern	char	*mlfname[];				/* Ž´Ž×Ž° Ž¶ŽÝŽ½Ž³ŽÒŽ²				 */
extern	long	status;					/*FIP Ž¶ŽÝŽ½Ž³ ŽÊŽ¯ŽºŽ³ Ž½ŽÃŽ°ŽÀŽ½		 */
										/*	0 - ŽÐŽ¼Ž®ŽØ				 */
										/*	1 - ENQ ŽÁŽ­Ž³				 */
										/*	2 - ŽºŽÈŽ¸ŽÄ ŽÁŽ­Ž³			 */
										/*	3 - ŽµŽ°ŽÌŽßŽÝ ŽÁŽ­Ž³			 */
										/*E 88-07-07	TC1239		 */
