/**********************************************************************/
/*  ŽÄŽÞŽ×Ž²ŽÊŽÞ- Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                              */
/**********************************************************************/
struct mlsdrvt {
       char  inflg;         /*  ŽÆŽ­Ž³ŽØŽ®Ž¸Ž»Ž· ŽÌŽ×Ž¸ŽÞ  */
       char  outtfg;        /*  Ž¼Ž­ŽÂŽØŽ®Ž¸Ž»Ž· ŽÀŽÝŽÏŽÂŽÌŽ×Ž¸ŽÞ  */
       char  outffg;        /*  Ž¼Ž­ŽÂŽØŽ®Ž¸Ž»Ž· ŽÌŽ§Ž²ŽÙŽÌŽ×Ž¸ŽÞ  */
	   char  yobi1; 
       long  infd;          /*  ŽÆŽ­Ž³ŽØŽ®Ž¸Ž»Ž· ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼  */
       long  outfd;         /*  Ž¼Ž­ŽÂŽØŽÖŽ¸Ž»Ž· ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼  */
       char  prmpt;         /*  ŽÄŽ²Ž±ŽÜŽ¾ ŽÌŽ×Ž¸ŽÞ  */
	   char  yobi2[3];
       };
typedef struct mlsdrvt MLSDRVT;

/**********************************************************************/
/*  Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³ ŽÃ-ŽÌŽÞŽÙ                                                  */
/**********************************************************************/
struct mlsrnmt {
       long  rnum;          /*  Ž¼Ž¹ŽÞŽÝŽÊŽÞŽÝŽºŽÞŽ³  */
       char  *filname;      /*  ŽÌŽ§Ž²ŽÙŽÒŽ²  */
       };
typedef struct mlsrnmt MLSRNMT;

/**********************************************************************/
/*  ŽÌŽ§Ž²ŽÙ Ž¶ŽÝŽØŽÌŽÞŽÛŽÂŽ¸                                                     */
/**********************************************************************/
struct mffcb {
       int   fd;            /*  ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼  */
       long  rsize;         /*  ŽÚŽº-ŽÄŽÞŽÁŽ®Ž³  */
       long  actype;        /*  Ž±Ž¸Ž¾Ž½ŽÀŽ²ŽÌŽß  */
       };
typedef struct mffcb MFFCB;

/**********************************************************************/
/*  ŽÃ-ŽÌŽÞŽÙ Ž¶ŽÝŽØŽÌŽÞŽÛŽ¯Ž¸                                                    */
/**********************************************************************/
struct mftcb {
       int   fd;            /*  ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼  */
       long  ksize;         /*  ŽºŽÍŽÞŽÂŽÌŽÞŽÁŽ®Ž³  */
       long  ssize;         /*  Ž»ŽÌŽÞŽ·Ž®Ž³ŽÂŽ³ŽÌŽÞŽÁŽ®Ž³  */
       long  kcnt;          /*  ŽºŽÍŽÞŽÂŽÌŽÞŽ½Ž³       */
       };
typedef struct mftcb MFTCB;

/**********************************************************************/
/*  ŽÍŽÝŽ·Ž¬Ž¸ŽÁ ŽÃ-ŽÌŽÞŽÙ                                                      */
/**********************************************************************/
struct rettbl {
       char  *name;         /*  ŽÅŽÏŽ´  */
       long  vol;           /*  DEFINE ŽÁ  */
       };
typedef struct rettbl RETTBL;

/**********************************************************************/
/*  ŽËŽ·Ž½Ž³ ŽÍŽÝŽ·Ž¬Ž¸ ŽÖŽ³                                                     */
/**********************************************************************/
struct rchtbl {
       char  *cname;        /*  ŽÅŽÏŽ´  */
       char   defnm;        /*  DEFINE ŽÒŽ²  */
	   char   yobi1[3];
       };
typedef struct rchtbl RCHTBL;

/**********************************************************************/
/*  DCP ŽÖŽ³ŽÌŽ§Ž²ŽÙ Ž¾Ž²Ž·ŽÞŽÖŽÃŽ°ŽÌŽÞŽÙ                                             */
/**********************************************************************/
struct mlsdid {
       int   rfd;           /*  ŽÛŽÝŽØŽÀŽÝŽÏŽÂ ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼ */
       char  *rfp;          /*  ŽÆŽ­Ž³ŽØŽ®Ž¸ŽÊŽÞŽ¯ŽÌŽ§ ŽÎŽßŽ²ŽÝŽÀ */
       long  rfl;           /*  ŽÊŽÞŽ¯ŽÌŽ§ ŽÁŽ®Ž³ */
       int   mfd;           /*  ŽÒŽ¯Ž¾Ž°Ž¼ŽÞŽ²ŽÝŽÃŽÞŽ¯Ž¸Ž½Ž´ŽØŽ± ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼ */
       int   ifd;           /*  Ž²ŽÍŽÞŽÝŽÄŽÌŽ§Ž²ŽÙ Ž·Ž¼ŽÞŽÂŽ¼ */
       };
typedef struct mlsdid MLSDID;
/**********************************************************************/
/*  RCV ŽÖŽ³ ŽÃŽ°ŽÌŽÞŽÙ        	                                      */
/**********************************************************************/
struct mlskid {
       int   kid;           /*  ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼ */
       long  klen;          /*            */
       int   hid;           /*            */
       long  hlen;          /*            */
       };
typedef struct mlskid MLSKID;
