/*--------------------------------------------------------------------------*/
/*																			*/
/*		include	ŽÌŽ§Ž²ŽÙ	<< mm_dyrc5.h (DLL)	>>								*/
/*																			*/
/*--------------------------------------------------------------------------*/
typedef	struct
{
	TCOMPAT				*pefxcom;		/* TEFXŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÝŽÄŽ³ ŽÎŽßŽ²ŽÝŽÀ				*/
	TEFXPSZ				*pefxpsz;		/* TEFXŽºŽÍŽÞŽÂŽÌŽÞŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÝŽÄŽ³	ŽÎŽßŽ²ŽÝŽÀ		*/
	TCOMPAT				*ptlicom;		/* TTLIŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÝŽÄŽ³ ŽÎŽßŽ²ŽÝŽÀ				*/
	TTLIPSZ				*ptlipsz;		/* TTLIŽºŽÍŽÞŽÂŽÌŽÞŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÝŽÄŽ³	ŽÎŽßŽ²ŽÝŽÀ		*/
	TCOMPAT				*ptsicom;		/* TTSIŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÝŽÄŽ³ ŽÎŽßŽ²ŽÝŽÀ				*/
	TTSIPSZ				*ptsipsz;		/* TTSIŽºŽÍŽÞŽÂŽÌŽÞŽÃŽ°ŽÌŽÞŽÙ Ž¾ŽÝŽÄŽ³	ŽÎŽßŽ²ŽÝŽÀ		*/
}						DLLSMP;
