/**********************************************************************/
/*   ncp - ŽÕŽ°Ž»ŽÞ Ž²ŽÝŽÀŽÌŽ´Ž°Ž½ ŽØŽÖŽ³Ž²Ž· Ž¶ŽÀŽÃŽ²Ž·ŽÞ                                  */
/**********************************************************************/
struct ncpusri {
  long intcod ;                        /* Ž²ŽÝŽÀŽÌŽªŽ°Ž½ŽºŽ°ŽÄŽÞ                 */
  char yobi ;                          /* ŽÖŽËŽÞ                         */
  char rspcode1 ;                      /* ŽÕŽ°Ž»ŽÞŽÂŽ³ŽÁŽºŽ°ŽÄŽÞ1                */
  char rspcode2[2] ;                   /* ŽÕŽ°Ž»ŽÞŽÂŽ³ŽÁŽºŽ°ŽÄŽÞ2                */
  unsigned short nodenomb ;            /* ŽÉŽ°ŽÄŽÞŽÊŽÞŽÝŽºŽÞŽ³                  */
  char kidcode1[2] ;                   /* Ž¹Ž²Ž¶ŽÝ Ž¼Ž·ŽÍŽÞŽÂŽºŽ°ŽÄŽÞ1             */
  short kidcode2 ;                     /* Ž¹Ž²Ž¶ŽÝ Ž¼Ž·ŽÍŽÞŽÂŽºŽ°ŽÄŽÞ2             */
 short linenomb ;                      /* Ž¶Ž²Ž¾ŽÝŽÊŽÞŽÝŽºŽÞŽ³ (pu-no & ch-no)  */
} ;
typedef struct ncpusri NCPUSRI ;
