/****************************************************************************/
/*	コマンド実行共通ＤＥＦＩＮＥ											*/
/****************************************************************************/

/****************************************************************************/
/*	コマンド解析・コマンド実行返却値ＤＥＦＩＮＥ							*/
/****************************************************************************/
#define	MOCMDNML	0L					/* 正常終了							*/
#define	MOSNDSBM	1L					/* 正常終了（サブＭＳへ処理依頼）	*/
#define	MOCMDERR	-1L					/* 異常終了							*/
#define	MOMOHERR	-2L					/* 異常終了(mohｸﾘｴｰﾄｴﾗｰ） CT0597	*/

/****************************************************************************/
/*	コマンド文字列組立処理マクロ定義										*/
/****************************************************************************/

/*	送信電文領域の分解された文字列を組立直す								*/
/*	ＮＵＬＬ文字をスペースに置き換え。但し、最後の文字列のＮＵＬＬは残す	*/
/*		CNT = 分解された文字列数											*/
/*		STR = 分解された文字列の格納領域（ＮＵＬＬで区切られた連続域）		*/

#define	MORMKCMD( CNT, STR)	{\
		register	int	i,j;			/* ワークカウンタ					*/\
		j = 0;\
		for	( i = 0 ; i < CNT - 1 ; i++ )\
		{\
			for ( ; '\0' != *(STR + j); j++);\
			while ( '\0' == *(STR + j) )\
			{\
				*(STR + j) = ' ';\
				j++;\
			}\
		}\
	}
