/*********************************************************************/
/*   ŽºŽÏŽÝŽÄŽÞŽ²ŽÝŽÀŽÌŽßŽØŽÀ Ž¼ŽÞŽÂŽºŽ³ ŽÖŽ³ Ž²ŽÝŽ¸ŽÙ-ŽÄŽÞ ŽÌŽ±Ž²ŽÙ                              */
/*********************************************************************/


#define  REQUEST    0x00000001L         /* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼              */
#define  EVENT      0x00000001L         /* Ž²ŽÍŽÞŽÝŽÄ ŽÊŽÞŽÝŽºŽÞŽ³              */



extern struct tgon ptrarea[50];         /* ŽÜŽØŽºŽÐ ŽÃ-ŽÌŽÞŽÙ                */
extern UCHR reqidflg[31];               /* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ ŽÃ-ŽÌŽÞŽÙ        */
extern UCHR evenflg[31];                /* Ž²ŽÍŽÞŽÝŽÄ ŽÊŽÞŽÝŽºŽÞŽ³ Ž¼ŽÖŽ³ ŽÌŽ×Ž¸ŽÞ     */
extern UCHR msgflg[3];                  /* ŽÒŽÂŽ¾-Ž¼ŽÞ ŽÌŽ×Ž¸ŽÞ               */
extern UCHR deverr;                     /* ŽÜŽØŽºŽÐ Ž²Ž¼ŽÞŽÖŽ³ ŽÌŽ×Ž¸ŽÞ           */
extern UCHR mrhmsg;                     /* mrh MSG Ž¼ŽÞŽ­Ž¼ŽÝ ŽÌŽ×Ž¸ŽÞ		 */
extern UCHR message[sizeof(struct momhead)+sizeof(MOCMDMSG)];
										/* ŽÒŽÂŽ¾-Ž¼ŽÞ Ž¼ŽÞŽÕŽ¼ŽÝ ŽØŽÖŽ³Ž²Ž·        */
extern int onno;                        /* Ž¹ŽÞŽÝ ON ŽÌŽÞŽÝ ŽÊŽÞŽÝŽºŽÞŽ³         */
extern long *rcdpoi;                    /* rcode Ž¾ŽÂŽÃŽ² Ž²Ž· ŽÎŽßŽ²ŽÝŽÀ       */
extern long srttblno;                   /* SRT ŽÃ-ŽÌŽÞŽÙ Ž¼Ž¹ŽÞŽÝ ŽÊŽÞŽÝŽºŽÞŽ³     */
