/*********************************************************************/
/*   ŽºŽÏŽÝŽÄŽÞŽ²ŽÝŽÀŽÌŽßŽØŽÀ Ž·ŽÖŽ³ŽÂŽ³ Ž²ŽÝŽ¸ŽÙ-ŽÄŽÞ ŽÌŽ±Ž²ŽÙ                                 */
/*********************************************************************/

#include "moitma.h"

/*********************************************************************/
/*  ŽºŽÏŽÝŽÄŽÞŽ²ŽÝŽÀŽÌŽßŽØŽÀ Ž·ŽÖŽ³ŽÂŽ³ Ž¶ŽÞŽ²ŽÌŽÞ ŽØŽÖŽ³Ž²Ž·                                   */
/*********************************************************************/
extern UCHR           *cirdbfp;         /* ŽÖŽÐŽºŽÐ ŽÊŽÞŽÂŽÌŽ± ŽÎŽßŽ²ŽÝŽÀ          */
extern UCHR           *cibufp[5];       /* ŽÊŽÞŽÂŽÌŽ± ŽÎŽßŽ²ŽÝŽÀ               */
extern struct devtbl  *cidevp;          /* ŽÜŽØŽºŽÐ ŽÃ-ŽÌŽÞŽÙ Ž±ŽÄŽÞŽÚŽ½          */
extern long           cicdlen;          /* ŽÅŽ²ŽÌŽÞŽº-ŽÄŽÞŽÊŽÞŽÂŽÌŽ± ŽÉ ŽÉŽºŽØŽÊŽÞŽ²ŽÄŽ½Ž³ */
extern struct chgtbl  *chgp[2];         /* ŽÅŽ²ŽÌŽÞŽº-ŽÄŽÞ ŽÎŽßŽ²ŽÝŽÀ            */
extern int            charc;            /* ŽÓŽ¼ŽÞŽÊŽÞŽÂŽÌŽ± Ž¶Ž³ŽÝŽÀ             */
extern long          *ciphasep;         /* SRT ŽÌŽ´Ž²Ž½ŽÞ ŽÎŽßŽ²ŽÝŽÀ           */
extern long          *ciwtphas;         /* ŽÍŽÝŽ½Ž³ŽÒŽ² ŽÃ-ŽÌŽÞŽÙ ŽÌŽ´Ž²Ž½ŽÞ ŽÎŽßŽ²ŽÝŽÀ  */
extern long           wtblno;           /* ŽÍŽÝŽ½Ž³ŽÒŽ² ŽÃ-ŽÌŽÞŽÙ Ž´ŽÝŽÄŽØ ŽºŽ½Ž³     */
extern int            lvlno;            /* Ž×ŽÍŽÞŽÙŽÃ-ŽÌŽÞŽÙ Ž´ŽÝŽÄŽØ ŽºŽ½Ž³        */
extern UCHR           *cmdp;            /* ŽºŽÏŽÝŽÄŽÞ Ž¹ŽÞŽÝ ŽÎŽßŽ²ŽÝŽÀ           */
extern UCHR           lavelflg;         /* Ž×ŽÍŽÞŽÙ ŽÌŽ×Ž¸ŽÞ                 */
extern int            linecnt;          /* Ž·ŽÞŽÖŽ³ Ž½Ž³ Ž¶Ž³ŽÝŽÀ              */
extern union {                          /* ŽÎŽßŽ²ŽÝŽÀ ŽÍŽÝŽ¶ŽÝ ŽÜ-Ž¸Ž´ŽØŽ±         */
	UCHR  *cpoi;
	long  *lpoi;
} cbpoi;
extern long           rtnos;            /* Ž¼Ž½ŽÃŽÑŽº-ŽÙ ŽÍŽÝŽ·ŽÔŽ¸ŽÁ Ž²Ž·         */
extern long           jnlflg;           /* Ž¼ŽÞŽÔ-ŽÅŽÙ ŽÖŽ³/ŽÌŽÖŽ³ ŽÌŽ×Ž¸ŽÞ        */
