/*********************************************************************/
/*   ŽºŽÏŽÝŽÄŽÞŽ²ŽÝŽÀŽÌŽßŽØŽÀ ŽÌŽ±Ž²ŽÙ Ž±Ž¸Ž¾Ž½ ŽÖŽ³ Ž²ŽÝŽ¸ŽÙ-ŽÄŽÞ ŽÌŽ±Ž²ŽÙ                          */
/*********************************************************************/
extern UCHR   *nextcmdp;                /* ŽºŽÏŽÝŽÄŽÞ ŽÂŽ·ŽÞ ŽÎŽßŽ²ŽÝŽÀ           */
extern long   byteno;                   /* ŽÖŽÐŽºŽÐ ŽÊŽÞŽ²ŽÄ Ž½Ž³              */
extern long   bufctr;                   /* ŽÊŽÞŽÂŽÌŽ± Ž¶Ž³ŽÝŽÀ                */
extern long   fd;                       /* ŽÌŽ±Ž²ŽÙ Ž·Ž¼ŽÞŽÕŽÂŽ¼               */
