/*********************************************************************/
/*   ŽºŽÏŽÝŽÄŽÞŽ²ŽÝŽÀŽÌŽßŽØŽÀ Ž·ŽÖŽ³ŽÂŽ³ Ž²ŽÝŽ¸ŽÙ-ŽÄŽÞ ŽÌŽ±Ž²ŽÙ                                 */
/*********************************************************************/

#include "mcdebug.h"
#include "mochar.h"
#include "mcmia.h"
#include "momhead.h"
#include "tcom.h"
#include "psect.h"
extern  PSCPSECT  pscparea;

#ifndef NORMAL
#define NORMAL  0L
#endif

#define DOWNID  0x00001200L				/* Ž²ŽÝŽÀŽÌŽßŽØŽÀ ŽÖŽ³ ŽÀŽÞŽ³ŽÝŽº-ŽÄŽÞ Ž¼Ž·ŽÍŽÞŽÂŽ¼*/
/*********************************************************************/
/*   mo_incs (ŽÌŽÞŽ×ŽÝŽ¸ ŽÖŽÐŽÄŽÊŽÞŽ¼) ŽÉ ŽÍŽÝŽ·ŽÔŽ¸ŽÁ ŽÉ ŽÃŽ²Ž·ŽÞ                          */
/*********************************************************************/
#define ALFNMLIC   0                    /* Ž´Ž² Ž½Ž³Ž¼ŽÞ                   */
#define EQUAL      1                    /* '='                       */
#define ASTERISK   2                    /* '*'                       */
#define SLASH      3                    /* '/'                       */
#define MINUS      4                    /* '-'                       */
#define PLUS       5                    /* '+'                       */
#define MINOR      6                    /* '<'                       */
#define MAJOR      7                    /* '>'                       */
#define ADMARK     8                    /* '@'                       */
#define COLON      9                    /* ':' (Ž´Ž²Ž½Ž³Ž¼ŽÞ ŽÖŽÐŽÄŽÊŽÞŽ¼ ŽÃŽÞ Ž¼ŽÖŽ³)*/
#define EXCLAMAT  10                    /* '!'                       */
#define SGLQUOT   11                    /* '\''                      */
#define NEWLINE   -1                    /* '\n'(Ž´Ž²Ž½Ž³Ž¼ŽÞ ŽÖŽÐŽÄŽÊŽÞŽ¼ ŽÃŽÞ Ž¼ŽÖŽ³)*/
#define OTHERS    -2                    /* Ž¿ŽÉŽÀ ŽÉ ŽÄŽ¸Ž¼ŽÕ ŽÓŽ¼ŽÞ            */
#define ILLGCODE  -3                    /* ŽÌŽ¾Ž² ŽÓŽ¼ŽÞ (0x80 ŽÖŽØ ŽÀŽÞŽ²)     */

/*********************************************************************/
/*   mo_inbs(Ž´Ž²Ž½Ž³Ž¼ŽÞ ŽÖŽÐŽÄŽÊŽÞŽ¼) ŽÉ ŽÍŽÝŽ·ŽÔŽ¸ŽÁ ŽÉ ŽÃŽ²Ž·ŽÞ                          */
/*********************************************************************/
#define BLANK      0                    /* ' '                       */
#define ALLOTHER  -4                    /* ŽÌŽÞŽ×ŽÝŽ¸/ŽºŽÛŽÝ/ŽÆŽÕ-Ž×Ž²ŽÝ Ž²Ž¶ŽÞŽ²     */

/*********************************************************************/
/*   ŽÌŽ´Ž²Ž½ŽÞ Ž¼ŽÞŽÖŽ³ŽÎŽ³                                                    */
/*********************************************************************/
#define NOTPHASE  1                     /* ŽÌŽ´Ž²Ž½ŽÞ ŽÅŽ¼                  */
#define LFTPHASE  2                     /* Ž»ŽÍŽÝ ŽÆ ŽÌŽ´Ž²Ž½ŽÞ Ž±ŽØ            */
#define RITPHASE  3                     /* Ž³ŽÍŽÝ ŽÆ ŽÌŽ´Ž²Ž½ŽÞ Ž±ŽØ            */

/*********************************************************************/
/*  ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                                          */
/*********************************************************************/
struct chgtbl {                         /* ŽÅŽ²ŽÌŽÞŽº-ŽÄŽÞ ŽÍŽÝŽ¶ŽÝ ŽÃ-ŽÌŽÞŽÙ       */
	UCHR           incode;              /* ŽÅŽ²ŽÌŽÞŽº-ŽÄŽÞ                  */
	UCHR           rcv1;                /*        ŽØŽ»ŽÞ-ŽÌŽÞ             */
	short          pszleng;             /* ŽºŽÕŽ³ŽÌŽÞ ŽÉ ŽÅŽ¶ŽÞŽ»              */
	struct chgtbl  *nextp;              /* NEXT ŽÎŽßŽ²ŽÝŽÀ                */
	struct chgtbl  *falsp;              /* FALSE ŽÎŽßŽ²ŽÝŽÀ               */
};

struct lavel {                          /* Ž×ŽÍŽÞŽÙ ŽÃ-ŽÌŽÞŽÙ                */
	UCHR           lvlname[8];          /* Ž×ŽÍŽÞŽÙ ŽÒŽ²                   */
	struct chgtbl  *spadd;              /* ŽÃŽÝŽ¶Ž²Ž¼ŽÞ Ž±ŽÄŽÞŽÚŽ½              */
};

struct wtbl {                           /* ŽÍŽÝŽ½Ž³ŽÒŽ² ŽÃ-ŽÌŽÞŽÙ              */
	UCHR      wname[8];                 /* ŽÍŽÝŽ½Ž³ŽÒŽ²                    */
	union {
		long  number;                   /* Ž¾Ž²Ž½Ž³ŽÁ                     */
		UCHR  *charadd;                 /* ŽÓŽ¼ŽÞŽÍŽÝŽ½Ž³ ŽÎŽßŽ²ŽÝŽÀ             */
		long  *phasep;                  /* PHASE ŽÎŽßŽ²ŽÝŽÀ               */
	} quant;                            /* ŽÍŽÝŽ½Ž³                      */
};

struct devtbl {                         /* ŽÜŽØŽºŽÐ ŽÃ-ŽÌŽÞŽÙ                */
	UCHR  useflg;                       /* Ž¼ŽÖŽ³ ŽÌŽ×Ž¸ŽÞ                  */
	UCHR  rsv2;                         /*        ŽØŽ»ŽÞ-ŽÌŽÞ             */
	UCHR  msgshu;                       /* ŽÒŽÂŽ¾-Ž¼ŽÞ Ž¼ŽÕŽÍŽÞŽÂ              */
	UCHR  evno;                         /* Ž²ŽÍŽÞŽÝŽÄ NO.                 */
	UCHR  pronam[8];                    /* ŽÌŽßŽÛŽ¾Ž½ ŽÒŽ²                  */
	long  devrcd;                       /* ŽØŽÀ-ŽÝ Žº-ŽÄŽÞ Ž´ŽØŽ±             */
};

struct tgon {
	struct chgtbl  *ptrtbl;             /* ON ŽÌŽÞŽÝ ŽÎŽßŽ²ŽÝŽÀ              */
	short           okbit;              /* Ž¼ŽÞŽÂŽºŽ³ Ž¶ŽÉŽ³ ŽËŽÞŽÂŽÄ            */
	UCHR            eventno;            /* ON ŽÌŽÞŽÝ Ž²ŽÍŽÞŽÝŽÄ ŽÊŽÞŽÝŽºŽÞŽ³       */
	UCHR            priority;           /* ŽÌŽßŽ×Ž²ŽµŽØŽÃŽ²                  */
	UCHR            exno;               /* Ž¼ŽÞŽÂŽºŽ³ Ž¶Ž²Ž½Ž³                */
	UCHR            tgonrsv[3];         /*       ŽØŽ»ŽÞ-ŽÌŽÞ              */
	long            tgonrcd;            /* ŽØŽÀ-ŽÝ Žº-ŽÄŽÞ Ž´ŽØŽ±             */
} ;

/*********************************************************************/
/*   LET ŽÌŽÞŽÝ ŽºŽÕŽ³ŽÌŽÞ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                           */
/*********************************************************************/
struct tglet {
	 UCHR   letopkd;                    /* ŽµŽÍŽßŽÚ-Ž¼ŽÖŽÝ Ž¼ŽÕŽÍŽÞŽÂ            */
	 UCHR   letphinf;                   /* ŽÌŽ´Ž²Ž½ŽÞ Ž¼ŽÞŽÖŽ³ŽÎŽ³              */
	 UCHR   letrsv[2];                  /*       ŽØŽ»ŽÞ-ŽÌŽÞ              */
	 union {
		 UCHR  *letlstr;                /* ŽÓŽ¼ŽÞ Ž±ŽÄŽÞŽÚŽ½                 */
		 long  *letlnum;                /* Ž¾Ž²Ž½Ž³ Ž±ŽÄŽÞŽÚŽ½                */
	 } letlft;                          /* Ž»ŽÍŽÝ Ž±ŽÄŽÞŽÚŽ½                 */
	 union {
		 UCHR  *letrstr1;               /* ŽÓŽ¼ŽÞ Ž±ŽÄŽÞŽÚŽ½                 */
		 long  *letrnum1;               /* Ž¾Ž²Ž½Ž³ Ž±ŽÄŽÞŽÚŽ½                */
		 long   letrcon1;               /* Ž¾Ž²Ž½Ž³ ŽÃŽ²Ž½Ž³                 */
	 } letrit1;                         /* Ž³ŽÍŽÝ ŽÀŽÞŽ²1 ŽÊŽßŽ×ŽÒ-ŽÀ Ž±ŽÄŽÞŽÚŽ½     */
	 union {
		 UCHR  *letrstr2;               /* ŽÓŽ¼ŽÞ Ž±ŽÄŽÞŽÚŽ½                 */
		 long  *letrnum2;               /* Ž¾Ž²Ž½Ž³ Ž±ŽÄŽÞŽÚŽ½                */
		 long   letrcon2;               /* Ž¾Ž²Ž½Ž³ ŽÃŽ²Ž½Ž³                 */
	 } letrit2;                         /* Ž³ŽÍŽÝ ŽÀŽÞŽ²2 ŽÊŽßŽ×ŽÒ-ŽÀ Ž±ŽÄŽÞŽÚŽ½     */
};

/*********************************************************************/
/*   IF ŽÌŽÞŽÝ ŽºŽÕŽ³ŽÌŽÞ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                            */
/*********************************************************************/
struct tgif {
	UCHR    ifopkd;
	UCHR    ifphinf;
	UCHR    ifrsv[2];
	union {
		UCHR   *iflstr;
		long   *iflnum;
		long    iflcon;
	} iflft ;
	union {
		UCHR   *ifrstr;
		long   *ifrnum;
		long    ifrcon;
	} ifrit;
};

/*********************************************************************/
/*   WAITMSG ŽÌŽÞŽÝ ŽºŽÕŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                     */
/*********************************************************************/
struct tgwtmg {
	long wtmgtype;
};

/*********************************************************************/
/*   ON CYCLE ŽÌŽÞŽÝ ŽºŽÕŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                    */
/*********************************************************************/
struct tgoncy {
	long  oncymin;
	long  oncytime;
};

/*********************************************************************/
/*   ON TIMER ŽÌŽÞŽÝ ŽºŽÕŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                    */
/*********************************************************************/
struct tgontm {
	short ontmhour;
	short ontmmin;
};
/*********************************************************************/
/*   WAITTIME ŽÌŽÞŽÝ ŽºŽÕŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                    */
/*********************************************************************/
struct tgwttm {
	long   wttmcon;
	long  *wttmnum;
};
