/*********************************************************************/
/*   ŽºŽÏŽÝŽÄŽÞŽ²ŽÝŽÀŽÌŽßŽØŽÀ ŽÃŽÝŽ¶Ž² ŽÖŽ³ Ž²ŽÝŽ¸ŽÙ-ŽÄŽÞ ŽÌŽ±Ž²ŽÙ                               */
/*********************************************************************/
extern int  ifc;                        /* IF ŽÈŽ½ŽÄ Ž¶Ž³ŽÝŽÀ               */
extern int  onc;                        /* ON ŽÈŽ½ŽÄ Ž¶Ž³ŽÝŽÀ               */
extern int  ifctr[8];                   /* IF Ž¶Ž³ŽÝŽÀ                   */
extern int  onctr[8];                   /* ON Ž¶Ž³ŽÝŽÀ                   */
extern UCHR *charp;                     /* ŽÓŽ¼ŽÞ ŽÊŽÞŽÂŽÌŽ± ŽÎŽßŽ²ŽÝŽÀ           */
extern struct chgtbl *ifp[8];           /* IF ŽÈŽ½ŽÄ ŽÃ-ŽÌŽÞŽÙ              */
extern struct chgtbl *onp[8];           /* ON ŽÈŽ½ŽÄ ŽÃ-ŽÌŽÞŽÙ              */
extern struct chgtbl *thenp[8];         /* THEN ŽÈŽ½ŽÄ ŽÃ-ŽÌŽÞŽÙ            */
extern UCHR sperrflg;                   /* ŽÃŽÝŽ¶Ž²ŽÖŽ³ Ž´Ž×- ŽÌŽ×Ž¸ŽÞ           */
