#include "mochar.h"

/*********************************************************************/
/*    ｺｳｿﾞｳﾀｲ ﾉ ﾃｲｷﾞ (ﾀﾁｱｹﾞ ﾄﾞｳｷ ﾂｳﾁ)                                */
/*********************************************************************/

struct motgsam {                        /* ﾀﾁｱｹﾞ ﾄﾞｳｷ ﾂｳﾁ            */
	struct momhead header;              /* ﾃﾞﾝﾌﾞﾝ ﾍｯﾀﾞ               */
	UCHR mokkcod;                       /* ﾂｳﾁ ｺｰﾄﾞ                  */
/*	UCHR mokkrsv1[3];       ﾐｼﾖｳ 1         削除					TD01 */
	UCHR mokksys;                       /* ｼｽﾃﾑｺｳｾｲ                  */
	UCHR mokkcls;                       /* ブロック区分			TD00 */
	UCHR mokkcods;						/* 相手系変更詳細		TD01 */
/*	UCHR mokkrsv2[2];       ﾐｼﾖｳ 2         削除					TD01 */
	long mokkmod;                       /* ﾌﾟﾛｸﾞﾗﾑ ﾓｰﾄﾞ              */
	UCHR mokkdte[14];                   /* ﾋﾂﾞｹ･ｼﾞｺｸ                 */
	UCHR mokkrsv[2];                    /* ﾐｼﾖｳ                 TD01 */
};
typedef struct motgsam MOTGSAM;

/*********************************************************************/
/*    M.S. ﾃﾞﾝﾌﾞﾝ  (ｲｼﾞｮｳ ﾂｳﾁ)						                 */
/*********************************************************************/

struct  moerrmsg {
	UCHR  ercode;						/* 電文識別				TD00 */
	UCHR  erdev;						/* 系区分				TD00 */
	UCHR  erauto;						/* ｼﾞﾄﾞｳ ｻｲｶｲｼ ｼﾞｮｳﾎｳ		 */
	UCHR  errsv;						/* ﾘｻﾞｰﾌﾞ					 */
	long  ermode;						/* ﾌﾟﾛｸﾞﾗﾑ ﾓｰﾄﾞ				 */
};
typedef struct moerrmsg MOERRMSG;

/***************************************************************TD00**/
/*      運転情報変更通知                                        TD00 */
/***************************************************************TD00**/

struct  motghm {											/*  TD01 */
	struct momhead header;              /* 電文ヘッダ			TD01 */
	UCHR  ercode;						/* 電文識別子			TD01 */
	UCHR  ercls;						/* ブロック区分			TD01 */
	UCHR  errsv1[2];					/* 予備１				TD01 */
	long  ermod;						/* プログラムモード		TD01 */
	UCHR  erdate[14];					/* 前回終了日付／時刻	TD01 */
	UCHR  errsv2[2];					/* 予備２				TD01 */
	UCHR  erosti[16];					/* ブロック状態情報		TD01 */
};															/*  TD01 */
typedef struct motghm MOTGHM;								/*  TD01 */

/***************************************************************TD00**/
/*      系間監視内電文（初期通知、立上げ状況通知／ﾚｽﾎﾟﾝｽ		TD00 */
/*									運転状況通知／ﾚｽﾎﾟﾝｽ）		TD00 */
/***************************************************************TD00**/

struct  mokktg {											/*	TD01 */
	struct momhead hd;                  /* 電文ヘッダ			TD01 */
	UCHR  mokklid;						/* 電文識別子			TD01 */
	UCHR  mokkcods;						/* 変更詳細				TD01 */
	UCHR  mokkrsv1[2];					/* 予備１				TD01 */
	long  mokksqno;						/* 電文通番				TD01 */
	UCHR  mokksys;						/* システム構成			TD01 */	
	UCHR  mokkcls;						/* ブロック区分			TD01 */
	UCHR  mokkrsv2[2];					/* 予備２				TD01 */
	long  mokkmod;						/* プログラムモード		TD01 */
	UCHR  mokkdate[14];					/* 前回終了日付／時刻	TD01 */
	UCHR  mokkrsv3[2];					/* 予備３				TD01 */
	UCHR  mokksti[16];					/* ブロック状態情報		TD01 */
};															/*  TD01 */
typedef struct mokktg MOKKTG;								/*  TD01 */

/*********************************************************************/
/*    ﾂｳﾁ ｺｰﾄﾞ				                                         */
/*********************************************************************/
/*********************************************************************/
/*    ﾀﾁｱｹﾞ ﾄﾞｳｷ ﾂｳﾁ ｺｰﾄﾞ  (ｾｲｼﾞｮｳ)                                  */
/*********************************************************************/
#define  MOTWSTOK  0x00                 /* 両系立上げ          TD01  */
#define  MOSINGLE  0x01                 /* ｶﾀｹｲ ﾀﾁｱｹﾞ (ﾂｳｼﾝ ｹｲ ﾕｳｺｳ) */
#define  MOHSTROK  0x02                 /* ﾋﾄﾞｳｷ ﾀﾁｱｹﾞ(ﾀｲﾑ ｱｳﾄ)		 */

/*********************************************************************/
/*    ｳﾝﾃﾝ ｼﾞｮｳｷｮｳ ｾﾝｲ ﾂｳﾁ ｺｰﾄﾞ (ｾｲｼﾞｮｳ)                             */
/*********************************************************************/
#define  MOATHSTR  0x10                 /* ｱｲﾃ ｹｲ ﾀﾁｱｹﾞ              */
#define  MOATHDWN  0x11                 /* ｱｲﾃ ｹｲ ﾀﾞｳﾝ (ﾀｲﾑ ｱｳﾄ)     */

/*********************************************************************/
/*    ｱｲﾃｹｲ ﾀﾞｳﾝ (ｻｲｶｲｼ ｶﾉｳ,ﾌｶﾉｳ ﾀﾞｳﾝ) (ﾀﾁｱｹﾞ, ｳﾝﾃﾝｼﾞｮｳｷｮｳ ﾄﾓ)       */
/*********************************************************************/
#define  MOATHRST  0x20					/* ｱｲﾃｹｲ ｻｲｶｲｼ ｶﾉｳ ﾀﾞｳﾝ		 */
#define  MOATHNRS  0x21					/* ｱｲﾃｹｲ ｻｲｶｲｼ ﾌｶﾉｳ ﾀﾞｳﾝ	 */

/*********************************************************************/
/*    ﾊﾞｽ ｴﾗｰ ﾊｯｾｲ (ﾀﾁｱｹﾞ, ｳﾝﾃﾝｼﾞｮｳｷｮｳ ﾄﾓ)            				 */
/*********************************************************************/
#define  MOERRBAS  0x80					/* ﾊﾞｽ ｴﾗｰ ﾊｯｾｲ				 */

/*********************************************************************/
/*    ﾛﾝﾘ ﾑｼﾞｭﾝ (ﾀﾁｱｹﾞﾄﾞｳｷ, ｳﾝﾃﾝｼﾞｮｳｷｮｳ ｾﾝｲ ﾂｳﾁ ﾄﾓ)     			 */
/*********************************************************************/
#define  MOTRGCHG  0x90					/* トリガ有無異常		TD01 */
#define  MOSYSCHG  0x91					/* ｼｽﾃﾑ ｺｳｾｲ ﾍﾝｶ			 */
#define  MOADVCHG  0x92					/* 相手系運転状態の変化 TD01 */
#define  MOMODCHG  0x93					/* ﾌﾟﾛｸﾞﾗﾑ ﾓｰﾄﾞ ﾍﾝｶ			 */
#define	 MODATCHG  0x94					/* ﾋﾂﾞｹ,ｼﾞｺｸ ﾍﾝｶ			 */
#define  MORSNCHK  0x95					/* ｻｲｶｲｼ ｶ･ﾋ ﾊﾝﾃｲ ﾌﾉｳ		 */
#define  MOELIDER  0x96					/* ｲｼﾞｮｳ ﾃﾞﾝﾌﾞﾝID ｲｼﾞｮｳ		 */
#define  MOCONTEL  0x97					/* 系間監視電文矛盾発生 TD01 */
#define  MOJDNOID  0x98					/* 系間監視電文判定不能 TD01 */
#define  MOKRSTRT  0x99					/* 孤立状態回復			TD01 */
#define  MOTIMOUT  0x9A					/* 0ｹｲ ﾂｳﾁﾏﾁ ﾀｲﾑ ｱｳﾄ		 */
#define  MOSFTNAG  0x9B					/* ｿﾌﾄ ﾚﾍﾞﾙ ﾌｲｯﾁ			 */

/*********************************************************************/
/*     ﾏｽﾀｽｹｼﾞﾕ-ﾗ ﾉ ｲｼﾞﾖｳ ﾂｳﾁ ｺ-ﾄﾞ                                   */
/*********************************************************************/
#define  MOABNORM  0x05                 /* ｲｼﾞﾖｳ ﾂｳﾁ                 */
#define  MOENDMSG  0x06                 /* ｼﾕｳﾘﾖｳ ﾂｳﾁ                */
#define  MOBASERR  0x07                 /* ﾊﾞｽｴﾗ- ﾂｳﾁ                */
#define  MOHNKO    0x08                 /* 運転情報変更通知		TD01 */

/*********************************************************************/
/*    MS. ｼﾕｳﾘﾖｳ ｸﾌﾞﾝ                                                */
/*********************************************************************/
#define  MOKKRSTR  'R'                  /* ｻｲｶｲｼ ｽﾙ                  */
#define  MOKKDOWN  'D'                  /* ｻｲｶｲｼ ｼﾅｲ                 */

/***************************************************************TD00**/
/*		変更詳細データ（ＭＳ電文用）							TD00 */
/***************************************************************TD00**/
#define  MOMSNMAL  0x00					/* 変更なし			    TD01 */
#define  MOMSPRMD  0x01					/* プログラムモード変更	TD01 */
#define  MOMSDTTM  0x02					/* 前回終了日付/時刻変更 TD01*/
