/********************************************************************/
/*  著作権  １９９４												*/
/*		      ＮＴＴデータ通信株式会社								*/
/*			    金融システム事業部									*/
/*																	*/
/*																	*/
/*  収容物  ＡＣＥ−ＳＭＰシステム									*/
/*		      ヘッダファイル( momhead.h )							*/
/********************************************************************/
/*------------------------------------------------------------------*/
/* ＜対象業務名＞                    運転管理業務          　　		*/
/* ＜対象業務ＩＤ＞                  ＯＣＰ                         */
/* ＜サービス項目名＞                				           　   */
/* ＜サービス項目ＩＤ＞              			                    */
/* ＜モジュール名＞                  								*/
/* ＜モジュールＩＤ＞                								*/
/* ＜モジュール通番＞                	                            */
/*------------------------------------------------------------------*/
/* ＜適用機種＞                      ＡＣＥ                         */
/* ＜適用ＯＳ＞                      ＴＲＡＤＥ                     */
/* ＜開発環境＞                      ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ     */
/* ＜記述言語＞                      Ｃ言語                         */
/* ＜モジュール形態＞                関数                           */
/* ＜機能区分＞                      	                            */
/* ＜対象データ＞                    	                            */
/* ＜工程・階層区分＞                                               */
/*------------------------------------------------------------------*/
/* ＜開発システム名＞                ＡＣＥ−ＳＭＰシステム         */
/* ＜開発システム番号＞              ５７２６０１４０２１００       */
/*------------------------------------------------------------------*/
/* ＜開発担当者名＞                  営業店システム担当             */
/* ＜電話番号＞                      169-3573(03-5702-3573)         */
/*------------------------------------------------------------------*/
/* ＜設計者名＞　　　　　　　　　　　								*/
/* ＜設計年月日＞                            						*/
/* ＜設計修正者名＞                                                 */
/* ＜設計修正年月日及び修正ＩＤ＞                                   */
/*------------------------------------------------------------------*/
/* ＜ソース作成者名＞               			                    */
/* ＜ソース作成年月日＞              						        */
/* ＜ソース修正者名＞                山本　智也         			*/
/* ＜ソース修正年月日及び修正ＩＤ＞  1995.7.24   SSCY0074	    	*/
/*   ( ﾃｰﾌﾞﾙ復旧通知及びﾃｰﾌﾞﾙ復旧完了通知の追加)  					*/
/* ＜ソース修正者名＞                赤塚　一元         			*/
/* ＜ソース修正年月日及び修正ＩＤ＞									*/
/*									1995.11.01   ST3589		    	*/
/*									1995.11.08   ST3431		    	*/
/*									1995.12.14   ST3847		    	*/
/*									1996.02.08   ST4016				*/
/* ＜ソース修正者名＞				Com'App 高橋 					*/
/* ＜ソース修正年月日及び修正ＩＤ＞	１９９７年  ５月　１日	ST4834  */
/*------------------------------------------------------------------*/
/* ＜見積ステップ数＞                ステップ                       */
/********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-005-10										 */
/*改造内容			:バイト反転対応									 */
/*改造日			:2002.11.08										 */
/*改造者			:supply watanabe								 */
/*********************************************************************/
/*********************************************************************/
/*      ﾒﾂｾ-ｼﾞ ｿｳｼﾞﾕｼﾝ ﾉ ﾄｷ ﾉ ﾍﾂﾀﾞ-                                  */
/*********************************************************************/
struct momhead{
    MCMIKYO momia;                      /* ｷﾖｳﾖｳ ｲｷ                  */ 
/*********************************************************************/
/*	PRC-005-10  修正 START 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
    long momk34 ;                       /* ｲﾝﾀﾌｪｰｽｺｰﾄﾞ               */
/*********************************************************************/
/*	PRC-005-10  修正 END 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
    long  mortno1;                      /* ｳｹﾂｹ ﾊﾞﾝｺﾞｳ 1             */ 
    long  mortno2;                      /* ｳｹﾂｹ ﾊﾞﾝｺﾞｳ 2             */ 
};
typedef  struct  momhead  MOMHEAD;

#define    momk1     momia.mcmimkcd[0]
#define    momk2     momia.mcmimkcd[1]
#define    momokk    momia.mcmisnkb
#define    momdkk    momia.mcmirvkb
#define    momonm    momia.mcmisnpn
#define    momdnm    momia.mcmirvpn
#define    momglen   momia.mcmimisz

/*********************************************************************/
/*	PRC-005-10  修正 START 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
union momk34_u{
	long momk_l;						/* ﾊﾝﾃﾝｺﾞｲﾝﾀﾌｪｰｽｺｰﾄﾞｦｶｸﾉｳ    */
	struct{
		short momk3;
		short momk4;
	}momk_s;
};
typedef union momk34_u MOMK34;

/*********************************************************************/
/*	PRC-005-10  修正 END 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/

/*********************************************************************/
/*       ﾃﾞﾝﾌﾞﾝﾍﾂﾀﾞ- ﾉ ｹｲｸﾌﾞﾝ ｼｷﾍﾞﾂｼ                                 */
/*********************************************************************/
#define MOMKTU 0x01                     /* ﾂｳｼﾝｹｲ ｼｷﾍﾞﾂｼ             */
#define MOMKSH 0x02                     /* ｼﾖﾘｹｲ ｼｷﾍﾞﾂｼ              */

/*********************************************************************/
/*       ﾃﾞﾝﾌﾞﾝ ｼｷﾍﾞﾂｼ                                               */
/*********************************************************************/
#define  MOMK1     0x03                 /* momk1 = ﾓﾁﾏﾜﾘ ﾃﾞﾝﾌﾞﾝ      */
#define  MOMK2     0x0C                 /* momk2 = OCP(momhead)      */
#define  MOMK2TC   0x20                 /* momk2 = from TC           */
#define  MOMK2SCP  0x06                 /* momk2 = from SCP          */
#define  MOMK2RCV  0x0D					/* momk2 = from RCV		TD44 */

/*       momk3                                                       */
                                        /* ｺﾏﾝﾄﾞ ｼﾞﾂｺｳ ﾖｳｷｭｳ         */
#define  MOMOTMCL  0x1000               /* ﾄｷ ｷﾄﾞｳ ｶﾗ                */
#define  MOSACMSG  0x1100               /* ｹｲｶﾝ ｶﾝｼ  ｳﾝﾖｳ ｼﾞﾖｳｷﾖｳ    */
#define  MOMOCALL  0x1300               /* ﾃｲｷｮｳ ｶﾝｽｳ ｶﾗ             */
#define  MORCVMSG  0x1400               /* ｼｽﾃﾑ ﾀﾞｳﾝ ﾂｳﾁ             */
#define  MOSMSMSG  0x1500               /* sub MS ｶﾗ ﾉ ﾂｳﾁ           */
#define  MOTCMSG   0x1700               /* ｵﾝﾗｲﾝ ﾄﾞｳｷ ﾃﾞﾝﾌﾞﾝ         */
#define  MOMSMSG   0x1000               /* ﾏｽﾀｽｹｼﾞｭｰﾗ ﾃﾞﾝﾌﾞﾝ         */
#define  MOSVCALL  0x1800               /* ﾃｲｷｮｳ ｶﾝｽｳ ｶﾗ             */
#define  MOSHODWN  0x10FF               /* ｼｮﾘｹｲ ﾀﾞｳﾝ ﾂｳﾁ            */
#define  MOSHORST  0x10F0               /* ｼｮﾘｹｲ ｶｲﾌｸ ﾂｳﾁ            */
#define	 MOMSSBMG  0x1A00				/* MS･ｻﾌﾞMSｲﾝﾀｰﾌｪｰｽ電文 TD59 */
#define  MOSIOMSG  0x5800               /* ｼｽﾃﾑ I/O ｾｲｷﾞｮ ｶﾗ         */
#define  MODSPMSG  0x1029				/* mo_desp(ｼｽﾃﾑ消滅)  ST4834 */

/*       momk4                                                       */
/*       momk3 = MOMOCALL : ｺﾏﾝﾄﾞ ｼﾞｯｺｳ ﾖｳｷｭｳ                        */
#define  MOEXCOMD  0x1000               /* ｺﾏﾝﾄﾞ ｼﾞﾂｺｳ ﾖｳｷﾕｳ         */
#define  MORQTBOK  0x1001               /* ﾃｰﾌﾞﾙ復旧依頼    SSCY0074 */

/*       momk3 = MOSACMSG                                            */
#define  MOSCSTAT  0x0100               /* ﾀﾁｱｹﾞ ﾄﾞｳｷ ﾂｳﾁ            */
#define  MOSACINM  0x0200               /* ﾀﾁｱｹﾞ ｼﾞﾖｳｷﾖｳ ﾂｳﾁ         */
#define  MOSACINR  0x0300               /* ﾀﾁｱｹﾞ ｼﾞﾖｳｷﾖｳ ﾚｽﾎﾟﾝｽ      */
#define  MOSACDRM  0x0400               /* ｳﾝﾃﾝ ｼﾞﾖｳｷﾖｳ ﾂｳﾁ          */
#define  MOSACDRR  0x0500               /* ｳﾝﾃﾝ ｼﾞﾖｳｷﾜｳ ﾚｽﾎﾟﾝｽ       */
#define  MOSCDRIV  0x0600               /* ｳﾝﾃﾝ ｼﾞﾖｳｷﾖｳ ｾﾝｲﾂｳﾁ       */
#define  MOSCDRID  0x0700               /* ｳﾝﾃﾝ ｼﾞﾖｳｷﾖｳ ｾﾝｲﾂｳﾁ(ﾑｼﾞﾕﾝ)*/
#define  MOSACINT  0x0800               /* ｼｮｷ ﾂｳﾁ                   */

/*       momk3 = MORCVMSG                                            */
#define  MOSDMSG   0x0000               /* ｼｽﾃﾑ ﾀﾞｳﾝ ﾂｳﾁ             */

/*       momk3 = MOSMSMSG                                            */
#define  MOINITFN  0x0100               /* ｼｮｷ ｶﾝﾘｮｳ ﾂｳﾁ             */
#define  MOEXECFN  0x0200				/* 起動完了通知			TD06 */
#define	 MOBUSRST  0x0300				/* ﾊﾞｽﾘｾｯﾄ依頼			TD06 */
#define	 MOTRTBMS  0x0400				/* Ｐｕ１ﾃｰﾌﾞﾙ待避依頼	TD59 */
#define	 MOMENTMS  0x0500				/* メンテナンス依頼		TD56 */
#define	 MOTBFNMS  0x0600				/*  LM1ﾃｰﾌﾞﾙ待避完了通知TD56 */

/*       momk3 = MOTCMSG                                             */
#define  MOTCONSM  0x0000               /* ｵﾝﾗｲﾝ ｶｲｼ ﾃﾞﾝﾌﾞﾝ          */
#define  MOTCONPM  0x0100               /* ｵﾝﾗｲﾝ end ﾃﾞﾝﾌﾞﾝ          */
#define  MOTCSTPM  0x0200               /* ｼｽﾃﾑ  end ﾃﾞﾝﾌﾞﾝ          */

/*       momk3 = MOMSMSG                                             */
#define  MORSPMSG  0x0100               /* ｹｲｶﾝ ｵｳﾄｳ ﾒｯｾｰｼﾞ          */
#define  MOTRMPR   0x6000               /* ﾌﾟﾛｾｽ ｼﾖｳﾒﾂ ﾂｳﾁ           */
#define  MOSBUSER  0x0300               /* SCSI ﾊﾞｽ ｴﾗｰ ﾂｳﾁ          */
#define  MOSWRONG  0x0400               /* ｲｼﾞﾖｳ ﾂｳﾁ                 */
#define  MOEXCMRL  0x5000               /* ｺﾏﾝﾄﾞ ｼﾞﾂｺｳ ｹﾂｶ           */
#define  MORSTBOK  0x5001               /* ﾃｰﾌﾞﾙ復旧完了 	SSCY0074 */
#define  MODESPR   0x0600               /* ﾌﾟﾛｾｽ ｼﾕｳﾘﾖｳ ﾖｳｷﾕｳ        */
#define  MODESPRF  0x0600               /* ﾌﾟﾛｾｽ ｼﾕｳﾘﾖｳ ﾖｳｷﾕｳ (POFF) */
#define  MOONLINE  0x0800 /* DELETE */  /* ｵﾝﾗｲﾝ ﾄﾞｳｷ ﾃﾞﾝﾌﾞﾝ         */
#define  MOONLMSG  0x0800               /* ｵﾝﾗｲﾝ ﾄﾞｳｷ ﾃﾞﾝﾌﾞﾝ         */
#define  MOCRSP1   0x0900               /* ｱｲﾃ ｹｲ ﾍﾉ ﾒｯｾｰｼﾞ(ﾒｲﾙﾎﾞｯｸｽ)*/
#define  MOCRSP2   0x0A00               /* ｱｲﾃ ｹｲ ﾍﾉ ﾒｯｾｰｼﾞ(ﾌﾟﾛｾｽ id)*/
#define  MOPTRSP   0x0B00               /* ｱｲﾃ ｹｲ ﾍﾉ ﾒｯｾｰｼﾞ(ｼﾖﾘ ｹﾂｶ )*/
#define  MOTRMSMS  0x0C00               /* ｻﾌﾞMS ｼｭｳﾘｮｳ ﾖｳｷｭｳ ﾒｯｾｰｼﾞ */
#define  MOSETPTM  0x0D00               /* ﾃﾞﾝｹﾞﾝ ｾｲｷﾞｮ ﾀｲﾏ   ﾒｯｾｰｼﾞ */
#define  MOHOTSBY  0x0E00               /* ｹｲ ｷﾘｶｴ ﾂｳﾁ               */
#define	 MOPRGT	   0x2000				/* プロセス情報取得結果	TD59 */
#define  MODRVOK   0x2100				/* 運用開始通知			TD06 */
#define  MOBSRSTOK 0x2200				/* ﾊﾞｽﾘｾｯﾄ完了通知		TD06 */
#define  MODWJR	   0x2300				/* ダウン要求電文		TD44 */
#define  MOTRSMMS  0x2400				/* ｻﾌﾞﾒﾝﾃﾅﾝｽｶｰﾈﾙ消滅通知TD56 */
#define  MOTRYBMS  0x2500				/* 予備系終了通知		TD01 */
#define  MOSTFINF  0x2600				/* 運転情報変更通知	    TD01 */
#define  MOSMTERR  0x2700				/* ｻﾌﾞﾒﾝﾃﾅﾝｽｶｰﾈﾙ異常終了通知 */
                                        /*                      TD56 */
#define	 MOCMFNMS  0x2800				/* CMﾃｰﾌﾞﾙ待避完了通知  TD56 */
#define  MODESMRM  0x3000				/* リカバリ完了要求		TD02 */
#define	 MOINTS	   0XF000				/* ＩＮＩＴ＿Ｓ通知		TD56 */
#define	 MOINTE	   0XF001				/* ＩＮＩＴ＿Ｅ通知		TD56 */
#define	 MOEPMD	   0xF002				/* ﾎｯﾄｽﾀﾝﾊﾞｲ両系PMD不一致TD01*/
#define	 MOSREVD   0xF003				/* ＳＲＣＶ回避通知		TD01 */
#define	 MOSPMSV   0xF004				/* ＳＰＭ待避通知	CT1045	 */
#define	 MOSPMSV2  0xF005				/* 更新領域ログ取得通知ST3589*/
#define	 MORRGCHG  0x4000				/* 他系ﾌﾟﾛｸﾞﾗﾑﾓｰﾄﾞ通知	TD01 */
#define	 MORCVIST  0x4100				/* RCVｼｽﾃﾑ初期化処理開始通知 */
										/*						TD06 */
#define	 MOFIPIST  0x4200				/* FIPｼｽﾃﾑ初期化処理開始通知 */
										/*			ST4016			 */

/*       momk3 = MOSVCALL                                            */
#define  MOPONTMR  0x0100               /* ﾃﾞﾝｹﾞﾝ ｾｲｷﾞｮ ﾀｲﾏ ｼｭﾄｸ ｲﾗｲ */

/*       momk3 = MOSHODWN                                            */
/*       momk3 = MOSHORST                                            */
#define  MOSHOTSU  0x0000               /* ｼｮﾘｹｲ ﾀﾞｳﾝ/ｶｲﾌｸ ﾂｳﾁ       */

/*		 momk3 = MOMSSBMG											 */
#define	 MOCHTPCT  0x0100				/* ＴＰＣＴ更新通知		TD59 */

/*		 momk3 = MODSPMSG									  ST4834 */
#define  MONMPMSG  0x0001				/* 管理外ﾌﾟﾛｾｽ終了通知ST4834 */

/********************************************************** SSCY0074 */
/*	テーブル復旧依頼電文									SSCY0074 */
/**********************************************************	SSCY0074 */
struct	motblreq	{					/*					SSCY0074 */
	long		moprsid;				/* 発信元プロセスID	SSCY0074 */
	char		morqkind;				/* ﾃｰﾌﾞﾙ依頼区分 	SSCY0074 */
	char		tblyob[3];				/* 予備				SSCY0074 */
}; 										/*					SSCY0074 */
typedef	struct	motblreq	MOTBLREQ;	/*					SSCY0074 */

/********************************************************** SSCY0074 */
/*	テーブル復旧完了電文									SSCY0074 */
/**********************************************************	SSCY0074 */
struct	motblrsl	{					/*					SSCY0074 */
	char		motbresult;				/* ﾃｰﾌﾞﾙ復旧結果    SSCY0074 */
	char		rslyob[3];				/* 予備 			SSCY0074 */
}; 										/*					SSCY0074 */
typedef	struct	motblrsl	MOTBLRSL;	/*					SSCY0074 */

/***************************************************************TD00**/
/*	ＯＣＰコマンド実行要求電文									TD00 */
/***************************************************************TD00**/
struct	mocmdreq	{					/*						TD89 */
	long		momlbxid;				/* 応答通信先ﾒｲﾙﾎﾞｯｸｽID	TD89 */
	char		mocmdstr[1];			/* ｺﾏﾝﾄﾞ文字列格納域先頭TD89 */
};										/*						TD89 */
typedef	struct	mocmdreq	MOCMDREQ;	/*						TD89 */

/*********************************************************************/
/*      ｺﾏﾝﾄﾞ ｳｹﾂｹ/ｶﾝﾘﾖｳ ﾂｳﾁ                                         */
/*********************************************************************/
struct mocmdmsg {
	long           mocfnscd;            /* ｶﾝﾘﾖｳ ｺ-ﾄﾞ                */
	char           mocdlcd[4];          /* ｼﾖｳｻｲ ｼﾞﾖｳﾎｳ              */
	char           mocpronm[8];         /* ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ             */
};
typedef struct mocmdmsg MOCMDMSG;

struct moptrmsg {
	long           mocendcd;            /* ｶﾝﾘﾖｳ ｺ-ﾄﾞ                */
	long           mocenddt;            /* ｼﾖｳｻｲ ｼﾞﾖｳﾎｳ              */
	char           mocname[8];          /* ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ             */
};
typedef struct moptrmsg MOPTRMSG;

/*********************************************************************/
/*      管理外プロセス終了通知構造体		                  ST4834 */
/*********************************************************************/
struct monmptrm {						/* 管理外ﾌﾟﾛｾｽ終了通知構造体 */
	long			mocid;				/* プロセス識別子            */
	long			mocendcd;			/* プロセス終了コード        */
};										/*					  ST4834 */
typedef struct monmptrm MONMPTRM;		/*					  ST4834 */

#define  MOCMDCPR  0L                   /* ｾｲｼﾞｮｳ (ﾌﾟﾛｾｽ ｾｲｾｲ)       */
#define  MOCMDEXE  1L                   /* ｾｲｼﾞｮｳ (ｺﾏﾝﾄﾞ ｼﾞｯｺｳ)      */
#define  MOCMDERR -1L                   /* ｴﾗｰ                       */

/*********************************************************************/
/*      ｵﾝﾗｲﾝ ﾄﾞｳｷﾃﾞﾝﾌﾞﾝ                                             */
/*********************************************************************/
struct moolmgfm {
	long moomkind;                      /* ﾃﾞﾝﾌﾞﾝ ｼﾕﾍﾞﾂ              */
};
typedef struct moolmgfm MOOLMGFM;

#define  MOOMOSTR  1L                   /* ｵﾝﾗｲﾝ ｶｲｼ                 */
#define  MOOMOEND  2L                   /* ｵﾝﾗｲﾝ ｼﾕｳﾘﾖｳ              */
#define  MOOMSEND  3L                   /* ｼｽﾃﾑ ｼﾕｳﾘﾖｳ               */

/*********************************************************************/
/*      sub MS ｶﾗﾉ ｼｮｷ ｶﾝﾘｮｳ ﾂｳﾁ                                     */
/*********************************************************************/
struct motgsms {
	MOMHEAD head;						/*				ST3847		 */
	long mosmspu;                       /* PU no                     */
	long zinrc;							/*				ST1120		 */
	long fidp1;							/*				ST1120		 */
	long fidp2;							/*				ST1120		 */
	long sysrc1;						/*				ST3431		 */
	long sysrc2;						/*				ST3431		 */
	long fcnd[2];						/*				ST3431		 */
	unsigned char svflg;				/*				ST3431		 */
	char yob[3];						/*				ST3431		 */
};
typedef struct motgsms MOTGSMS;

/*********************************************************************/
/*      ﾃﾞﾝｹﾞﾝ ｾｲｷﾞｮ ﾀｲﾏ ｼｭﾄｸ ﾃﾞﾝﾌﾞﾝ                                 */
/*********************************************************************/
struct mosmsg {
	struct momhead header;
	long result;                        /* ｹｯｶ                       */
	long settim;                        /* ﾃﾞﾝｹﾞﾝ ｾｲｷﾞｮ ﾀｲﾏ          */
};
typedef struct mosmsg MOSMSG;

struct mormsg {
	struct momhead header;
	long mbid;                          /* ﾒｲﾙ ﾎﾞｯｸｽ ｼｷﾍﾞﾂｼ          */
};
typedef struct mormsg MORMSG;

/*********************************************************************/
/*	ホットスタンバイ予備系プログラムモード通知（両系不一致時）		 */
/*********************************************************************/
struct	mohsepmd {
	struct	momhead	header;
	char	blkcls;
	char	resv[3];
	long	anopmode;
};
typedef	struct mohsepmd	MOHSEPMD;
