/*********************************************************************/
/*    moms.h ﾉ  ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ                                         */
/*********************************************************************/
  
/*********************************************************************/
/*    ﾘｸｴｽﾄ ｼｷﾍﾞﾂｼ ﾃ-ﾌﾞﾙ                                             */
/*********************************************************************/
#define  MOMSRDC  10                    /* ﾘｸｴｽﾄ ｼﾍﾞﾂｼ ｽｳ            */

#define  MOROSMB   0                    /* ROS ｼﾖｳｶﾞｲﾂｳﾁﾖｳ MB ｴﾝﾄﾘ NO*/
#define  MOMSMMB   1                    /* MS ﾒﾂｾ-ｼﾞﾂｳｼﾝﾖｳ MB ｴﾝﾄﾘ NO*/
#define  MOTRTRD   2                    /* ﾄｷｷﾄﾞｳ ｲﾝﾀ-ﾊﾞﾙﾀｲﾏRD ｴﾝﾄﾘNO*/
#define  MOTRMRD   3                    /* ｼﾕｳﾘﾖｳ ｲﾝﾀ-ﾊﾞﾙﾀｲﾏRD ｴﾝﾄﾘNO*/
#define  MODKWRD   4                    /* DISKﾖｳ ｲﾝﾀ-ﾊﾞﾙﾀｲﾏRD ｴﾝﾄﾘNO*/
#define  MOPWRRD   5					/* 商用電源回復待ちﾀｲﾏ ｴﾝﾄﾘNO*/
#define  MOALNRD   6					/* 孤立状態回復待ちﾀｲﾏ ｴﾝﾄﾘNO*/
#define  MOYBWRD   7					/* 予備系待ちタイマ	   ｴﾝﾄﾘNO*/
										/*		ST3589				 */
#define  MOADWRD   8					/* 相手系系ﾀﾞｳﾝ待ちﾀｲﾏ ｴﾝﾄﾘNO*/
										/*		CT1193				 */
 
/*********************************************************************/
/*    ﾖｳｷﾕｳ ｽﾞﾐ ﾌﾗｸﾞ ﾃ-ﾌﾞﾙ                                           */
/*********************************************************************/
#define  MOONID   '1'                   /* ﾖｳｷﾕｳ ｽﾞﾐ                 */
#define  MOOFFID  '0'                   /* ﾐﾖｳｷﾕｳ                    */
