
/****************************************************************************/
/*	著作権	１９９３														*/
/*			  ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物	ＡＣＥ−ＳＭＰシステム　ＯＣＰ　ＭＳ運転実行ソース				*/
/****************************************************************************/
/*	ＭＳ運転実行関数返却値ｄｅｆｉｎｅ										*/
/****************************************************************************/
/****************************************/
/*	共通								*/
/****************************************/
#ifdef	NORMAL
#else
	#define		NORMAL		0L
	#define		ABNORMAL	-1L
#endif

/****************************************/
/*	mo_ckck返却値						*/
/****************************************/
#define		CKCKNPCT	-1L				/* ＴＰＣＴに存在しない				*/

/****************************************/
/*	mo_ocst返却値						*/
/****************************************/
#define		OCSTNOPR	1L

/****************************************/
/*	mo_crad返却値						*/
/****************************************/
#define		CRADMSLF	0				/* 自系宛コマンド					*/
#define		CRADANOB	1L				/* 他ブロック宛コマンド				*/
#define		CRADANON	2L				/* 他ノード宛コマンド				*/
#define		CRADNOID	3L				/* 宛先識別子省略					*/
#define		CRADSYNE	-1L				/* 宛先識別子シンタックスエラー		*/
#define		CRADCMDE	-2L				/* コマンド文字列異常				*/
