/****************************************************************************/
/*																			*/
/*	マスタスケジューラ定数定義ヘッダ : momsdef.h							*/
/*																			*/
/*＜ソース修正者名＞				Com'App 高橋 					 		*/
/*＜ソース修正年月日及び修正ＩＤ＞	１９９７年  ６月　４日		ST4861   	*/
/*																			*/
/****************************************************************************/
/********************************************************************/
/*  仕様変更番号 	: SSLA0027									    */
/*  修正内容		: 立上げモード設定関数の呼び出し処理追加に伴い	*/
/*					  ダウンコードの追加                            */
/*  修正日			: 2003.05.27									*/
/*	修正者			: supply Sugawara								*/
/********************************************************************/
/****************************************/
/*	ｔｙｐｅｄｅｆ						*/
/****************************************/
typedef		unsigned	long	POINTER;

#define		SUCCESS		0L
#define		FAILURE		-1L

/***************************************/
/*	ＴＰＣＴ関係					   */
/***************************************/
#define		MONOCMD		0L
#define		MOEXSCP		1L
#define		MOEXOCP		2L

#define		MOINSON		'1'				/*						CT0550		*/
#define		MOINSOFF	'0'				/*						CT0550		*/

#define		MOFIXENT	1				/* ＴＰＣＴ固定エントリ数			*/ /* PRC-040-08 */
#define		MOENTMOA	0				/* ＭＳエントリ番号					*/
#define		MOENTMOB	1				/* 系間監視エントリ番号				*/
#define		MOENTMMB	4				/* メンテナンスカーネルエントリ番号	*/

#define		MOETNOMS	0				/* ＭＳエントリ番号					*/

#define		MOPNMMSG	"mog000"		/* メッセージ中継プロセス識別名		*/

#define		MOYOBIKK	'F'				/* 予備系ブロック区分				*/
#define		MOANODWN	' '				/* ダウン							*/

#define		TPCTHING	'0'				/* ﾎｯﾄｽﾀﾝﾊﾞｲｻｽﾍﾟﾝﾄﾞ起動不要			*/
#define		TPCTHSUS	'1'				/* ﾎｯﾄｽﾀﾝﾊﾞｲｻｽﾍﾟﾝﾄﾞ起動要			*/

/****************************************/
/*	ＴＳＳＴ関連						*/
/****************************************/
#define		MOOWNINF	0x00			/* ﾎｯﾄｽﾀﾝﾊﾞｲ自系情報ｲﾝﾃﾞｯｸｽ			*/
#define		MOANOINF	0x0F			/* ﾎｯﾄｽﾀﾝﾊﾞｲ相手系情報ｲﾝﾃﾞｯｸｽ		*/
#define		MOYBIINF	0x0F			/* ｺｰﾙﾄﾞｽﾀﾝﾊﾞｲ予備系情報ｲﾝﾃﾞｯｸｽ		*/
#define		MOGENINF	0x01			/* ｺｰﾙﾄﾞｽﾀﾝﾊﾞｲ現用系情報ｲﾝﾃﾞｯｸｽ		*/

#define		MOKEIMAX	0x0000000F

#define		TSSTDRIV	'N'				/* 運転中							*/
#define		TSSTBDWN	'D'				/* ダウン中							*/
#define		TSSTBNON	' '				/* 未使用							*/

/***************************************/
/*	外部領域関係						*/
/****************************************/
#define		MOPU1STR	'0'
#define		MOPU1DIS	'1'

#define		MOHKKOFF	'0'				/*	系切替依頼オフ					*/
#define		MOHKKON		'1'				/*	系切替依頼オン					*/

#define		MOALRDY		'1'				/*	ＯＮ							*/
#define		MONYET		'0'				/*	ＯＦＦ							*/

#define		MOANOENT	0x00			/* ﾎｯﾄｽﾀﾝﾊﾞｲ相手系情報ｲﾝﾃﾞｯｸｽ		*/

#define		MOYWTIME	120L			/*	予備系待ち時間	ST3589			*/
#define		MODWTIME	30L				/*	相手系ﾀﾞｳﾝ待ち時間	CT1193		*/
/****************************************/
/*	mo_stkk								*/
/****************************************/
#define		MOCRE		1L				/*	起動							*/
#define		MORECRE		2L				/*	再起動							*/

/****************************************/
/*	momrhflg							*/
/****************************************/
#define		MOMRHYET	0L				/*	ＭＲＨメイルボックス未作成		*/
#define		MOMRHOK		1L				/*	ＭＲＨメイルボックス作成済み	*/

/****************************************/
/* mo_stgt								*/
/****************************************/
#define		MOSTGTCM	0L				/*	ＣＭ							*/
#define		MOSTGTLM	1L				/*	ＬＭ							*/
/****************************************/
/* mo_vcst								*/
/****************************************/
#define		MOVCSTCM	0L				/*	ＣＭ							*/
#define		MOVCSTLM	1L				/*	ＬＭ							*/
#define		MOVCSTOK	0L				/*	成功				CT0696		*/
#define		MOVCSTNG	-1L				/*	失敗				CT0696		*/

/****************************************/
/*	リモメン関係(init_s発行ｽﾃｰﾀｽ)		*/
/****************************************/
#define		MOINTYET	0				/* 未処理							*/
#define		MORINITS	1				/* ＩＮＩＴ＿Ｓコマンド受信済み		*/
#define		MORINITE	2				/* ＩＮＩＴ＿Ｅコマンド受信済み		*/
#define		MORINITR	4				/* ＩＮＩＴ＿Ｒコマンド受信済み		*/

/****************************************/
/*	コマンド受付・解析・実行関連		*/
/****************************************/
#define		MOPARSZ		256				/* 起動パラメタ格納領域サイズ		*/

/****************************************/
/*	メッセージ中継関連					*/
/****************************************/
#define		MOMKDN		0x00			/* 系区分識別子（宛先系ダウン）		*/

/****************************************/
/*	その他								*/
/****************************************/
#define		NULL		0
/****************************************/
/*	系間監視終了コード関係				*/
/****************************************/
#define		KKDPARCNT	0x00031140		/*	パラメタ個数異常				*/
#define		KKDTGRERR	0x00031141		/*	トリガ有無異常					*/
#define		KKDBLKERR	0x00031142		/*	ブロック異常					*/
#define		KKDTIMERR	0x00031143		/*	同期待ち／レスポンス待ち時間異常*/
#define		KKDPMDERR	0x00031144		/*	プログラムモード異常			*/
#define		KKDMIDERR	0x00031145		/*	メールボックス識別子			*/
#define		KKDSYFERR	0x00031146		/*	システム構成異常				*/
#define		KKDDMDERR	0x00031147		/*	起動区分異常					*/
#define		KKDRMRERR	0x00031148		/*	メッセージ受信要求異常			*/
#define		KKDSTMERR	0x00031149		/*	インタバルタイマ設定異常		*/
#define		KKDANRERR	0x0003114B		/*	不特定リザルト受信異常			*/
#define		KKDSMSERR	0x0003114C		/*	メッセージ送信異常				*/
#define		KKDCNRERR	0x0003114E		/*	非完了型処理要求取消異常		*/
#define		KKDGTRERR	0x00031151		/*	特定リザルト受信異常			*/
#define		KKDSTXERR	0x00031152		/*	例外ハンドラ設定異常			*/
#define		KKDEXHERR	0x00031153		/*	例外ハンドラからの終了			*/

/****************************************/
/*	プログラム種別						*/
/****************************************/
#define		MOPRGMOA	"E0"			/* マスタスケジューラ				*/
#define		MOPRGMOB	"E1"			/* シングル系間監視					*/
#define		MOPRGMOC	"E2"			/* コマンドインタプリタ				*/
#define		MOPRGMOD	"E3"			/* サブマスタスケジューラ			*/
#define		MOPRGMOE	"E4"			/* マルチ系間監視					*/
#define		MOPRGMOF	"E5"			/* システムメッセージ制御			*/
#define		MOPRGMOG	"E6"			/* システムメッセージ中継			*/
#define		MOPRGMOH	"E7"			/* ＯＳコマンド実行プロセス			*/

#define		MOPRGMMA	"F1"			/* リモートメンテナンス				*/
#define		MOPRGMMAS	"F2"			/* リモートメンテナンス				*/
#define		MOPRGMRA	"C0"			/* システムリカバリ		ST2716		*/
#define		MOPRGMRL	"CA"			/* サブシステムリカバリ	ST2716		*/
#define		MOPRGMRM	"CB"			/* 先行リカバリ						*/

/****************************************/
/*	マクロ								*/
/****************************************/
/*	ＴＳＳＴより自ブロック番号を求める	*/
#define		MOMYBLKNO	{\
		mosstkp->tsstsysd == MOYOBIKK	/* ＴＳＳＴのブロック区分が予備系	*/\
		&&	mosstkp->tsstchbn != ' ' ?	/* 現用系を代行中					*/\
		mosstkp->tsstchbn:\
		mosstkp->tsstsysd\
	}

/****************************************/
/*	プログラムモード関連				*/
/****************************************/
/*	ＡＰ運転モード取り出し				*/
#define	MOAPDVMD(PMOD)	( ( PMOD & 0x00F00000 ) >> 20 )

/*	系区分取り出し						*/
#define	MOKCLSMD(PMOD)	( ( PMOD & 0x000000F0 ) >> 4 )

/*	ＳＭＰ運転モード取り出し			*/
#define	MOSMPDMD(PMOD)	( PMOD & 0x0000000F )

/*	ＳＭＰ運転モード					*/
#define	MOEDTSYS	0x0000000F			/* システム修正モード				*/

/****************************************/
/*	ホットスタンバイ予備系系切替関連	*/
/****************************************/
#define	MOHSEVVL	1L					/* サスペンド解除イベント送信加算値	*/

/****************************************/
/*	システムモード関連					*/
/****************************************/
#define	MOSYSKMD	0x00000040			/* 系種別							*/

/****************************************/
/*  ＳＭＰ終了シェル名                  */
/****************************************/
/* ホットスタンバイ構成用終了シェル */
#define MOSMPSTP_H   "SMP_STOP_H.sh"
/* シンプレックス構成用終了シェル */
#define MOSMPSTP_S   "SMP_STOP_S.sh"
/****************************************/
/*  クラッシュダンプ構成情報設定	    */
/****************************************/
#define LKCDCONFIG_l "lkcd_config -l 0"

/****************************************/
/*	mohsnsp								*/
/****************************************/
#define	MOPMSM		0L
#define	MOPMNSM		1L
/****************************************/
/*	ﾏｳﾝﾄﾌﾗｸﾞ							*/
/****************************************/
#define	MORVOFF		0L						/*	マウントしていない			*/
#define	MORVON		1L						/*	マウント済み				*/

/****************************************/
/*	mo_jtrb 呼出モード					*/
/****************************************/
#define	SRCVFAIL	0L						/*	ＳＲＣＶ失敗時				*/
#define	RCVTLON		1L						/*	二重故障電文受信時			*/
#define	RCVTLOFF	2L						/*	初期化完了電文受信時		*/
#define	BMSTLON		3L						/*	ＭＳ間故障通知受信時		*/
#define	BMSTLOFF	4L						/*	ＭＳ間初期化完了電文受信時	*/
/****************************************/
/*	mo_vcrd 返却値						*/
/****************************************/
#define MOFZINTC	-1L						/*	CMﾃｰﾌﾞﾙﾌｧｲﾙﾏｳﾝﾄに失敗		*/
#define MOFZINTL	-2L						/*	LMﾃｰﾌﾞﾙﾌｧｲﾙﾏｳﾝﾄに失敗		*/
#define MOFZVLDC	-3L						/*	CMﾍﾞｸﾀﾃｰﾌﾞﾙ展開に失敗		*/
#define MOFZVLDL	-4L						/*	LMﾍﾞｸﾀﾃｰﾌﾞﾙ展開に失敗		*/
#define MOFGTPBF	-5L						/*	LMﾍﾞｸﾀﾃｰﾌﾞﾙ用ﾊﾞｯﾌｧ確保失敗	*/
#define MOFFRPBF	-6L						/*	LMﾍﾞｸﾀﾃｰﾌﾞﾙ用ﾊﾞｯﾌｧ解放失敗	*/
#define MOFZTRMC	-7L						/*	CMﾃｰﾌﾞﾙﾌｧｲﾙｱﾝﾏｳﾝﾄで失敗		*/
#define MOFZTRML	-8L						/*	LMﾃｰﾌﾞﾙﾌｧｲﾙｱﾝﾏｳﾝﾄで失敗		*/
#define MOFZGSZL	-9L						/*	ＬＭﾍﾞｸﾀﾃｰﾌﾞﾙｻｲｽﾞ取得で失敗 */

/****************************************/
/*	ｍｏ＿ｓｙｍｄ指定モード定義		*/
/****************************************/
#define	MOSYSYB		0x00000040			/* 予備系							*/
#define	MOSYSGN		~MOSYSYB			/* 現用系							*/

/****************************************/
/*	ダウンステータス					*/
/****************************************/
#define	MOSMPDOWN	'S'					/*	ＳＭＰによるダウン				*/
#define	MOOSDOWN	'O'					/*	ＯＳによるダウン				*/

/****************************************/
/*	ミラー同期要／不要		ST2610		*/
/****************************************/
#define	MONOMIR		'0'					/*	ミラー同期不要					*/
#define	MONEMIR		'1'					/*	ミラー同期要					*/
/****************************************/
/*	相手系ﾀﾞｳﾝ待ちフラグ				*/
/****************************************/
#define		MOADWON		1L				/*						CT1193		*/
#define		MOADWOFF	0L				/*						CT1193		*/
/****************************************/
/*	相手系ダウン待ち要／不要			*/
/****************************************/
#define	MONOADW		'0'					/*	相手系ダウン待ち不要	CT1193	*/
#define	MONEADW		'1'					/*	相手系ダウン待ち要		CT1193	*/
/****************************************/
/*	立ち上げ同期時相手系確定ﾌﾗｸﾞ		*/
/****************************************/
#define	MOSMADON	'1'					/*	立ち上げ同期時相手系ﾀﾞｳﾝ確定	*/
										/*		CT1193						*/
#define	MOSMADOFF	'0'					/*	立ち上げ同期時相手系ﾀﾞｳﾝ未確定	*/
										/*		CT1193						*/
/****************************************************************************/
/*	ＩＣＰプロセス状態フラグ(moicpflg)								ST4891	*/
/****************************************************************************/
#define	MOICPACT	0x01				/*	ＩＣＰプロセス起動中	ST4861	*/
#define	MOICPINA	0x00				/*	ＩＣＰプロセス未起動	ST4861	*/

/****************************************/
/* 立上げモード			SSLA0027		*/
/****************************************/
#define MONEXMODEN	'N'					/* ノーマルモード			SSLA0027*/
#define MONEXMODEM	'M'					/* 終了途中モード			SSLA0027*/
#define MONEXMODER	'R'					/* リカバリモード			SSLA0027*/

