/****************************************************************************/
/*	構造体の定義（ヘッダファイル）											*/
/****************************************************************************/
#include	"mochar.h"

/****************************************************************************/
/* 立ち上げ同期用制御表														*/
/****************************************************************************/
struct	msstsync {
	UCHR	blkinf[16];					/* ブロック状態情報					*/
	UCHR	dwninf[16];					/* ダウン再開始可／不可情報域		*/
	UCHR	equinf[16];					/* 装置有無情報						*/
};
typedef	struct	msstsync	MSSTSYNC;
/****************************************************************************/
/*	ＭＳ間故障通知・ＭＳ間初期化完了電文									*/
/****************************************************************************/
struct	momsdwjr {
	struct	momhead	header;				/*	電文ヘッダー					*/
	long	moomkind;					/*	電文識別用						*/
	long	trblkind;					/*	故障区分						*/
};
typedef	struct momsdwjr		MOMSDWJR;

#define	MOJRTRBL	0x10000000			/*	ＭＳ間故障通知					*/
#define	MOJROK		0x11000000			/*	ＭＳ間初期化完了電文			*/
#define MORVJNLERR	1L					/*	JNL故障							*/
#define MORVRBIERR	2L					/*	RBI故障							*/
#define	MORVJNLOK	3L					/*	JNL初期化完了					*/
#define	MORVRBIOK	4L					/*	RBI初期化完了					*/
/****************************************************************************/
/*	運用開始通知・バスリセット完了通知・RCVｼｽﾃﾑ初期化処理開始通知			*/
/****************************************************************************/
struct	momssbint	{
	struct	momhead	header;				/*	電文ヘッダー					*/
	long	moomkind;					/*	電文識別用						*/
};
typedef	struct momssbint	MOMSSBINT;

#define	MODRVSTT	0x12000000			/*	運用開始通知					*/
#define	MORCVINST	0x13000000			/*	RCVｼｽﾃﾑ初期化処理開始通知		*/
#define	MOBSRETFN	0x14000000			/*	バスリセット完了通知			*/
/****************************************************************************/
/*	ＳＲＣＶ回避通知														*/
/****************************************************************************/
struct	moevade	{
	struct	momhead	header;				/*	電文ヘッダー					*/
	long	moomkind;					/*	電文識別用						*/
};
typedef	struct	moevade		MOEVADE;

#define	MOSRCVEVD	0x15000000			/*	ＳＲＣＶ回避通知				*/
/****************************************************************************/
/*	予備系終了依頼通知	                                            		*/
/****************************************************************************/
struct  momterm  {
	struct	momhead	header;				/*	電文ヘッダー					*/
	long	trtype;		    			/*	終了種別識別用					*/
};
typedef struct momterm  MOMTERM;
/****************************************************************************/
/*	他系プログラムモード通知												*/
/****************************************************************************/
struct  moabmd	{
	struct	momhead	header;
	char	blk;
	char	yob[3];
	long	anopmode;
};
typedef	struct	moabmd	MOABMD;
/****************************************************************************/
/*	リカバリ完了要求														*/
/****************************************************************************/
struct	rvereq	{
	struct	momhead	header;
	char	cmskb;
	char	lmskb;
	char	rsv[2];
};
typedef	struct	rvereq	RVEREQ;
