/*********************************************************************/
/*    ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ² ŽÉ ŽÃŽ²Ž·ŽÞ (ŽÀŽÁŽ±Ž¹ŽÞ ŽÄŽÞŽ³Ž· ŽÂŽ³ŽÁ)                                */
/*********************************************************************/
struct motgsam {                        /* ŽÀŽÁŽ±Ž¹ŽÞ ŽÄŽÞŽ³Ž· ŽÂŽ³ŽÁ            */
	struct momhead header;              /* ŽÃŽÞŽÝŽÌŽÞŽÝ ŽÍŽ¯ŽÀŽÞ               */
	char mokkcod;                       /* ŽÂŽ³ŽÁ ŽºŽ°ŽÄŽÞ                  */
	char mokkrsv1;                      /* ŽÐŽ¼ŽÖŽ³                      */
	long mokkmod;                       /* ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ ŽÓŽ°ŽÄŽÞ              */
};
typedef struct motgsam MOTGSAM;
