/****************************************************************************/
/*	著作権	１９９３														*/
/*			  ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物	ＡＣＥ−ＳＭＰシステム　ＯＣＰヘッダファイル　　				*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 運転実行管理業務						*/
/*＜対象業務ＩＤ＞					 ＯＣＰ									*/
/*＜サービス項目名＞				 										*/
/*＜サービス項目ＩＤ＞				 										*/
/*＜モジュール名＞					 ｍｏｗｔｏｍ．ｈ 						*/
/*＜モジュールＩＤ＞				 										*/
/*＜モジュール通番＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 										*/
/*＜機能区分＞						 										*/
/*＜対象データ＞					 										*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 163-3573(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 										*/
/*＜設計年月日＞					 										*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 										*/
/*＜ソース作成年月日＞				 										*/
/*＜ソース修正者名＞				 山本　智也								*/
/*＜修正年月日及び修正ＩＤ＞		'94/12/14			SSCY0015 M01		*/
/*	（	ＵＰＳ対応機能　仕様変更要求書番号　ＳＳＣＹ００１５  ）			*/	
/*＜ソース修正者名＞		 		山本智也								*/
/*＜修正年月日及び修正ＩＤ＞			'95/10/17	SSCY0117		 		*/
/*	（	系切替ＭＳＧ出力　仕様変更要求書番号　ＳＳＣＹ０１１７） 			*/
/*＜ソース作成者名＞				Ｃｏｍ’Ａｐｐ							*/
/*＜ソース作成年月日＞				'96/02/21			ST3951				*/
/*＜ソース修正者名＞				 Com'App 山口							*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９６年４月１０日		ST4008		*/
/*									 (装置間通信用バスリセット機能)			*/
/*																			*/
/* ＜ソース修正者名＞				 営業店システム部　山口(KSP)			*/
/* ＜ソース修正年月日及び修正ＩＤ＞  ２０００年０３月２２日		SPCY0150	*/
/*	"DK個別電源部FANアラーム端子の仕様変更依頼"								*/
/*   "SODC"追加																*/
/*--------------------------------------------------------------------------*/
/*********************************************************************/
/*    ｼｭｯﾘｮｸ ﾒｯｾｰｼﾞ ﾉ ﾃｲｷﾞ                                           */
/*********************************************************************/
#include "mochar.h"

/*********************************************************************/
/*    < ??????? >  ??????? ﾊ ｶﾍﾝ ﾓｼﾞ                                 */
/*********************************************************************/
/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ｾﾞﾝ ﾀﾝﾏﾂ ﾋﾖｳｼﾞ )                              */
/*********************************************************************/
   
#define  MOSYDOWN  (UCHR *)"SO01"       /* ｼｽﾃﾑ ﾀﾞｳﾝ                 */
#define  MOSKDOWN  (UCHR *)"SO02"       /* ｼﾖﾘｹｲ ﾀﾞｳﾝ                */
#define  MOWRITNG  (UCHR *)"SO03"       /* oswtire ｼｯﾊﾟｲ < MSGID >   */
#define  MOMAXPNZ  (UCHR *)"SO04"       /* ﾌﾟﾛｾｽﾒｲ ｶﾞ 8 ｵ ｺｴﾀ   CK   */
#define  MONGPRMZ  (UCHR *)"SO05"       /* ﾊﾟﾗﾒ-ﾀ ﾉ ｺｽｳ ｶﾞ ﾌﾄｳ       */
#define  MOPROFIZ  (UCHR *)"SO06"       /* ｼｮﾘ ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ         */
										/* < ｺﾏﾝﾄﾞ ﾒｲ >              */
#define  MONGPNMZ  (UCHR *)"SO07"       /* ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ ﾌﾄｳ         */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ >		 */
#define  MONGOPRZ  (UCHR *)"SO08"       /* ｵﾍﾟﾗﾝﾄﾞ ﾌﾄｳ               */
										/* < ｵﾍﾟﾗﾝﾄﾞ >      	 	 */
#define  MONGBICZ  (UCHR *)"SO09"       /* ﾊﾞｲﾅﾘ ﾍﾝｶﾝ ｲｼﾞﾖｳ (ｼﾞｺｸ)   */
#define  MOANMACZ  (UCHR *)"SO0A"       /* ﾀﾞﾄｳｾｲ ﾉ ﾁｴﾂｸ ﾌﾄｳ (ｼﾞｺｸ)  */
#define  MONGTIMZ  (UCHR *)"SO0B"       /* ﾄｳﾛｸ or ﾍﾝｺｳ ﾌｶﾉｳ         */

/*********************************************************************/
/*    ﾒｯｾｰｼﾞ ﾊﾞﾝｺﾞｳ ( ｴｷｼﾖｳ ﾃﾞｲｽﾌﾟﾚｲ ﾋﾖｳｼﾞ )                         */
/*********************************************************************/

#define  MOSTDIS   (UCHR *)"SO10"       /* ROS ｼﾖｳｶﾞｲ ﾂｳﾁ ﾒﾂｾ-ｼﾞ     */
										/* < ﾁｭｳﾌﾞﾝﾙｲ ｺｰﾄﾞ >		 */
#define  MOTDWNCD  (UCHR *)"SO11"       /* ｼｽﾃﾑ ﾀﾞｳﾝ ﾒﾂｾ-ｼﾞ          */
										/* < ﾀﾞｳﾝ ｺｰﾄﾞ >    		 */
										/* < ｼｮｳｻｲ ｼﾞｮｳﾎｳ > 		 */
#define  MOSYSST   (UCHR *)"SO12"       /* ｼｽﾃﾑ ｶｲｼ ﾒﾂｾ-ｼﾞ           */
										/* < ﾊﾞｰｼﾞｮﾝ ﾚﾍﾞﾙ > 		 */
#define  MOSTCMP   (UCHR *)"SO13"       /* ｶｲｼ ｶﾝﾘﾖｳ ﾒﾂｾ-ｼﾞ          */
										/* < ｹｲｸﾌﾞﾝ >       		 */
										/* < ﾌﾟﾛｸﾞﾗﾑ ﾓｰﾄﾞ > 		 */
#define  MOEXCPT   (UCHR *)"SO14"       /* ﾚｲｶﾞｲ ﾊﾂｾｲ ﾒﾂｾ-ｼﾞ         */
										/* < ﾚｲｶﾞｲ ｼｭﾍﾞﾂ  > 		 */
										/* < ﾚｲｶﾞｲ ｺｰﾄﾞ   > 		 */
#define  MOHOTMSG  (UCHR *)"SO15"       /* ﾎｯﾄｽﾀﾝﾊﾞｲ ｹｲｷﾘｶｴ ﾒｯｾｰｼﾞ	 */
#define  MOWAITST  (UCHR *)"SO16"       /* プログラムモード変更待ち開始メッセージ	KL0009 */
#define  MOWAITED  (UCHR *)"SO17"       /* プログラムモード変更待ち終了メッセージ	KL0009 */
/*********************************************************************/
/*    ｷｮｳﾂｳ ﾒｯｾｰｼﾞ                                                   */
/*********************************************************************/

#define  MOMAXPNM  (UCHR *)"SO20"       /* ﾌﾟﾛｾｽﾒｲ ｶﾞ 8 ｵ ｺｴﾀ   CK   */
#define  MONOPCBR  (UCHR *)"SO21"       /* PCT ﾆ ｱｷ ｶﾞ ﾅｲ       CK   */
#define  MOENDING  (UCHR *)"SO22"       /* ｼﾕｳﾘﾖｳ ｼﾖﾘ ﾁﾕｳ       CK   */
#define  MONGPRME  (UCHR *)"SO23"       /* ﾊﾟﾗﾒ-ﾀ ﾉ ｺｽｳ ｶﾞ ﾌﾄｳ       */
#define  MONGPFNM  (UCHR *)"SO24"       /* ﾌﾟﾛｸﾞﾗﾑﾌｱｲﾙﾒｲ ｶﾞ NG  CK   */
#define  MOPROFIN  (UCHR *)"SO25"       /* ｼｮﾘ ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ         */
										/* < ｺﾏﾝﾄﾞ ﾒｲ >              */
#define  MONGPNM   (UCHR *)"SO26"       /* ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ ﾌﾄｳ         */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ >		 */
#define  MONGOPRD  (UCHR *)"SO27"       /* ｵﾍﾟﾗﾝﾄﾞ ﾌﾄｳ               */
										/* < ｵﾍﾟﾗﾝﾄﾞ >      	 	 */
#define  MONOFILE  (UCHR *)"SO28"       /* ﾌﾟﾛｸﾞﾗﾑﾌｱｲﾙﾒｲ ｶﾞ ﾅｲ       */
										/* < ﾌﾟﾛｸﾞﾗﾑ ﾌｧｲﾙ ﾒｲ >		 */

/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ｺﾏﾝﾄﾞ ｳｹﾂｹ )                                  */
/*********************************************************************/
 
#define  MOCONMSG  (UCHR *)"SO30"       /* ｺﾏﾝﾄﾞ ｳｹﾂｹ ﾒﾂｾ-ｼﾞ         */
#define  MOSSTNOT  (UCHR *)"SO31"       /* ｱｲﾃｹｲ ｶﾞ ｼｮｳﾘｮｳ ｼｮﾘﾁｭｳ    */
#define  MOOERNTC  (UCHR *)"SO32"       /* ﾀ NTC ｱﾃ                  */
#define  MOSYNEOR  (UCHR *)"SO33"       /* ｼﾝﾀﾂｸｽ ｴﾗ-   '-' ｶﾞ ﾅｲ    */
#define  MOSSTCHG  (UCHR *)"SO34"       /* SST ｼﾕｳﾘﾖｳ ｽﾃ-ﾀｽ ﾁｴﾂｸ ﾌﾄｳ */
#define  MOINVCMD  (UCHR *)"SO35"       /* ｺﾏﾝﾄﾞﾒｲ ﾅｼ                */
#define  MOHSCHG   (UCHR *)"SOC0"		/* ﾎｯﾄｽﾀﾝﾊﾞｲ予備系切替中TD02 */

/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ｺﾏﾝﾄﾞ ｶｲｾｷ   )                                */
/*********************************************************************/

#define  MOIRRTRM  (UCHR *)"SO36"       /* ﾌﾄｳ ﾅ ﾌﾟﾛｾｽ ﾉ ｼﾕｳﾘﾖｳ CK   */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂｼ >			 */
										/* < ｼｮｳｻｲ ｺｰﾄﾞ   >			 */
#define  MORESTMB  (UCHR *)"SO37"       /* ﾐｼﾞﾕｼﾝ ﾉ ﾒﾂｾ-ｼﾞ ﾋﾖｳｼﾞCK   */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂ ﾒｲ >		 */
										/* < MK    ｺｰﾄﾞ   >			 */
										/* < ﾒｯｾｰｼﾞ ﾎﾝﾀｲ  >			 */
#define  MOPRCTRM  (UCHR *)"SO38"       /* ﾌﾟﾛｾｽ ﾉ ｼﾕｳﾘﾖｳ       CK   */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂ ﾒｲ >		 */
										/* < ｼｭｳﾘｮｳ ｺｰﾄﾞ  >			 */
										/* < ｼｮｳｻｲ ｼﾞｮｳﾎｳ >			 */
#define  MOMAXOPE  (UCHR *)"SO39"       /* ｵﾍﾟﾗﾝﾄﾞ ｶﾞ 30 ｵ ｺｴﾀ  CK   */
#define  MOMAXCMD  (UCHR *)"SO40"       /* ｺﾏﾝﾄﾞﾓｼﾞ ｶﾞ 8 ｵ ｺｴﾀ  CK   */
#define  MODRIVPC  (UCHR *)"SO41"       /* ｶﾞｲﾄｳﾌﾟﾛｾｽ ｷﾄﾞｳﾁﾕｳ   CK   */
#define  MONGPINF  (UCHR *)"SO42"       /* ﾌﾟﾛｾｽｾｲｾｲｼﾞﾖｳﾎｳ NG   CK   */
#define  MOALLXPN  (UCHR *)"SO43"       /* ﾌﾟﾛｾｽﾒｲ ｾﾂﾃｲ ﾌﾉｳ     CK   */
#define  MOIRRCMT  (UCHR *)"SO44"       /* CMT ﾉ ｷﾄﾞｳｼﾕﾍﾞﾂ NG   CK   */
#define  MONOEXST  (UCHR *)"SO45"       /* ﾃ-ﾌﾞﾙﾆ ﾌﾟﾛｾｽｼｷﾍﾞﾂﾒｲ ﾅｼ CK */
#define  MOSAMPNM  (UCHR *)"SO46"       /* PCT ﾆ ﾌﾟﾛｾｽﾒｲ ｱﾘ     CK   */
#define  MOCREPRO  (UCHR *)"SO47"       /* ﾌﾟﾛｾｽ ｾｲｾｲ ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ  */

/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ｺﾏﾝﾄﾞ ｼﾞｯｺｳ    mo_cmex )                      */
/*********************************************************************/

#define  MOCOMDNG  (UCHR *)"SO48"       /* ｺﾏﾝﾄﾞ ﾌﾄｳ                 */
#define  MONGGRNM  (UCHR *)"SO49"       /* ｸﾞﾙｰﾌﾟ/ｻﾌﾞｸﾞﾙｰﾌﾟ ﾒｲ ｱﾔﾏﾘ  */
										/* < ｸﾞﾙｰﾌﾟ/ｻﾌﾞｸﾞﾙｰﾌﾟﾒｲ  >	 */
#define  MOCREPRE  (UCHR *)"SO50"       /* ﾌﾟﾛｾｽｾｲｾｲ ｼｯﾊﾟｲ           */
#define  MOCONDT   (UCHR *)"SO51"       /* ﾌﾟﾛｾｽ ｼﾞｮｳﾀｲ ﾌﾄｳ          */
										/* < ﾌﾟﾛｾｽ ｼﾞｮｳﾀｲ > 	 	 */
#define  MONOTCHG  (UCHR *)"SO52"       /* ｹｲｷﾘｶｴ ﾌｶ                 */
#define  MONGCRET  (UCHR *)"SO53"       /* ｼﾃｲ ﾌﾟﾛｾｽ ｶﾞ ｽﾃﾞﾆ ｾｲｾｲ ｽﾞﾐ*/
#define  MOCMGSDS  (UCHR *)"SO54"       /* ｸﾞﾙｰﾌﾟ/ｻﾌﾞｸﾞﾙｰﾌﾟ ｲﾁﾗﾝ     */
										/* < ﾄﾞｳﾒｲ ﾌﾟﾛｾｽ ｽｳ >	 	 */
										/* < ｷﾄﾞｳﾁｭｳ ﾌﾟﾛｾｽ ｽｳ >		 */
										/* < ｷﾄﾞｳ ｾｲｺｳ ﾌﾟﾛｾｽ ｽｳ >    */
										/* < ｷﾄﾞｳ ｼｯﾊﾟｲ ﾌﾟﾛｾｽ ｽｳ >   */
#define  MOALRTRM  (UCHR *)"SO55"       /* ｽﾃﾞﾆ ｼｭｳﾘｮｳ ｼｮﾘ ﾁｭｳ       */
										/* < ﾌﾟﾛｾｽ  ｼｷﾍﾞﾂﾒｲ >	 	 */
 
/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ﾃﾞｨｽﾌﾟﾚｲ ｺﾏﾝﾄﾞ ｼﾞｯｺｳ ｼｮﾘ   mo_cmds )          */
/*********************************************************************/

#define  MOPNMNOT  (UCHR *)"SO56"       /* PCT ﾆ ｶﾞｲﾄｳ ｼｷﾍﾞﾂﾒｲ ｶﾞ ﾅｲ */
#define  MONODISP  (UCHR *)"SO57"       /* ﾋｮｳｼﾞ ﾌﾟﾛｾｽ ﾅｼ            */
#define  MOCMTLHD  (UCHR *)"SO58"       /* ﾋﾖｳｼﾞｼﾖﾘ ﾀｲﾑﾘｽﾄ ﾍﾂﾀﾞ      */
#define  MOCMTLTM  (UCHR *)"SO59"       /* ﾋﾖｳｼﾞｼﾖﾘ ﾀｲﾑﾘｽﾄ ﾀｲﾑ       */
										/* < ﾂｳﾊﾞﾝ >        	 	 */
										/* < ﾄｷｷﾄﾞｳ ｼｷﾍﾞﾂﾒｲ >	 	 */
										/* < ｷﾄﾞｳ ｼﾞｺｸ  ｼﾞ  >	 	 */
										/* < ｷﾄﾞｳ ｼﾞｺｸ  ﾌﾝ  >	 	 */
										/* < ｺﾏﾝﾄﾞ ﾒｲ >     	 	 */
#define  MOCMTLCY  (UCHR *)"SO60"       /* ﾋﾖｳｼﾞｼﾖﾘ ﾀｲﾑﾘｽﾄ ｻｲｸﾙ      */
										/* < ﾂｳﾊﾞﾝ >        	 	 */
										/* < ﾄｷｷﾄﾞｳ ｼｷﾍﾞﾂﾒｲ >	 	 */
										/* < ｶﾝｶｸ ｼﾞｶﾝ >    	 	 */
										/* < ｺﾏﾝﾄﾞ ﾒｲ >     	 	 */
#define  MOCMPLHD  (UCHR *)"SO61"       /* ﾋﾖｳｼﾞｼﾖﾘ ﾌﾟﾛｾｽﾘｽﾄ ﾍﾂﾀﾞ    */
#define  MOCMPLDS  (UCHR *)"SO62"       /* ﾋﾖｳｼﾞｼﾖﾘ ﾌﾟﾛｾｽﾘｽﾄ         */
										/* < ﾂｳﾊﾞﾝ >        	 	 */
										/* < ﾌﾟﾛｾｽ  ｼｷﾍﾞﾂﾒｲ >	 	 */
										/* < ﾌﾟﾛｾｽ  ｼｷﾍﾞﾂｼ  >	 	 */
										/* < ﾌﾟﾛｾｽ ｼﾞｮｳﾀｲ > 	 	 */
										/* < ﾌﾟﾛｸﾞﾗﾑ ﾌｧｲﾙﾒｲ >	 	 */
#define  MOCMPPNM  (UCHR *)"SO63"       /* ﾋﾖｳｼﾞｼﾖﾘ ｼﾃｲﾌﾟﾛｾｽ ﾒｲ      */
										/* < ﾌﾟﾛｾｽ  ｼｷﾍﾞﾂﾒｲ >	 	 */
										/* < ﾌﾟﾛｾｽ ｼﾞｮｳﾀｲ > 	 	 */
#define  MOCMPPID  (UCHR *)"SO64"       /* ﾋﾖｳｼﾞｼﾖﾘ ｼﾃｲﾌﾟﾛｾｽ ID      */
										/* < ﾌﾟﾛｾｽ  ｼｷﾍﾞﾂｼ  >	 	 */
										/* < ﾒｲﾙﾎﾞｯｸｽ ｼｷﾍﾞﾂｼ >	 	 */
#define  MOCMPPPF  (UCHR *)"SO65"       /* ﾋﾖｳｼﾞｼﾖﾘ ｼﾃｲﾌﾟﾛｾｽ ﾌｱｲﾙ ﾒｲ */
										/* < ﾌﾟﾛｸﾞﾗﾑ ﾌｧｲﾙﾒｲ >	 	 */
#define  MOCMPRNO  (UCHR *)"SO66"       /* ﾋｮｳｼﾞｼｮﾘ ﾌﾟﾛｾｽ ﾘｽﾄ ﾌﾟﾛｾｽｽｳ*/
										/* < ｵﾝﾗｲﾝ ﾌﾟﾛｾｽ ｽｳ >	 	 */
										/* < ｷﾄﾞｳ  ﾌﾟﾛｾｽ ｽｳ >	 	 */
#define  MOCMPORG  (UCHR *)"SO67"       /* ﾋｮｳｼﾞｼｮﾘ ｼﾃｲﾌﾟﾛｾｽ ｷﾄﾞｳﾓﾄ  */
										/* < ｷﾄﾞｳﾓﾄ ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ >	 */
										/* < ｷﾄﾞｳﾓﾄ ｹｲｸﾌﾞﾝ >         */
#define  MOCMPORN  (UCHR *)"SO6A"		/* 表示処理 起動元ﾉｰﾄﾞ番号TD01*/
										/* < 起動元ノード番号 >	TD01 */

/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ﾃﾞﾝｹﾞﾝ ｾｲｷﾞｮ ﾀｲﾏ ｼｮﾘ   mo_pwtm )              */
/*********************************************************************/

#define  MONOTMR   (UCHR *)"SO68"       /* ﾀｲﾏ ｶﾞ ｾﾂｿﾞｸ ｻﾚﾃｲﾅｲ       */
#define  MOCMDMD   (UCHR *)"SO69"       /* ﾊﾟﾈﾙ ｶﾞ ｺﾏﾝﾄﾞ ﾓｰﾄﾞ ﾆ ﾅｯﾃｲﾙ*/
#define  MODSABL   (UCHR *)"SO70"       /* ﾊﾟﾈﾙ ﾃﾞ ﾑｺｳ ﾆ ｼﾀ          */
#define  MOTMRERR  (UCHR *)"SO71"       /* ｼﾃｲ ｼﾞｺｸ ｶﾞ ﾌﾄｳ           */
#define  MOTMDISP  (UCHR *)"SO72"       /* ｼﾃｲ ｼﾞｺｸ ｦ ﾋｮｳｼﾞ          */
										/* < ｾｯﾃｲ ｼﾞｺｸ >             */

/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ﾄｷｷﾄﾞｳ ｾｲｷﾞﾖ )                                */
/*********************************************************************/
 
#define  MONGFUNC  (UCHR *)"SO73"       /* ｷﾉｳ ｼﾕﾍﾞﾂ ｶﾞ ﾌﾄｳ          */
#define  MONGTYPE  (UCHR *)"SO74"       /* ｷﾄﾞｳ ｼﾕﾍﾞﾂ ｶﾞ ﾌﾄｳ         */
#define  MOOVRTME  (UCHR *)"SO75"       /* ｷﾄﾞｳ ｼﾞｺｸ ﾉ ｹﾀ ｵ-ﾊﾞ-      */
#define  MONGBICH  (UCHR *)"SO76"       /* ﾊﾞｲﾅﾘ ﾍﾝｶﾝ ｲｼﾞﾖｳ (ｼﾞｺｸ)   */
#define  MOANMACH  (UCHR *)"SO77"       /* ﾀﾞﾄｳｾｲ ﾉ ﾁｴﾂｸ ﾌﾄｳ (ｼﾞｺｸ)  */
#define  MOOVRCMD  (UCHR *)"SO78"       /* ｺﾏﾝﾄﾞ ﾓｼﾞﾚﾂ ｵ-ﾊﾞ-         */
#define  MONVIPSZ  (UCHR *)"SO79"       /* TRT ﾐｼﾖｳ ｺﾍﾞﾂﾌﾞ ﾅｼ        */
#define  MONUSPSZ  (UCHR *)"SO80"       /* TRT ｼﾖｳ ｺﾍﾞﾂﾌﾞ ﾅｼ         */
#define  MODOWTID  (UCHR *)"SO81"       /* ﾄｷｷﾄﾞｳ ｼｷﾍﾞﾂｼ ｶﾞ ｼﾞﾕｳﾌｸ   */
#define  MONGTIME  (UCHR *)"SO82"       /* ﾄｳﾛｸ or ﾍﾝｺｳ ﾌｶﾉｳ         */
#define  MONGTTID  (UCHR *)"SO83"       /* ﾄｷｷﾄﾞｳ ｼｷﾍﾞﾂﾒｲ ﾉ ﾁｴﾂｸ ﾌﾄｳ */
#define  MONGNEMC  (UCHR *)"SO84"       /* ｷﾄﾞｳ ｼﾞｺｸ ﾉ ｽｳｼﾞ ﾁｴﾂｸ ﾌﾄｳ */

/*********************************************************************/
/*	メッセージ番号　(inits,inite,initr関連)							 */
/*********************************************************************/
#define	 MOARYINI  (UCHR *)"SOC1"		/* 既に処理中			TD56 */
#define  MOMMBEND  (UCHR *)"SOC2"		/* ﾒﾝﾃﾅﾝｽｶｰﾈﾙが起動中以外TD56*/
#define  MOINIYET  (UCHR *)"SOC3"		/* INIT_Sｺﾏﾝﾄﾞ未受		TD56 */

/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ｼｭｳﾘｮｳ ｼｮﾘ )       	                         */
/*********************************************************************/
 
#define  MOTRMINF  (UCHR *)"SO90"       /* ｼｭｳﾘｮｳ ｼﾞｮｳﾎｳ ﾋｮｳｼﾞ       */
										/* < ｼｭｳﾘｮｳ ｼﾞｮｳﾎｳ 0 >       */
										/* < ｼｭｳﾘｮｳ ｼﾞｮｳﾎｳ 1 >       */
										/* < ｼｭｳﾘｮｳ ｼﾞｮｳﾎｳ 2 >       */
										/* < ｼｭｳﾘｮｳ ｼﾞｮｳﾎｳ 3 >       */
#define  MOETYPNG  (UCHR *)"SO91"       /* ｼｭｳﾘｮｳ ｼｭﾍﾞﾂ ﾌﾄｳ          */
#define  MOALREDY  (UCHR *)"SO92"       /* ｽﾃﾞﾆ ｼｭｳﾘｮｳ ｼｮﾘﾁｭｳ        */
 
/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ﾒｯｾｰｼﾞ ｼｭﾂﾘｮｸ ｼｮﾘ )                           */
/*********************************************************************/
 
#define  MOWTOPNG  (UCHR *)"SO93"       /* ms_wtop ｼｯﾊﾟｲ             */
										/* < ﾒｯｾｰｼﾞ ﾊﾞﾝｺﾞｳ >		 */
#define  MOARGCNG  (UCHR *)"SO94"       /* ﾊﾟﾗﾒﾀ ﾉ ｺｽｳ ﾌﾄｳ           */
										/* < ﾊﾟﾗﾒﾀ ｺｽｳ >    		 */
#define  MOMSGIDX  (UCHR *)"SO95"       /* ﾒｯｾｰｼﾞ ﾊﾞﾝｺﾞｳ ﾌﾄｳ         */
										/* < ﾒｯｾｰｼﾞ ﾊﾞﾝｺﾞｳ >		 */
 
/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( AP ﾌﾞﾝｻﾝ          )                           */
/*********************************************************************/
 
#define  MOPUNONG  (UCHR *)"SOA0"       /* pu ﾊﾞﾝｺﾞｳ ﾌﾄｳ             */
#define  MONOTSMP  (UCHR *)"SOA1"       /* pu ﾊﾞﾝｺﾞｳ smp ﾊｲｶ ﾃﾞ ﾅｲ   */
#define  MOCRPRNG  (UCHR *)"SOA2"       /* ﾌﾟﾛｾｽ ｾｲｾｲ ｼｯﾊﾟｲ          */
										/* < oscrepr ﾍﾝｷｬｸﾁ >		 */
#define  MOPUINF   (UCHR *)"SOA3"       /* ﾌﾟﾛｾｽ ID ﾋｮｳｼﾞ            */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂｼ >  		 */
#define  MONGCRNO  (UCHR *)"SOA4"       /* ｷﾄﾞｳ ｽｳ ﾌﾄｳ               */
#define  MONGPRNO  (UCHR *)"SOA5"       /* ｵﾝ ﾗｲﾝ ﾌﾟﾛｾｽ ﾆ ｱﾗｽﾞ       */
#define  MONGGTBF  (UCHR *)"SOA6"       /* ﾊﾞｯﾌｧ ｶｸﾎ ｼｯﾊﾟｲ           */
#define  MONGMPR   (UCHR *)"SOA7"       /* ﾌﾟﾛｾｽ ｲｯｶﾂ ｾｲｾｲ ｼｯﾊﾟｲ     */
										/* < oscrempr ﾉ ﾍﾝｷｬｸﾁ >     */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂ ﾒｲ>		 */
#define  MODRVMPR  (UCHR *)"SOA8"       /* ﾌﾟﾛｾｽ ﾊ ｽﾃﾞﾆ ｷﾄﾞｳ ﾁｭｳ     */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂ ﾒｲ>		 */
#define  MONGMCR   (UCHR *)"SOA9"       /* ﾌﾟﾛｾｽ ｲｯｶﾂ ｾｲｾｲ ｼｯﾊﾟｲ     */
										/* < ﾌﾟﾛｾｽ ｼｷﾍﾞﾂ ﾒｲ>		 */
#define  MONGSYS   (UCHR *)"SOAA"       /* ﾌﾟﾛｾｽ ｲｯｶﾂ ｾｲｾｲ ｼｯﾊﾟｲ     */
										/* < oscrempr ﾉ ﾍﾝｷｬｸﾁ >     */
#define  MOUMFNM   (UCHR *)"SOAB"       /* ﾌｧｲﾙ ﾒｲ ﾌｲｯﾁ              */
#define  MOSYSTEM  (UCHR *)"SOAC"       /* ｼｽﾃﾑ ｺｰﾙ ｴﾗｰ              */
										/* < ｼｽﾃﾑｺｰﾙ  ﾉ ﾅﾏｴ    >     */
										/* < ｼｽﾃﾑｺｰﾙ  ﾉ ﾍﾝｷｬｸﾁ >     */
#define  MONOTCPR  (UCHR *)"SOAD"       /* TC ﾌﾟﾛｾｽ ﾅｼ               */
#define  MOCOMAND  (UCHR *)"SOAE"       /* ｺﾏﾝﾄﾞ ｼｭﾂﾘｮｸ              */
#define  MONOGRPR  (UCHR *)"SOAF"       /* ｸﾞﾙｰﾌﾟ ｲｯｶﾂ ｷﾄﾞｳ ﾌﾟﾛｾｽ ﾅｼ */
 
/*********************************************************************/
/*    ﾒﾂｾ-ｼﾞ ﾊﾞﾝｺﾞｳ  ( ﾃｰﾌﾞﾙ / ﾛｰﾄﾞ < ｶｲｼ / ｻｲｶｲｼ > )                */
/*********************************************************************/
 
#define  MOTLDERR  (UCHR *)"SOB1"       /* ﾌｧｲﾙ I/O ｴﾗｰ              */
 										/* < ﾌｧｲﾙ ｼﾞｮｳﾀｲ , ｾｲ >      */
 										/* < ﾌｧｲﾙ ｼﾞｮｳﾀｲ , ﾌｸ >      */
#define  MOTLDELG  (UCHR *)"SOB2"       /* ﾌｧｲﾙ I/O ｴﾗｰ              */
 										/* < ﾌｧｲﾙ ｼﾞｮｳﾀｲ , ｾｲ >      */
 										/* < ﾌｧｲﾙ ｼﾞｮｳﾀｲ , ﾌｸ >      */
 										/* < ｼｽﾃﾑ ｺｰﾙ ﾉ ﾍﾝｷｬｸﾁ>      */
#define  MOIPUNO   (UCHR *)"SOB3"       /* ｸﾞﾙｰﾌﾟ ｲｯｶﾂ ｷﾄﾞｳ pu=0     */
#define  MOHOTCHG  (UCHR *)"SOB4"       /* ﾎｯﾄｽﾀﾝﾊﾞｲ ﾃﾞ SYSTEM CHANGE*/
#define  MOMNSBTSV (UCHR *)"SOB5"       /* ﾃｰﾌﾞﾙ ｾｰﾌﾞ ﾘｮｳｹｲ ｾｲｼﾞｮｳ   */
#define  MOMAINTSV (UCHR *)"SOB6"       /* ﾃｰﾌﾞﾙ ｾｰﾌﾞ ｾｲｹｲ ﾉﾐ ｾｲｼﾞｮｳ */
#define  MOSUBTSV  (UCHR *)"SOB7"       /* ﾃｰﾌﾞﾙ ｾｰﾌﾞ ﾌｸｹｲ ﾉﾐ ｾｲｼﾞｮｳ */
#define  MONOTTSV  (UCHR *)"SOB8"       /* ﾃｰﾌﾞﾙ ｾｰﾌﾞ ﾘｮｳｹｲ ｲｼﾞｮｳ    */

/*********************************************************************/
/*    メッセージＩＤ　（ ＵＰＳ対応機能 ）							 */
/*********************************************************************/
#define  MOUPS     (UCHR *)"SOD4"       /* 停電状態発生		　   M01 */
#define  MOCHGK    (UCHR *)"SOD5"       /* 系切り替え発生   SSCY0117 */

#define	 MOALTDWN  (UCHR *)"SOD6"		/* 他系ダウン実行	ST3951	 */

#define  MOACCERR  (UCHR *)"SOD7"		/* ＡＣＣ故障		SSCY0152 */
#define  MOCHGEND  (UCHR *)"SOE2"       /* 系切り替え終了   				PRC-000-00 */

/*-- stST4008 -------------------------------------------------------*/
/*********************************************************************/
/*    メッセージＩＤ　（ 装置間バスリセット機能 ）					 */
/*********************************************************************/
#define  MOSBRST   (UCHR *)"SOD8"		/* バスリセット成功			 */
#define  MOEBRST   (UCHR *)"SOD9"		/* バスリセット失敗			 */
#define  MOEBFIO   (UCHR *)"SODA"		/* ファイルアクセスエラー	 */

/*********************************************************************/
/*    メッセージＩＤ　（システムファイル記述エラー)					 */
/*********************************************************************/
#define  MOSYSFE   (UCHR *)"SODB"		/* システムファイル記述エラー */
/*-- edST4008 -------------------------------------------------------*/


#define  MORTMAK   (UCHR *)"SODC"		/* 障害通知端子メイク発生	 */
										/* SPCY0150					 */

/*********************************************************************/
/*		システムコールエラー										 */
/*********************************************************************/
#define  MOSYCER   (UCHR *)"SOE3"		/* システムコール異常				PRC-000-00 */		 
