/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ﾍﾝｷｬｸﾁ､ ﾋｷｽｳ ﾃｲｷﾞ ﾌｧｲﾙ (mr.h)								 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ｼﾞｬｰﾅﾙ ｼｭﾄｸ													 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ					 					 */
/*		ｻｸｾｲ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ										 */
/*		ﾍﾝｺｳ ｼｬ : ｽｽﾞｷ ｵｻﾑ				'87/10/01		(L01)		 */
/*			 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｺｳﾓｸ ﾉ ｻｸｼﾞｮ)				---STC395	 */
/*		ﾍﾝｺｳｼｬ	: ﾅｶﾞﾀ ﾀｹｼ 				'88/08/09 		(L02)		 */
/*			 (ﾊﾞｯｸｱｯﾌﾟｼﾞｬ-ﾅﾙ ﾉ ﾏｳﾝﾄ ｷﾉｳ ﾂｲｶ)			---TC1568	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/10/08 		(L03)		 */
/*				 (ｼﾞｬｰﾅﾙ ﾘｰﾄﾞ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) 		---TC1230	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'89/02/17 		(L04)		 */
/*			 (ﾊﾞｯｸｱｯﾌﾟ ﾐｶﾝﾘｮｳ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾂｲｶ)		---TC2310	 */
/*      変更者 : 山下　元                93/11/12        TD-00       */
/*			 (他ＴＣ動作監視に伴う変更)					 TD-01		 */
/*			 (ホットスタンバイ変更に伴う変更)			 TD-02		 */
/*			 (二重化ﾌｧｲﾙ削除に伴う削除)					 TD-27		 */
/*			 (AJの廃止に伴う削除)						 TD-41		 */
/*           (ＳＣＳＩリセット機能変更に伴う変更)        TD-61		 */
/*			 (ＪＮＬ／ＲＢＩの初期化に伴う変更)			 TD-79		 */
/*           (ＫＪ単独バックアップに伴う変更)			 TD-83		 */
/*		変更者 : 今井  弘幸				94/10/07		CT0592		 */
/*			 (mr_earqの返却値追加に伴う変更)						 */
/*		変更者 : 山本　智也				95/03/15		 M07		 */
/*		 (mr_errq追加に伴う返却値追加 仕様変更要求書 SSCY0025)		 */
/*		 (mr_evrq追加に伴う返却値追加 仕様変更要求書 SSCY0037)		 */
/*		変更者 : 今井　弘幸				95/03/28	  CT0976(ST2645) */
/*		（2重故障時面切替機能追加に伴う変更 仕様変更要求書 SSCYXXXX）*/
/*		変更者 : 宮脇　伸				95/04/26	    SM20		 */
/*		（ACCﾄﾞﾗｲﾌﾞ閉塞機能追加に伴う変更 仕様変更要求書 SSCY0020）  */
/*		変更者 : 杉岡  克也				96/02/07	---	ST3699		 */
/*			(ﾎﾂﾄｽﾀﾝﾊﾞｲ予備系mr_jopn失敗時対処)						 */
/*		変更者 : Supply  朱				2003/07/08	---	SSLA0038	 */
/*			(返却値に「テーブルリカバリ処理実施(MRNORRCV)」を追加)	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*	ﾍﾝｷｬｸﾁ															 */
/*********************************************************************/
#define MRNORMAL	0L		/*	ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ						 */
#define MRNORMX		1L		/*	ｼﾞｮｳｹﾝﾂｷ ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ				 */
#define MREOF		-2L		/*	ﾃﾞｰﾀ ﾉ ｵﾜﾘ							 */
#define MRJNLERR	-3L		/*	ｲｯﾊﾟﾝﾃｷ ｲｼﾞｮｳ ｼｭｳﾘｮｳ				 */
#define MRALOPEN	-4L		/*	ｽﾃﾞﾆ ｵｰﾌﾟﾝ ｽﾞﾐ						 */
#define MRNOEXST	-5L		/*	ﾌｧｲﾙ ｶﾞ ｿﾝｻﾞｲ ｼﾅｲ					 */
#define MRMNTERR	-6L		/*	ﾏｳﾝﾄ ｴﾗｰ							 */
#define MRNOOPEN	-7L		/*	ﾌｧｲﾙ ﾐｵｰﾌﾟﾝ							 */
#define MRIVPARM	-8L		/*	ﾊﾟﾗﾒｰﾀ ｴﾗｰ							 */
#define MRTBLERR	-9L		/*	ﾋﾂﾖｳﾅﾃｰﾌﾞﾙ ｶﾞ ﾅｲ, 2ｼﾞｭｳﾃｰﾌﾞﾙ ｶﾞ ｱﾙ	 */
#define MRNOMNT		-10L	/*	ｶﾞｲﾄｳ ﾌｧｲﾙ ﾖｳ ﾛﾝﾘﾎﾞﾘｭｰﾑ ﾐﾏｳﾝﾄ 		 */
#define MRNOMEM		-11L	/*	ﾒﾓﾘ ﾌﾞｿｸ							 */
#define MRMODEERR	-12L	/*	ｵｰﾌﾟﾝ ﾓｰﾄﾞ ｴﾗｰ						 */
#define MRENQERR	-13L	/*	ｼﾞｬｰﾅﾙ ｼｹﾞﾝ ｾﾝﾕｳ ｴﾗｰ				 */
#define MRNOFILE	-14L	/*	ﾌｧｲﾙ ｶﾞ ﾅｲ							 */
#define MRFILERR	-15L	/*	ﾌｧｲﾙ ｱｸｾｽ ｴﾗｰ						 */
#define MRDUPLI		-16L	/*	ﾆｼﾞｭｳﾊｯｺｳ ｴﾗｰ						 */
#define MRJOPERR	-19L	/*	ｼﾞｬｰﾅﾙ ﾐｵｰﾌﾟﾝﾃﾞｱﾙ					 */
#define MRETERM		-21L	/*	ｼｽﾃﾑ ｼｭｳﾘｮｳﾁｭｳ						 */
#define MRRESTART	-22L	/*	ｼｽﾃﾑ ﾘｽﾀ-ﾄ ｼｭｳﾘｮｳ					 */
#define MRSTOP		-23L	/*	ｼｽﾃﾑ ｽﾄｯﾌﾟ ｼｭｳﾘｮｳ					 */
#define MRTRANERR	-24L	/*	ﾄﾗﾝｻﾞｸｼｮﾝ ﾅｲ ﾉ ｼｮﾘ ｶﾞ ﾌﾄｳ ﾃﾞｱﾙ		 */
#define MRUNMAT		-25L	/*	ﾎﾞﾘｭｰﾑ ｼｷﾍﾞﾂﾒｲ ﾉ ﾌｲｯﾁ				 */
#define MRNOBKUP	-26L	/*	ﾊﾞｯｸ ｱｯﾌﾟ ﾌﾖｳ ｼｽﾃﾑ					 */
#define MRACCUSE	-27L	/*  ｵ-ﾄﾁｪﾝｼﾞｬ- ｻｲﾀﾞｲｽｳ ﾏｳﾝﾄ ｽﾞﾐ	   (L02) */
#define MRVOLBUSY   -28L    /*  ｼﾞ(ﾀ) ﾌﾟﾛｾｽ ﾃﾞ ｼﾖｳﾁｭｳ		   (L02) */
#define MRJDTERR    -29L    /*  ｼﾞｬｰﾅﾙ ﾃﾞｰﾀ ｴﾗｰ                (L03) */
#define MRONBKUP    -30L    /*  ﾊﾞｯｸ ｱｯﾌﾟ ﾁｭｳ ﾃﾞ ｱﾙ			   (L04) */
#define	MRESCON		-31L	/*  システム構成エラー			  (TD02) */
#define	MRDEQERR	-32L	/*	資源占有解除ｴﾗｰ					TD78 */
#define	MRJRIMPC	-33L	/*	ＪＮＬ・ＲＢＩ切替不可		　(TD79) */		
#define	MRJRDUSEC	-34L	/*  ＪＮＬ・ＲＢＩ切替不要		  (TD79) */
#define	MRDHCKERR	-35L	/*	タイムアウトではない		  (TD61) */
#define	MRMRHNRN	-36L	/*	故障管理プロセス状態エラー	  (TD79) */
#define	MRRNMDERR	-37L	/*	ＳＭＰ運転モードエラー		  (TD01) */
#define	MRNORCV		-38L	/*  リカバリ不要システム		  (TD79) */
#define MRVBGTERR	-39L	/*	ﾊﾞｯｸｱｯﾌﾟ失敗論理ﾎﾞﾘｭｰﾑである  (TD61) */
#define	MRBKIDERR	-40L	/*  指定ﾊﾞｯｸｱｯﾌﾟID異常			  (TD83) */
#define	MRINTRBI	-41L	/*  RBI初期化中			  		  CT0592 */
#define	MRINTJNL	-42L	/*  JNL初期化中			  		  CT0592 */
#define	MRINTKJ		-43L	/*  KJ初期化中			  		  CT0592 */
#define	MRRFDWN		-44L	/*  RCVﾌｧｲﾙ故障時ﾀﾞｳﾝｼｽﾃﾑ　			M07	 */
#define	MRPAREN		-45L	/*  両系正常のﾐﾗｰﾎﾞﾘｭｰﾑを指定　		M07	 */
#define	MRJWSSERR	-46L	/*  待機面故障中				  CT0976 */
#define	MRJMAXERR	-47L	/*  ＪＮＬ面構成が不当			  CT0976 */
#define	MRSWHUNEC	-48L	/*  使用面が正常			      CT0976 */
#define	MRIFAERR	-49L	/*  インターフェイスエラー	      SM20   */
#define	MRRJONEC	-50L	/*  ＪＮＬ再オープン要			ST3699	 */

#define MRNULL		0L		/*	NULL								 */

/*********************************************************************/
/*	mr_sdwn ﾉ ｲﾗｲ ｸﾌﾞﾝ												 */
/*********************************************************************/
#define MRIPL		0L
#define MRDOWN		1L
#define MRSTART		2L

/*********************************************************************/
/*	ｼｭｳﾘｮｳ ｺｰﾄﾞ 													 */
/*********************************************************************/
#define MRSDOWN		0x00022340L
#define MRSIPL		0x00022341L
#define MRSSTART	0x00022342L

/*********************************************************************/
/*	ﾄﾗﾝｻﾞｸｼｮﾝ ﾓｰﾄﾞ													 */
/*********************************************************************/
#define MRCRCV		0x00		/*	ﾀﾞﾐｰ ﾊﾟﾗﾒﾀ ﾖｳ  					 */
#define MRNOCRCV	0x01		/*	ﾀﾞﾐｰ ﾊﾟﾗﾒﾀ ﾖｳ  					 */

/*********************************************************************/
/*	mr_jopn ｺﾕｳ ﾉ define ﾁ											 */ 
/*********************************************************************/
#define MRAPMODE	0x00		/*	AP ﾓｰﾄﾞ ｵｰﾌﾟﾝ		 			 */
#define MRRCVMODE	0x01		/*	ﾘｶﾊﾞﾘ ﾓｰﾄﾞ ｵｰﾌﾟﾝ				 */
#define MRBKUPMODE	0x02		/*	ﾊﾞｯｸ ｱｯﾌﾟ ﾓｰﾄﾞ ｵｰﾌﾟﾝ	 		 */

/*********************************************************************/
/*	mr_jnl , mr_jrd ｺﾕｳ ﾉ define ﾁ									 */
/*********************************************************************/
#define MRJASS		0x0000		/*	ｼﾞｭﾝ ﾎｳｺｳ ﾉ ﾖﾐｺﾐ				 */
#define MRJDIS		0x0001		/*	ｷﾞｬｸ ﾎｳｺｳ ﾉ ﾖﾐｺﾐ				 */
#define MRJONST		0x00FE		/*	ｵﾝﾗｲﾝ ｶｲｼ ｼﾞｬｰﾅﾙ				 */
#define MRJONEN		0x00FF		/*	ｵﾝﾗｲﾝ ｼｭｳﾘｮｳ ｼﾞｬｰﾅﾙ				 */
#define MRJINIT		0x00FC		/*	ｼｮｷ ｼﾞｬｰﾅﾙ						 */
#define MRJALEN		0x00FD		/*	ｳﾝﾃﾝ ｼｭｳﾘｮｳ ｼﾞｬｰﾅﾙ				 */
#define MRJNORM		0x0000		/*	AP ｼｭﾄｸ ｼﾞｬｰﾅﾙ					 */
#define MRJSMPJ		0x0001		/*	SMP ｼｭﾄｸ ｼﾞｬｰﾅﾙ					 */
#define MRJNOWRT	0x0002		/*	ｼﾞｬｰﾅﾙ ｦ ｼｭﾂﾘｮｸ ｼﾅｲ				 */

/*********************************************************************/
/*	mr_jedt ｺﾕｳ ﾉ define ﾁ											 */
/*********************************************************************/
#define MRFJ		0x4000		/*	ﾌｧｲﾙ ｺｳｼﾝ ｼﾞｬｰﾅﾙ			TD@1 */
#define MRTJ		0x2000		/*	ﾃｰﾌﾞﾙ ｺｳｼﾝ ｼﾞｬｰﾅﾙ			TD@1 */
#define MRKJ		0x1000		/*	ｶﾝｼﾞｮｳ ｼｮｳｺﾞｳ ｼﾞｬｰﾅﾙ		TD@1 */
								/* 不用ﾃﾞﾌｧｲﾝ削除(1行)			TD41 */
#define MRVJ		0x0080		/*	ﾎﾞﾘｭｰﾑ ｼｮｳｶﾞｲ ｼﾞｬｰﾅﾙ		TD@1 */

/*********************************************************************/
/*	mr_jsp ｺﾕｳ ﾉ define ﾁ											 */
/*********************************************************************/
#define MRJTOP		0L			/*	ﾌｧｲﾙ ﾉ ｾﾝﾄｳ ｶﾗ					 */
#define MRJCUR		1L			/*	ﾌｧｲﾙ ﾉ ｹﾞﾝｻﾞｲｲﾁ ｶﾗ				 */
#define MRJLAST		2L			/*	ﾌｧｲﾙ ﾉ ｻｲｺﾞ ｶﾗ					 */

/*********************************************************************/
/*	mr_jclr ｺﾕｳ ﾉ define ﾁ											 */
/*********************************************************************/
#define MRJINDEX	0x00		/*	ｲﾝﾃﾞｯｸｽ ｴﾘｱ ｦ ｸﾘｱ ｽﾙ			 */
#define MRJNOIDX	0x01		/*	ｲﾝﾃﾞｯｸｽ ｴﾘｱ ｦ ｸﾘｱ ｼﾅｲ			 */

/*********************************************************************/
/*	mr_cpca ﾉ ｼｮﾘ ｼｭﾍﾞﾂ												 */
/*********************************************************************/
#define	MRCJNLON	 0L			/*	ｵﾝ ﾆ ｽﾙ							 */
#define	MRCJNLOFF	 1L			/*	ｵﾌ ﾆ ｽﾙ							 */

/*********************************************************************/
/*		mr_prcv ｶﾗ AP ﾚｲｶﾞｲ ｶﾝｽｳ ｦ ﾖﾌﾞﾄｷﾉ ｱﾎﾞｰﾄ ｹﾞﾝｲﾝ ｼｷﾍﾞﾂ			 */
/*********************************************************************/
#define	MRROSABT	 0x01		/*									 */
#define	MRPGMABT	 0x00		/*									 */

/*********************************************************************/
/*		mr_prcv ｶﾗ AP ﾚｲｶﾞｲ ｶﾝｽｳ ｦ ﾖﾌﾞﾄｷﾉ ﾄﾗﾝｻﾞｸｼｮﾝ ｼﾞｮｳﾀｲ			 */
/*********************************************************************/
#define	MRNOTRAN	 0x00		/* ﾄﾗﾝｻﾞｸｼｮﾝ ｶｲｼ ﾏｴ					 */
#define	MRTRANSRT 	 0x01		/* ﾄﾗﾝｻﾞｸｼｮﾝ ｼｮﾘ ﾁｭｳ				 */
#define	MRTRANEND 	 0x02		/* ﾄﾗﾝｻﾞｸｼｮﾝ ｶﾝﾘｮｳ					 */

/*********************************************************************/
/*		mr_ejrq ﾖﾋﾞﾀﾞｼﾓﾄ ｲﾗｲ ｸﾌﾞﾝ ﾉ define							 */
/*********************************************************************/
#define	MREJFIP 	 'F'		/* FIP ｶﾗﾉ ｲﾗｲ						 */

/*********************************************************************/
/*		mr_jdcl ｺﾕｳ ﾉ define ﾁ										 */
/*********************************************************************/
								/* 不用ﾃﾞﾌｧｲﾝ削除(2行)			TD27 */

/*********************************************************************/
/*		mr_vmgt ｺﾕｳ ﾉ define ﾁ										 */
/*********************************************************************/
#define MRVOLERR	 'E'		/* ﾛﾝﾘ ﾎﾞﾘｭｰﾑ ｼｮｳｶﾞｲ ﾁｭｳ			 */
#define MRVOLNOM	 'N'		/* ﾛﾝﾘ ﾎﾞﾘｭｰﾑ ｾｲｼﾞｮｳ				 */

/*********************************************************************/
/*		mr_cerr / mr_earq の依頼区分								 */
/*********************************************************************/
#define	MRCJNLERR	'J'		/* ＪＮＬ２重故障、及び					 */
							/*				ＪＮＬ初期化依頼  (TD79) */
#define	MRCKJERR	'K'		/* ＫＪ２重故障	、及び					 */
							/*				ＫＪ初期化依頼	  (TD79) */
#define	MRCRBIERR	'R'		/* ＲＢＩ２重故障、及び					 */
							/*				ＲＢＩ初期化依頼  (TD79) */
#define	MRCSWH		'S'		/* ＪＮＬ使用面の切替依頼		  CT0976 */

/*********************************************************************/
/*		mr_cerr の処理種別											 */
/*********************************************************************/
#define		MRCJNLKJ	'0'			/* ＪＮＬ及びＫＪ故障	  (TD79) */
#define		MRCRBICM	0			/* ＣＭ用ＲＢＩ故障		  (TD79) */
#define		MRCRBIL0	1			/* ＬＭ０用ＲＢＩ故障	  (TD79) */
#define		MRCRBIL1	2			/* ＬＭ１用ＲＢＩ故障	  (TD79) */

/*********************************************************************/
/*		mr_csrr 固有のdefine値（依頼区分）							 */
/*********************************************************************/
#define		MRCDELAY	'D'			/* ﾘｾｯﾄ不可ﾌﾟﾛｾｽ時		   TD61  */
#define		MRCFILE		'V'			/* ﾌｱｲﾙｱｸｾｽ(非ﾐﾗ-)時   	   TD61  */
#define     MRCMFILE    'M'         /* ﾌｱｲﾙｱｸｾｽ(ﾐﾗ-)時         TD61  */
#define		MRCBKUP		'B'			/* 対象ｴﾝﾄﾘ番号がPBTの時   TD61  */
#define		MRCSCID		'I'			/* 対象装置IDがSURの時     TD61  */
#define		MRCSCC		'C'			/* 対象装置IDがSBRの時     TD61  */

/*********************************************************************/
/*		mr_bbks(ﾊﾞｯｸｱｯﾌﾟ提供関数)固有のdefine値（依頼区分）			 */	
/*********************************************************************/
#define		MRBPJNID	1			/* JNLﾌｧｲﾙのﾊﾞｯｸｱｯﾌﾟID検索 TD83	 */
#define		MRBPCOID	2			/* 一般ﾌｧｲﾙのﾊﾞｯｸｱｯﾌﾟID検索TD83	 */

/*********************************************************************/
/*		mr_accf 固有のdefine値（遷移モード）		 			SM20 */	
/*********************************************************************/
#define		MROUS		0			/* 閉塞	 					SM20 */
#define		MRINS		1			/* 組み込み					SM20 */

/*********************************************************************/
/*		mr_trcv mr_jedt2 のdefine値					 				 */
/*********************************************************************/
#define INFOSIZE     28				/* データレコードサイズ			 */
#define SYSERROR	 -1				/* エラー返却値					 */
#define STATSIZE	 1				/* 故障中のサイズ				 */
#define ENDDPATN	 "RCVE"			/* 先頭パターン					 */
#define STRTPATN	 "RCVS"			/* 終端パターン					 */
#define PATNSIZE	 4				/* パターンサイズ				 */
#define BUDASIZE	 20				/* 引継ぎデータレコードサイズ	 */
#define DATETIME	 8				/* 日付と時刻サイズ				 */
#define STTDATSI	 12				/* 日付、時刻と故障中サイズ		 */
#define ENDONWAY	 'M'			/* 終了途中モード				 */
#define KAISHIKU	 'N'			/* 開始区						 */
#define YOBIDATA	 0x000000		/* 予備							 */
#define MSSGSIZE	 128			/* 送信メッセージサイズ			 */
#define OPENEERR	 "open()"		/* ファイルオープンエラー		 */
#define WRITEERR	 "write()"		/* ファイル書き込みエラー		 */
#define READEERR	 "read()"		/* ファイル読み込みエラー		 */
#define LOCKEERR	 "lockf()"		/* ファイルロックエラー			 */
#define SCALLSIZ	 8				/* システムコール名サイズ		 */
#define READOPTI	 'R'			/* ファイル読み込みエラー		 */
#define WRITOPTI	 'W'			/* ファイル書き込みエラー		 */
#define OPENOPTI	 'O'			/* ファイルオープンエラー		 */
#define LOCKOPTI	 'L'			/* ファイルロックエラー		 	 */
#define MRNORRCV	 10			/* テーブルリカバリ処理実施	SSLA0038 */
									

