/****************************************************************************/
/*	Ãøºî¸¢¡¡£±£¹£¹£³														*/
/*			¡¡£Î£Ô£Ô¥Ç¡¼¥¿ÄÌ¿®³ô¼°²ñ¼Ò										*/
/*				¶âÍ»¥·¥¹¥Æ¥à»ö¶ÈËÜÉô										*/
/*																			*/
/*																			*/
/*	¼ýÍÆÊª¡¡£Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à¡¡										*/
/*				£Ò£Ã£Ö¡¡¥Ü¥ê¥å¡¼¥à¥ê¥«¥Ð¥ê¡Ê£Æ£ÊÌµ¤·¡Ë	(mr_vxxx·Ï)			*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä					 ¸Î¾ã²óÉü¶ÈÌ³							*/
/*¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä					 £Ò£Ã£Ö									*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä				 										*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜ£É£Ä¡ä				 										*/
/*¡ã¥â¥¸¥å¡¼¥ëÌ¾¡ä					 £Ö£Ò£Ã£Ö¡Ê£Æ£ÊÌµ¤·¡Ë¥Þ¥¯¥íÄêµÁ			*/
/*¡ã¥â¥¸¥å¡¼¥ë£É£Ä¡ä				 										*/
/*¡ã¥â¥¸¥å¡¼¥ëÄÌÈÖ¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ãÅ¬ÍÑµ¡¼ï¡ä						 £Á£Ã£Å									*/
/*¡ãÅ¬ÍÑ£Ï£Ó¡ä						 £Ô£Ò£Á£Ä£Å								*/
/*¡ã³«È¯´Ä¶­¡ä						 £Ó£Õ£Î  £Ó£Ð£Á£Ò£Ã¡Ý£É£Ð£Ø				*/
/*¡ãµ­½Ò¸À¸ì¡ä						 £Ã¸À¸ì									*/
/*¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä				 ´Ø¿ô									*/
/*¡ãµ¡Ç½¶èÊ¬¡ä																*/
/*¡ãÂÐ¾Ý¥Ç¡¼¥¿¡ä															*/
/*¡ã¹©Äø¡¦³¬ÁØ¶èÊ¬¡ä				 										*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä				 £Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à					*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä				 £µ£·£²£¶£°£±£´£°£²£±£°£°				*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯Ã´ÅöÌ¾¡ä					 ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö						*/
/*¡ãÅÅÏÃÈÖ¹æ¡ä						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*¡ãÀß·×¼ÔÌ¾¡ä						 ¼Æºê¡¡ÃÒ»Ò								*/
/*¡ãÀß·×Ç¯·îÆü¡ä					 £±£¹£¹£´Ç¯£°£¶·î£°£±Æü					*/
/*--------------------------------------------------------------------------*/
/*¡ã¥½¡¼¥¹ºîÀ®¼ÔÌ¾¡ä				 ¼Æºê¡¡ÃÒ»Ò								*/
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				 £±£¹£¹£´Ç¯£±£°·î£°£µÆü					*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				 º£°æ¡¡¹°¹¬						 CT0705 */
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				 £±£¹£¹£´Ç¯£±£²·î£±£¹Æü					*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				 ¼Æºê¡¡ÃÒ»Ò				CT1093(ST2995)	*/
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				 £±£¹£¹£µÇ¯¡¡£··î£±£´Æü					*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				 ¼Æºê¡¡ÃÒ»Ò								*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä	 £±£¹£¹£µÇ¯¡¡£··î£±£·Æü	ST2893			*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				 ¼Æºê¡¡ÃÒ»Ò								*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä	 £±£¹£¹£µÇ¯¡¡£··î£²£°Æü	CT1094(ST2996)	*/
/*--------------------------------------------------------------------------*/
/*¡ã¸«ÀÑ¥¹¥Æ¥Ã¥×¿ô¡ä				 ¡©¡©¡©¥¹¥Æ¥Ã¥×							*/
/*--------------------------------------------------------------------------*/
/*¡ãµ¡Ç½³µÍ×¡ä																*/
/*		£Ö£Ò£Ã£Ö¡Ê£Æ£ÊÌµ¤·¡Ë¥×¥í¥»¥¹Æâ¤Ç»ÈÍÑ¤¹¤ëÄê¿ô¤ÎÄêµÁ					*/
/*		£Ö£Ò£Ã£Ö¡Ê£Æ£ÊÌµ¤·¡Ë¥×¥í¥»¥¹Æâ¤Ç»ÈÍÑ¤¹¤ë¥Þ¥¯¥í¤ÎÄêµÁ				*/
/*--------------------------------------------------------------------------*/
/*¡ã¸Æ½Ð·Á¼°¡ä																*/
/*																			*/
/*¡ã²¾°ú¤­¿ô¡ä																*/
/*																			*/
/*¡ãÊÖµÑÃÍ¡ä   																*/
/*--------------------------------------------------------------------------*/
/*¡ãÆþ½ÐÎÏ¥Ç¡¼¥¿¹½Â¤¡ä														*/
/*																			*/
/*¡ãÀ©¸Â»ö¹à¡ä																*/
/*	  ÆÃ¤Ë¤Ê¤·																*/
/*																			*/
/*¡ã»ÈÍÑ³°Éô¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*																			*/
/*¡ã¸Æ½Ð¸µ¤Î¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*																			*/
/****************************************************************************/

/****************************************/
/*	Äê¿ô								*/
/****************************************/
#define	LNULL		(long *)0L
#define	CNULL		(char *)0L

#define	MRVON		1
#define	MRVOFF		0

#define	MRVLOG		pscparea.pscobsad	/* ¾ã³²²òÀÏ¾ðÊó¥¨¥ê¥¢¥¢¥É¥ì¥¹CT0705	*/
#define	MRVRTRY		mopcbp->mopscstp->tcstrtry
										/* ¥Õ¥¡¥¤¥ë¥¢¥¯¥»¥¹¥ê¥È¥é¥¤²ó¿ô		*/

/****************************************/
/*	´ØÏ¢¥×¥í¥»¥¹¥×¥í¥°¥é¥à¼ïÊÌ			*/
/****************************************/
#define	MRVMRIT		"C6"				/* ŽØŽ¶ŽÊŽÞŽØŽÌŽ§Ž²ŽÙÁÏÀ®ŽÌŽßŽÛŽ¾Ž½ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ¼ïÊÌ	*/
#define	MRVMRCT		"C5"				/* ŽÎŽÞŽØŽ­Ž°ŽÑŽºŽËŽßŽ°ŽÌŽßŽÛŽ¾Ž½ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ¼ïÊÌ		*/
#define	MRVMRKT		"DE"				/* Ž»ŽÌŽÞ¸Î¾ã´ÉÍýŽÌŽßŽÛŽ¾Ž½ŽÌŽßŽÛŽ¸ŽÞŽ×ŽÑ¼ïÊÌ		*/

/****************************************/
/*	ÎÎ°èÄ¹ÄêµÁ							*/
/****************************************/
#define	MRVNDIRL	16					/* ¥Í¥Ã¥È¥ï¡¼¥¯¥Ç¥£¥ì¥¯¥È¥êÌ¾Ä¹		*/
#define	MRVLVSNL	16					/* ÆÃ¼ìÁõÃÖ¥Õ¥¡¥¤¥ëÌ¾Ä¹				*/
#define	MRVMTDRL	16					/* ŽÏŽ³ŽÝŽÄÀèŽÌŽÞŽÛŽ¯Ž¸ÆÃ¼ìŽÌŽ§Ž²ŽÙÌ¾Ä¹			*/
#define	MRVGPDRL	16					/* ¥°¥ë¡¼¥×¥Ç¥£¥ì¥¯¥È¥êÌ¾Ä¹			*/
#define	MRVSGDRL	16					/* ¥µ¥Ö¥°¥ë¡¼¥×¥Ç¥£¥ì¥¯¥È¥êÌ¾Ä¹		*/
#define	MRVFLNML	16					/* ¥Õ¥¡¥¤¥ëÌ¾Ä¹						*/

#define	MRVSNMLN	MRVNDIRL+MRVLVSNL	/* ÆÃ¼ìÁõÃÖ¥Õ¥¡¥¤¥ë¥Ñ¥¹Ì¾Ä¹			*/
#define	MRVMNMLN	MRVNDIRL+MRVMTDRL	/* ¥Þ¥¦¥ó¥ÈÀè¥Ç¥£¥ì¥¯¥È¥êÌ¾Ä¹		*/
#define	MRVDNMLN	MRVMNMLN+MRVGPDRL+MRVSGDRL
										/* ¥Ç¥£¥ì¥¯¥È¥ê¥Ñ¥¹Ì¾Ä¹				*/
#define	MRVFNMLN	MRVDNMLN+MRVFLNML	/* ¥Õ¥¡¥¤¥ë¥Ñ¥¹Ì¾Ä¹					*/

#define	MRVCBFL		4096L				/* ŽÐŽ×Ž°volÉüµì»þŽºŽËŽßŽ°ŽÊŽÞŽ¯ŽÌŽ§°èŽ»Ž²Ž½ŽÞ		*/

/****************************************/
/*	¥Õ¥¡¥¤¥ëÀ¸À®¥â¡¼¥É					*/
/****************************************/
#define	MRVCMOD		OSFFCNTN	|		/* Ï¢Â³ÎÎ°è³ÎÊÝ						*/\
					OSFFRDAWT	|		/* read_after_write¥Á¥§¥Ã¥¯¼Â¹Ô		*/\
					OSFFCLEAR	|		/* ÎÎ°è½é´ü²½						*/\
					OSFAOEXL	|		/* ÇÓÂ¾À©¸æ¸¢(½êÍ­¼Ô)				*/\
					OSFAOCHG	|		/* ¥Õ¥¡¥¤¥ëÊÝ¸î¥³¡¼¥ÉÊÑ¹¹¸¢(½êÍ­¼Ô)	*/\
					OSFAOEXC	|		/* ¼Â¹Ô¸¢(½êÍ­¼Ô)					*/\
					OSFAOEXT	|		/* ³ÈÄ¥¸¢(½êÍ­¼Ô)					*/\
					OSFAOWRT	|		/* ½ñ¤­¹þ¤ß¸¢(½êÍ­¼Ô)				*/\
					OSFAORED	|		/* ÆÉ¤ß¹þ¤ß¸¢(½êÍ­¼Ô)				*/\
					OSFAODEL	|		/* ºï½ü¸¢(½êÍ­¼Ô)					*/\
					OSFAGEXL	|		/* ÇÓÂ¾À©¸æ¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)				*/\
					OSFAGCHG	|		/* ¥Õ¥¡¥¤¥ëÊÝ¸î¥³¡¼¥ÉÊÑ¹¹¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)	*/\
					OSFAGEXC	|		/* ¼Â¹Ô¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)					*/\
					OSFAGEXT	|		/* ³ÈÄ¥¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)					*/\
					OSFAGWRT	|		/* ½ñ¤­¹þ¤ß¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)				*/\
					OSFAGRED	|		/* ÆÉ¤ß¹þ¤ß¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)				*/\
					OSFAGDEL	|		/* ºï½ü¸¢(Ž¸ŽÞŽÙŽ°ŽÌŽß)					*/\
					OSFACEXL	|		/* ÇÓÂ¾À©¸æ¸¢(¤½¤ÎÂ¾)				*/\
					OSFACCHG	|		/* ¥Õ¥¡¥¤¥ëÊÝ¸î¥³¡¼¥ÉÊÑ¹¹¸¢(¤½¤ÎÂ¾)	*/\
					OSFACEXC	|		/* ¼Â¹Ô¸¢(¤½¤ÎÂ¾)					*/\
					OSFACEXT	|		/* ³ÈÄ¥¸¢(¤½¤ÎÂ¾)					*/\
					OSFACWRT	|		/* ½ñ¤­¹þ¤ß¸¢(¤½¤ÎÂ¾)				*/\
					OSFACRED	|		/* ÆÉ¤ß¹þ¤ß¸¢(¤½¤ÎÂ¾)				*/\
					OSFACDEL			/* ºï½ü¸¢(¤½¤ÎÂ¾)					*/

/****************************************/
/*	¥Õ¥¡¥¤¥ë¥ª¡¼¥×¥ó¥â¡¼¥É				*/
/****************************************/
#define	MRVOMOD		OSFACEXT	|		/* ³ÈÄ¥¸¢(¤½¤ÎÂ¾)					*/\
					OSFACWRT	|		/* ½ñ¤­¹þ¤ß¸¢(¤½¤ÎÂ¾)				*/\
					OSFACRED	|		/* ÆÉ¤ß¹þ¤ß¸¢(¤½¤ÎÂ¾)				*/\
					OSFACDEL			/* ºï½ü¸¢(¤½¤ÎÂ¾)					*/

#define	MRVEOF		0					/* £Å£Ï£Æ							*/
#define	MRVWVRO		0x14				/* Â¾·Ï¥ï¡¼¥¯¥Õ¥¡¥¤¥ë¥Ü¥ê¥å¡¼¥à		*/

/****************************************/
/*	£Ô£Ö£Í£Ô¡¡¥Ü¥ê¥å¡¼¥àÂ°À­			*/
/****************************************/
#define	MRVVJNL		0x02				/* £Ê£Î£Ì¥Õ¥¡¥¤¥ë¥Ü¥ê¥å¡¼¥à			*/
#define	MRVVRBI		0x01				/* £Ò£Â£É¥Õ¥¡¥¤¥ë¥Ü¥ê¥å¡¼¥à			*/

/****************************************/
/*	£Ó£Í£ÐÇÛ²¼¥Ç¥£¥ì¥¯¥È¥ê³¬ÁØ			*/
/****************************************/
#define	MRVMNTN		1					/* ŽÏŽ³ŽÝŽÄÀèŽÌŽÞŽÛŽ¯Ž¸ÆÃ¼ìÁõÃÖŽÌŽ§Ž²ŽÙÌ¾		*/
#define	MRVGDIR		2					/* ¥°¥ë¡¼¥×¥Ç¥£¥ì¥¯¥È¥êÌ¾			*/
#define	MRVSDIR		3					/* ¥µ¥Ö¥°¥ë¡¼¥×¥Ç¥£¥ì¥¯¥È¥êÌ¾		*/
#define	MRVFILE		4					/* ¥Õ¥¡¥¤¥ëÌ¾						*/

/****************************************/
/*	²óÉü¡¦¥ê¥¹¥È¥¢À©¸æ					*/
/****************************************/
#define	MRVCRNT		mrvpcb.mrvidex		/* Á°½èÍý¡ÁÂÔ¤Á¹ç¤ï¤»½èÍýÃæ¤Î£ö£ï£ì	*/
#define	MRVNEXT		((MRVCRNT+1)%2)		/* ¥Á¥§¥Ã¥¯¡ÁÁ°½èÍýÃæ¤Î£ö£ï£ì		*/
#define	MRVBFOR		((MRVCRNT+1)%2)		/* ÂÔ¤Á¹ç¤ï¤»¡Á¸å½èÍýÃæ¤Î£ö£ï£ì		*/

/****************************************/
/*	£Ó¥È¥ì¡¼¥¹¥í¥°¾ÜºÙ¾ðÊó¡ÊÇ¤°Õ¼èÆÀ¡Ë	*/
/****************************************/
#define	MRVWLG		0x44440000			/* CT1093							*/

/****************************************/
/*	¥Ó¥Ã¥ÈÁàºî¶¦ÄÌ¥Þ¥¯¥í				*/
/****************************************/
#define	MRVLBIT	( sizeof(long) * 8 )
#define	MRVBITON( AREA, ENT )												\
					( *( AREA + ( ENT / MRVLBIT ) )							\
					|= ( (unsigned long)0x80000000 >> ( ENT % MRVLBIT ) ) )
#define	MRVBITCK( AREA, ENT )												\
				( 0L != ( *( AREA + ( ENT / MRVLBIT ) )						\
				& ( (unsigned long)0x80000000 >> ( ENT % MRVLBIT ) ) ) ?	\
				MRVON : MRVOFF )

/****************************************/
/*	£Ö£Í£Ô½èÍý¥Õ¥é¥°¡¡¥Þ¥¯¥í			*/
/****************************************/
#define	MRVVMTFON( VMTE )	MRVBITON( mrvpcb.mrvvmtf, VMTE )

#define	MRVVMTFCK( VMTE )	MRVBITCK( mrvpcb.mrvvmtf, VMTE )

/****************************************/
/*	¥¨¥é¡¼È¯À¸»þ¥Þ¥¯¥í					*/
/****************************************/
#define	MF_FIOC( CODE )		mf_fioc( CODE, ' ' );

#define	MRVSABT( CODE, DTL1, DTL2, DTL3 )									\
{	mrvpcb.mrvdtl1 = ( (short)0 == mrvpcb.mrvmdid ? DTL1 : mrvpcb.mrvdtl1 );\
	mrvpcb.mrvdtl2 = ( (short)0 == mrvpcb.mrvmdid ? DTL2 : mrvpcb.mrvdtl2 );\
	mrvpcb.mrvdtl3 = ( (short)0 == mrvpcb.mrvmdid ? DTL3 : mrvpcb.mrvdtl3 );\
	mrvpcb.mrvmdid = ( (short)0 == mrvpcb.mrvmdid ? CODE : mrvpcb.mrvmdid );\
}

/****************************************/
/*	¥Ü¥ê¥å¡¼¥à¥¢¥ó¥Þ¥¦¥ó¥È				*/
/****************************************/
										/* £ï£ó£õ£í£ï£õ£î£ôÈ¯¹Ô				*/
#define	mr_vumt( MNTN )		mr_vumc( MNTN, 0 )
										/* £ï£ó£õ£í£ï£õ£î£ô£æÈ¯¹Ô			*/
#define	mr_vumf( MNTN )		mr_vumc( MNTN, 1 )

/****************************************/
/*	¥í¥°¼èÆÀÎÎ°èÄ¹Ä´À°					*/
/****************************************/
										/* CT1093							*/
#define	MRVSIZE( STR )		( ( ( mr_vsiz( STR ) / sizeof( long ) ) + 1 ) * 4 )

/****************************************/
/*	²óÉü·ë²ÌÀßÄê						*/
/****************************************/
										/* CT1094							*/
#define	MR_VVRC( AREA, CODE )	AREA = ( AREA == MRVVERR ? AREA : CODE )

/****************************************/
/*	I/OŽ´Ž×Ž°È¯À¸½èÍý¼ïÊÌÀßÄê				*/
/****************************************/
										/* ST2893							*/
#define	MR_VSYS( AREA, CODE )	 AREA = ( AREA != 0 ? AREA : CODE )

/****************************************/
/*	£É¡¿£Ï¥¨¥é¡¼È¯À¸½èÍý¼ïÊÌ			*/
/****************************************/
#define	MRVCLOSE	(unsigned char)0x01	/* £ï£ó£ã£ì£ï£ó£å			ST2893	*/
#define	MRVCONN		(unsigned char)0x02	/* £ï£ó£ã£ï£î£î				ST2893	*/
#define	MRVCREAT	(unsigned char)0x03	/* £ï£ó£ã£ò£å£á£ô			ST2893	*/
#define	MRVDCONN	(unsigned char)0x04	/* £ï£ó£ä£ã£ï£î£î			ST2893	*/
#define	MRVDELET	(unsigned char)0x05	/* £ï£ó£ä£å£ì£å£ô			ST2893	*/
#define	MRVEXTEN	(unsigned char)0x06	/* £ï£ó£å£ø£ô£å£î			ST2893	*/
#define	MRVMOUNT	(unsigned char)0x07	/* £ï£ó£í£ï£õ£î£ô			ST2893	*/
#define	MRVOPEN		(unsigned char)0x08	/* £ï£ó£ï£ð£å£î				ST2893	*/
#define	MRVTRUNC	(unsigned char)0x09	/* £ï£ó£ô£ò£õ£î£ã			ST2893	*/
#define	MRVUMOUNT	(unsigned char)0x0A	/* £ï£ó£õ£í£ï£õ£î£ô			ST2893	*/
#define	MRVUMOUNTF	(unsigned char)0x0B	/* £ï£ó£õ£í£ï£õ£î£ô£æ		ST2893	*/
#define	MRVREAD		(unsigned char)0x0C	/* £ï£ó£ò£å£á£ä				ST2893	*/
#define	MRVSEEK		(unsigned char)0x0D	/* £ï£ó£ó£å£å£ë				ST2893	*/
#define	MRVWRITD	(unsigned char)0x0E	/* £ï£ó£÷£ò£é£ô£ä			ST2893	*/
#define	MRVGFINF	(unsigned char)0x0F	/* £ï£ó£ç£æ£é£î£æ			ST2893	*/
#define	MRVIOCTL	(unsigned char)0x10	/* £ï£ó£é£ï£ã£ô£ì			ST2893	*/
#define	MRVIIOCTL	(unsigned char)0x11	/* £ï£ó£é£é£ï£ã£ô£ì			ST2893	*/
#define	MRVCONFIG	(unsigned char)0x12	/* £ï£ó£ã£ï£î£æ£é£ç			ST2893	*/
#define	MRVVDI		(unsigned char)0x30	/* £ö£ä£é¥³¥Þ¥ó¥É			ST2893	*/
#define	MRVMRC		(unsigned char)0x40	/* ¥Ü¥ê¥å¡¼¥à¥³¥Ô¡¼¥×¥í¥»¥¹	ST2893	*/
#define	MRVMRI		(unsigned char)0x41	/* RCV¥Õ¥¡¥¤¥ëÁÏÀ®¥×¥í¥»¥¹	ST2893	*/

/****************************************/
/*	£É¡¿£Ï¥¨¥é¡¼¾ÜºÙÀßÄê				*/
/****************************************/
										/* ST2893							*/
#define	MR_VECD( AREA, CODE )	 AREA = ( AREA != 0 ? AREA : CODE )
