/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ﾘｶﾊﾞﾘ ｷｮｳﾂｳ ﾃｲｷﾞ ﾌｧｲﾙ (mrcom.h)								 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾘｶﾊﾞﾘ ｾﾞﾝﾊﾟﾝ												 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*		ｻｸｾｲｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ											 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ			'87/10/01	(L01)				 */
/*			 	 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｺｳﾓｸ ﾉ ｻｸｼﾞｮ ﾄ ｿﾚ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ)	 */
/*														--- STC395	 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ			'87/11/01	(L02)				 */
/*			 	 (AP ﾌﾞﾝｻﾝ ﾀｲｵｳ ﾉ ｶｲｿﾞｳ) --- STC448					 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ			'88/06/16	(L03)				 */
/*			 	 (ﾎﾘｭｳ ﾃﾞ-ﾀ ｼｭﾄｸ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) --- TC1350		 */
/*		ﾍﾝｺｳｼｬ : ｳﾁﾀﾞ ﾕｳｽｹ			'88/08/10	(L04)				 */
/*			 	 (ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾂｲｶ   ) --- STC978		 */
/*      変更者 : 佐藤  亘                        TD-00               */
/*                (PUの独立化に伴う変更)         TD-59               */
/*                (SCSIﾘｾﾂﾄ機能の変更に伴う変更) TD-61               */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	MRPCB (ﾌﾟﾛｾｽ ｺﾝﾄﾛｰﾙ ﾃｰﾌﾞﾙ)										 */
/*********************************************************************/
struct mrpcb{
	char	mrpcbid[4];				/* MRPCB ｼｷﾍﾞﾂﾒｲ				 */
	TCOMPAT	*mrptcta;				/* TCT ｱﾄﾞﾚｽ					 */
	TCOMPAT *mrppbta;				/* PBT ｱﾄﾞﾚｽ			(L02)	 */
	TCOMPAT *mrpvbta;				/* VBT ｱﾄﾞﾚｽ			(L02)	 */
	TCOMPAT	*mrpjcta;				/* JCT ｱﾄﾞﾚｽ					 */
	TCOMPAT	*mrpbkta;				/* BKT ｱﾄﾞﾚｽ					 */
	TCOMPAT	*mrprcta;				/* RCT ｱﾄﾞﾚｽ					 */
	TCOMPAT	*mrpsura;				/* SUR ｱﾄﾞﾚｽ			   TD61  */
	TCOMPAT	*mrpsbra;				/* SBR ｱﾄﾞﾚｽ			   TD61  */
	TCOMPAT	*mrprbta;				/* RBT ｱﾄﾞﾚｽ			   TD59  */
	long	mrppgmd;				/* ﾌﾟﾛｸﾞﾗﾑ ﾓｰﾄﾞ					 */
	char	mrpnsrc;				/* ﾘｶﾊﾞﾘ ﾖｳﾌﾖｳ ｼﾞｮｳﾎｳ			 */
	char	mrprcst;				/* mr_prcv ｿｳｺｳ ｼﾞｮｳﾀｲ  (L04)    */
/*	char	mrpyob3[2];					ﾖﾋﾞ 3削除			(L04)	 */
/*	char	mrpyob4[2];					ﾖﾋﾞ 4削除			(L03)	 */
	char	mrptrst;				/* ﾄﾗﾝｻﾞｸｼｮﾝ ｽﾃｰﾀｽ				 */
	char	mrpenqf;				/* ENQ ﾌﾗｸﾞ						 */
	long	mrppbtn;				/* PBT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ		(L02)	 */
	long	mrpvbtn;				/* VBT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ		(L02)	 */
	long	mrptdtn;				/* TDT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				 */
	long	mrptctn;				/* TCT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				 */
	long	mrpsstn;				/* SST ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				 */
	long	mrprctn;				/* RCT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				 */
	long	mrpsurn;				/* SUR ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				 */
	long	mrpsbrn;				/* SBR ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				 */
/*	long	mrpyob5;					ﾖﾋﾞ 5削除 			(L03)	 */
	void	(*mrpexf)();			/* AP ﾚｲｶﾞｲ ｶﾝｽｳ ｱﾄﾞﾚｽ			 */
	void	(*mrpsexf)();			/* OCP ﾉ ｼｽﾃﾑﾀﾞｳﾝ ｶﾝｳ ｱﾄﾞﾚｽ		 */
/*	long	mrpyob6;					ﾖﾋﾞ 6削除			(L03)	 */
	char	*mrpmiad;				/* MIA ｱﾄﾞﾚｽ					 */
	long	mrpejrqf;				/* ｼﾞｬ-ﾅﾙ ｼｭﾄｸｲﾗｲ ﾖﾋﾞﾀﾞｼ ﾌｶ ﾌﾗｸﾞ */
};
typedef struct mrpcb MRPCB;
extern MRPCB *mrpcbp;

/*********************************************************************/
/*	MRPCB ﾘｶﾊﾞﾘ ﾖｳ/ﾌﾖｳ ﾌﾗｸﾞ											 */
/*********************************************************************/
#define		MRPNRNEC		'0'		/* ﾘｶﾊﾞﾘ ﾖｳ						 */
#define		MRPNRUEC		'1'		/* ﾘｶﾊﾞﾘ ﾌﾖｳ					 */

/*********************************************************************/
/*	MRPCB ENQﾌﾗｸﾞ ｼｭﾍﾞﾂ												 */
/*********************************************************************/
#define		MRPENQT		0x0020		/* TDT ENQﾌﾗｸﾞ					 */
#define		MRPENQC		0x0010		/* RCT ENQﾌﾗｸﾞ					 */

/*********************************************************************/
/*	MRPCB ﾄﾗﾝｻﾞｸｼｮﾝ ｽﾃｰﾀｽ ｼｭﾍﾞﾂ										 */
/*********************************************************************/
#define		MRPTRST		0x0080		/* ﾄﾗﾝｻﾞｸｼｮﾝ ﾁｭｳ				 */
#define		MRPTRED		0x0040		/* ﾄﾗﾝｻﾞｸｼｮﾝ ｼｭｳﾘｮｳ ｼｮﾘ ﾁｭｳ		 */
#define		MRPTRUPD	0x0020		/* ｼﾞｯｺｳｼﾝ ﾁｭｳ					 */

/*********************************************************************/
/*	RBI ﾌﾟﾛｾｽ ﾍﾉ ｼｽﾃﾑ ﾀﾞｳﾝ ﾌﾖｳ ｼﾞｮｳﾎｳ								 */
/*********************************************************************/
#define		MRRDOWN		0x0000		/* ｼｽﾃﾑ ﾀﾞｳﾝ ｱﾘ					 */
#define		MRRNODWN	0x0080		/* ｼｽﾃﾑ ﾀﾞｳﾝ ﾌﾖｳ				 */

/*********************************************************************/
/*	mr_prcv ｿｳｺｳ ｼﾞｮｳﾀｲ ｦ ｼﾒｽ  ﾌﾗｸﾞ  						   (L04) */
/*********************************************************************/
#define		MRPRCRUN	'1'			/* mr_prcv ﾊ ｿｳｺｳ ﾁｭｳﾃﾞ ｱﾙ (L04) */
#define		MRPRCSTP	'0'			/* mr_prcv ﾊ ｿｳｺｳ ﾁｭｳﾃﾞ ﾅｲ (L04) */
