/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		故障管理定義ファイル (mre.h)								 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾘｶﾊﾞﾘ ｷｮｳﾂｳ													 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲ ｼｬ : ﾏｴｻﾞﾜ ｱｷﾗ											 */
/*		ｻｸｾｲ ｼｬ : ﾏｴｻﾞﾜ ｱｷﾗ							 				 */
/*		ﾍﾝｺｳ ｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'88/05/10 (L01)				 */
/*				  (ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ ｷﾉｳ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC911		 */
/*		ﾍﾝｺｳ ｼｬ : ｽｽﾞｷ ｵｻﾑ 				'89/04/15 (L02)				 */
/*				  (SCSI ﾊﾞｽ ﾘｾｯﾄ ｼｮﾘ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC2466	 */
/*      変更者  : 杉岡　克也             93/11/12  TD-00             */
/*                 (他TC動作監視に伴う変更)        TD-01             */
/*                 (ﾎﾞﾘﾕ-ﾑ閉塞通知削除に伴う変更)  TD-47             */
/*                 (SCSIﾘｾﾂﾄ機能の変更に伴う変更)  TD-61             */
/*                 (JNL・RBIの初期化導入に伴う変更)TD-79             */
/*		変更者  : 今井　弘幸			 95/03/28	  CT0977(ST2646) */
/*				  （2重故障時面切替機能追加に伴う変更				 */ 
/*					仕様変更要求書 SSCYXXXX）						 */
/*      変更者  : 杉岡　克也             95/07/19 --- CT1096(ST2997) */
/*                 (VRCVのﾐﾗｰﾎﾞﾘｭｰﾑ復旧中の対処)					 */
/*      変更者  : 今井  弘幸             96/02/26 --- CT1213(ST4078) */
/*                 (MREUMNTERR削除)				 					 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*		ﾒﾂｾ-ｼﾞ ｿｳｼﾝﾓﾄ ｶﾝｽｳ ｼｷﾍﾞﾂ									 */
/*********************************************************************/
#define	MREREJRQ	0x01			/* ｼﾞｬ-ﾅﾙ ｼｭﾄｸ ｲﾗｲ (mr_ejrq)	 */
#define	MRERESRQ	0x02			/* TRADE故障通知   (mr_esrq)TD00 */
#define MREREARQ    0x03            /* JNL・RBI切替依頼(mr_earq)TD79 */

/*********************************************************************/
/*		ﾖﾋﾞﾀﾞｼ ﾌｶ ﾌﾗｸﾞ ﾏｽｸ 											 */
/*********************************************************************/
									/* 不要な処理の削除に伴う削除   */
									/* (2行)                    TD00 */

/*********************************************************************/
/*		故障管理ﾌﾟﾛｾｽ 内部関数　返却値                          TD-00*/
/*********************************************************************/
#define	MRENORMAL	0L				/* ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ		   (L01) */
#define	MRENORMX	1L				/* ｼﾞｮｳｹﾝ ﾂｷ ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ (L01) */
#define	MRERCVVH    2L				/* RCVﾎﾞﾘｭｰﾑ閉塞		 CTO671  */
#define	MREONVRCV	3L				/* VRCV中				 CT1096  */
#define MRERBIMSG   9L              /* RBI完了通知電文       CT0977	 */
#define MREEJCMSG   10L             /* JNL使用面切替依頼電文 CT0977	 */
#define MREJRCMSG   11L             /* JNL・RBI切替依頼電文     TD79 */
#define MREERRMSG   12L             /* JNL2重故障通知依頼電文   TD02 */
#define MRECISMSG   13L             /* 切替情報要求電文         TD79 */
#define MREMRIMSG   14L             /* ﾌﾟﾛｾｽ終了通知電文        TD79 */
#define	MREJNLMSG	17L				/* ｼﾞｬ-ﾅﾙ ｼｭﾄｸ ｼｮﾘ ﾃﾞﾝﾌﾞﾝ  (L01) */
#define	MREROSMSG	18L				/* TRADE故障通知電文        TD00 */
									/* ﾎﾞﾘﾕ-ﾑ閉塞通知削除に伴う削除  */
									/* (1行)                    TD47 */
#define	MREOBRMSG	20L				/* ﾀｹｲ ﾍｲｿｸ ｲﾗｲ ﾃﾞﾝﾌﾞﾝ     (L01) */
#define	MREOBFMSG	21L				/* ﾀｹｲ ﾍｲｿｸ ｶﾝﾘｮｳ ﾃﾞﾝﾌﾞﾝ   (L01) */
#define	MREOSTMSG	22L				/* ﾀｹｲ ｶｲｼ ﾂｳﾁ ﾃﾞﾝﾌﾞﾝ 	   (L01) */
#define	MRETRMMSG	23L				/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ ｲﾗｲ ﾃﾞﾝﾌﾞﾝ (L01) */
									/* SCSIﾘｾﾂﾄ機能の変更に伴う削除  */
									/* (2行)                    TD61 */
#define	MREOTHBLK	33L				/* ｼﾞｹｲ ﾍｲｿｸ ﾐｶﾝﾘｮｳ ｼﾞｮｳﾀｲ (L01) */
#define	MREOWNBLK	34L				/* ﾀｹｲ ﾍｲｿｸ ﾐｶﾝﾘｮｳ ｼﾞｮｳﾀｲ  (L01) */
#define	MRENOTBLK	35L				/* ﾍｲｿｸ ﾐｶﾝﾘｮｳ ｼﾞｮｳﾀｲ	   (L01) */
#define	MREFINBLK	36L				/* ﾍｲｿｸ ｶﾝﾘｮｳ ｼﾞｮｳﾀｲ	   (L01) */
#define	MREERROR	-1L				/* ｲｼﾞｮｳ  ｼｭｳﾘｮｳ ｼﾞｮｳﾀｲ    (L01) */
#define	MRENOMEM	-2L				/* ﾒﾓﾘ ﾌﾞｿｸ				   (L01) */
#define	MREALREADY	-3L				/* ｽﾃﾞﾆ ﾄｳﾛｸ ｽﾞﾐ		   (L01) */
#define	MRERTRYOV	-4L				/* ﾍｲｿｸ ﾏﾁ ﾘﾄﾗｲ ｵ-ﾊﾞ-	   (L01) */
#define	MRENOEXST	-5L				/* ﾐ ｿﾝｻﾞｲ ｴﾗ-			   (L01) */
#define	MREOTHDWN	-6L				/* ﾀｹｲ ﾀﾞｳﾝ ﾁｭｳ			   (L01) */
#define MREOTHCHG   -7L             /* 現用系代行中             TD01 */
/*	削除（１行）											CT1213	 */
#define	MREECONN	-9L             /* ｺﾈｸﾄ失敗				CT0977   */
#define	MREEOPEN	-10L            /* ｵｰﾌﾟﾝ失敗			CT0977   */
#define	MREEWRIT	-11L            /* 書き込み失敗			CT0977   */
#define	MREEFLSH	-12L            /* 遅延ﾃﾞｰﾀ書き込み失敗	CT0977   */

/*********************************************************************/
/*		故障管理ﾌﾟﾛｾｽ 制御ﾌﾞﾛｯｸ								    TD-00*/
/*********************************************************************/
struct	mrecb {						/*						   (L01) */
	char	mrecbid[4];				/* ﾌﾞﾛｯｸ ｼｷﾍﾞﾂｼ('ECB ')	   (L01) */
									/* ﾎﾞﾘﾕ-ﾑ閉塞通知削除に伴う削除  */
									/* (4行)                    TD47 */
	long	mremsrd;				/* ﾒｯｾｰｼﾞ用ﾘｸｴｽﾄ識別子			 */
	char	*mremsad;				/* ｼﾞｭｼﾝ ﾒｯｾ-ｼﾞ ｱﾄﾞﾚｽ	   (L01) */
	long	mremsln;				/* ｼﾞｭｼﾝ ﾒｯｾ-ｼﾞ ﾁｮｳ 	   (L01) */
									/* SCSIﾘｾﾂﾄ機能の変更に伴う削除  */
									/* (1行)                    TD61 */
    unsigned	char	mrejrif;   	/* 初期化中ﾌﾗｸﾞ             TD79 */
	char	mreyob1[3];				/* 予備						TD79 */
	long	mresdtj1;				/* 初期JNL上のSMP日付1    CT0977 */
	long	mresdtj2;				/* 初期JNL上のSMP日付2    CT0977 */
	long	mresdtk1;				/* 初期JNL上のSMP日付1	  CT0977 */
	long	mresdtk2;				/* 初期JNL上のSMP日付2    CT0977 */
};															/* (L01) */
typedef	struct	mrecb	MRECB;								/* (L01) */

/*******************************/
/* 初期化中ﾌﾗｸﾞ(mrejrif)の定義 */
/*******************************/
#define MREINTJNL   0x80          	/* JNL初期化中              TD79 */
#define MREINTRBI   0x40          	/* RBI初期化中              TD79 */
#define MREINTKJ    0x20          	/* KJ初期化中               TD79 */
#define MRENOINT    0x00            /* 非初期化中               TD79 */
