/****************************************************************************/
/*  著作権  １９９３														*/
/*            ＮＴＴデータ通信株式会社										*/
/*              金融システム事業本部										*/
/*																			*/
/*																			*/
/*  収容物  ＡＣＥーＳＭＰシステム   サブ故障管理プロセス（mr_ekxx系）    	*/
/****************************************************************************/
/* ＜対象業務名＞                    故障回復業務                       　　*/
/* ＜対象業務ＩＤ＞                  ＲＣＶ                                 */
/* ＜サービス項目名＞                サブ故障管理共通                     	*/
/* ＜サービス項目ＩＤ＞              ｋ０１                                 */
/* ＜モジュール名＞                  サブ故障管理プロセス制御ブロック	    */
/* ＜モジュールＩＤ＞             			                                */
/* ＜モジュール通番＞                	                                　　*/
/*--------------------------------------------------------------------------*/
/* ＜適用機種＞                      ＡＣＥ                                 */
/* ＜適用ＯＳ＞                      ＴＲＡＤＥ                             */
/* ＜開発環境＞                      ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ             */
/* ＜記述言語＞                      Ｃ言語                                 */
/* ＜モジュール形態＞                構造体                                 */
/* ＜機能区分＞                      	                                    */
/* ＜対象データ＞                    	                                　　*/
/* ＜工程・階層区分＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞                ＡＣＥ−ＳＭＰシステム                 */
/* ＜開発システム番号＞              ５７２６０１４０２１００               */
/*--------------------------------------------------------------------------*/
/* ＜開発担当者名＞                  営業店システム担当                     */
/* ＜電話番号＞                      169-3573(03-5702-3573)                 */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞　　　　　　　　　　　杉岡　克也                             */
/* ＜設計年月日＞                    １９９４年　４月  ３日                 */
/* ＜設計修正者名＞                                                         */
/* ＜設計修正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者名＞                杉岡　克也                             */
/* ＜ソース作成年月日＞              １９９４年  ５月１３日                 */
/* ＜ソース修正者名＞                杉岡  克也								*/
/* ＜ソース修正年月日及び修正ＩＤ＞  １９９５年１０月１０日	ST3492			*/
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ＞															*/
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞																*/
/* ＜仮引数＞																*/
/* ＜返却値＞																*/
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構造＞														*/
/* ＜制限事項＞																*/
/* ＜使用外部モジュールＩＤ＞												*/
/* ＜呼出元のモジュールＩＤ＞												*/
/****************************************************************************/

/****************************************************************************/
/*  終了コード／返却値														*/
/****************************************************************************/
#define	MREKNORMX	1L					/* 条件付正常終了			ST3492	*/

#define	MREKHRMSG	11L					/* ﾎﾞﾘｭｰﾑ閉塞電文			ST3492	*/
#define	MREKNRMSG	12L					/* ﾎﾞﾘｭｰﾑ閉塞解除電文		ST3492	*/
#define	MREKTDMSG	13L					/* SMP通知電文				ST3492	*/
#define	MREKBCMSG	14L					/* 系切替発生通知			ST3492	*/
#define	MREKTMMSG	15L					/* ﾌﾟﾛｾｽ終了依頼電文		ST3492	*/

#define	MREKNORMAL	0L					/* 正常終了							*/
#define	MREKNOMEM	-1L					/* ﾌﾟｰﾙﾊﾞｯﾌｧ確保異常				*/
#define	MREKOTHDWN	-2L					/* 相手系ﾀﾞｳﾝ中						*/

/****************************************************************************/
/*  ＭＲＥＫＣＢ（サブ故障管理プロセス制御ブロック）の定義                  */
/****************************************************************************/
struct	mrekcb {
	char	mrekcbid[4];				/* ブロック識別子('EKCB')	   		*/
	long	mrekmsrd;					/* ﾒｯｾｰｼﾞ用ﾘｸｴｽﾄ識別子				*/
	char	*mrekmsad;					/* 受信ﾒｯｾ-ｼﾞｱﾄﾞﾚｽ	   				*/
	long	mrekmsln;					/* ｼﾞｭｼﾝﾒｯｾ-ｼﾞ長					*/
};
typedef	struct	mrekcb	MREKCB;
