/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ﾘｶﾊﾞﾘ ﾌｧｲﾙ ｿｳｾｲ ｶｲﾌｸ ｷﾉｳ ﾃｲｷﾞ ﾌｧｲﾙ (mrf.h)					 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾘｶﾊﾞﾘ ﾌｧｲﾙ ｿｳｾｲ ｶｲﾌｸ ｼｮﾘ									 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲ ｼｬ :													 */
/*		ｻｸｾｲ ｼｬ : ﾉｸﾞﾁ ﾏｽｵ											 */
/*		ﾍﾝｺｳｼﾔ  : ｽｽﾞｷ ｵｻﾑ			 	'89/09/07   (L01)			 */
/*			 (RCV ﾌｧｲﾙ ｿｳｾｲ/ｶｲﾌｸ ﾊﾟﾗﾒﾀ ｾｯﾃｲ ｷﾉｳ ﾂｲｶ)	---TCXXXX	 */
/*      変更者  : 今井　弘幸             93/11/12    TD-00           */
/*		     (SCSIﾘｾｯﾄ機能に伴う変更)						 (TD-61) */
/*		     (JNL/RBIの初期化に伴う変更) 					 (TD-79) */
/*		     (信金版VRCVに伴う変更) 					 	 (TD-99) */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ｼｭｳﾘｮｳ ｺｰﾄﾞ / ﾍﾝｷｬｸﾁ											 */
/*********************************************************************/
#define MRFNORMAL	0L		/*	ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ						 */
#define MRFFILERR	-1L		/*	ﾌｧｲﾙ ｱｸｾｽ ｴﾗ-						 */
#define	MRFTBLERR	-2L		/*	ﾃ-ﾌﾞﾙ ｴﾗ-							 */
#define MRFOSERR	-3L		/*	ROS ｼｽﾃﾑ ｺ-ﾙ ｴﾗ-					 */
#define MRFNOMEM	-4L		/*	ﾒﾓﾘ ﾌﾞｿｸ							 */
#define MRFENQERR	-5L		/*	ｼｹﾞﾝ ｾﾝﾕｳ ｴﾗ-						 */
#define MRFIVPARM	-6L		/*	ﾊﾟﾗﾒﾀ ｴﾗ-							 */
#define MRFRBIERR	-7L		/*  RBI定周期取得停止依頼失敗	  (TD79) */
#define	MRFDEXIST	-8L		/*  ﾃﾞｨﾚｸﾄﾘﾌｧｲﾙ既存			      (TD61) */

/*********************************************************************/
/*	ﾌｧｲﾙ ｼｭﾍﾞﾂ (type)												 */
/*********************************************************************/
#define MRFJNL		0x01	/*	ｼﾞｬ-ﾅﾙ ﾌｧｲﾙ							 */
#define MRFRBI		0x02	/*	RBI ﾌｧｲﾙ							 */

/*********************************************************************/
/*	ｾｲﾌｸ ｸﾌﾞﾝ (flag)												 */
/*********************************************************************/
#define MRFMAIN		0x01	/*	ｾｲｹｲ								 */
#define MRFSUB		0x02	/*	ﾌｸｹｲ								 */

/*********************************************************************/
/*	ｼﾞｬ-ﾅﾙ ﾍｲｼｭｳ ｲｷ 												 */
/*********************************************************************/
struct jnl{
	MRJVC1	jvc1;
	MRJSMP	smp;
	MRJNL	fjnl;
	long	rlen;
	MRJVC2	jvc2;
};
typedef struct jnl MRFEDJNL;
/*********************************************************************/
/*  リカバリファイル創成プロセス制御ブロック			      (TD00) */
/*********************************************************************/
struct		mrfcb{						/*				      (TD79) */
	unsigned char	mrfmoti;			/* 起動元情報     	  (TD79) */
	char	mrfreqi;					/* 依頼情報	      	  (TD79) */
	char	mrfflag;					/* 創成成功ﾌﾗｸﾞ	  	  (TD79) */
	char	mrfyobi;					/* 予備領域			  (TD79) */
};										/*				  	  (TD79) */
typedef	struct	mrfcb	MRFCB;			/*				  	  (TD79) */

/*********************************************************************/
/* 起動元プロセス情報									      (TD00) */
/*********************************************************************/
#define		MRFMRH			0L			/* mrh起動			  (TD79) */
#define		MRFMRO			1L			/* mro起動			  (TD99) */
#define		MRFMNT			2L			/* ｵﾍﾟﾚｰﾀ起動		  (TD99) */

/*********************************************************************/
/*  ＲＢＩ取得処理の引数								      (TD00) */
/*********************************************************************/
#define		MRFGETD			0L			/* RBI直接取得		  (TD79) */
#define		MRFSTOP			1L			/* RBI定周期取得停止  (TD79) */

/*********************************************************************/
/*  マスクデータのＤＥＦＩＮＥ		      					  (TD00) */
/*********************************************************************/
#define		MRFREQMASK		0x80		/* ﾘｸｴｽﾄ種別用MASK    (TD39) */
#define		MRFRBIMASK		0xe0		/* RBI創成識別用MASK  (TD79) */
#define		MRFJNLMASK		0x1e		/* JNL創成識別用MASK  (TD79) */
#define		MRFRCVMASK		0xfe		/* RCV創成識別用MASK  (TD79) */

