/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム　										*/
/*				ＲＣＶ　ＳＣＳＩリセットプロセス	(mr_gxxx系)				*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 ＳＣＳＩリセットプロセス共通			*/
/*＜サービス項目ＩＤ＞				 ｇ０１									*/
/*＜モジュール名＞					 ＳＣＳＩリセットヘッダファイル定義		*/
/*＜モジュールＩＤ＞				 ０ｘ２４６０００００					*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 赤塚　一元								*/
/*＜設計年月日＞					 １９９５年０２月０１日					*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 赤塚　一元								*/
/*＜ソース作成年月日＞				 １９９５年０４月２０日					*/
/*＜ソース修正者名＞				 赤塚　一元								*/
/*＜ソース修正年月日＞				 '95.08.21		CT1106(ST3142)			*/
/*＜ソース修正者名＞				 今井　弘幸								*/
/*＜ソース修正年月日＞				 '96.01.10		TD-N4					*/
/*＜ソース修正者名＞				 宮脇　伸								*/
/*＜ソース修正年月日＞				 '99.03.31	SPCY0146 (640M MO追加対応)	*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*		ＳＣＳＩリセットプロセスで使用するヘッダファイルを共通にｉｎｃ		*/
/*		ｌｕｄｅする														*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*																			*/
/****************************************************************************/
#include	<osizze.h>
#include	<osicor.h>
#include	<osifdr.h>
#include	<osidkr.h>
#include	<osimtr.h>
#include	<osiodr.h>
#include	<osiod.h>
#include	<osimor.h>
#include	<osiacr.h>
#include	<osf.h>
#include	<osgfinf.h>							/*		CT1106				*/
#include	<osfmrr.h>
#include	<osrcvmsp.h>
#include	<osimdr.h>							/*						TDN4*/
#include	<osimcr.h>							/*					SPCY0146*/

#include	"tcom.h"
#include	"tsst.h"
#include	"tsrt.h"
#include	"tcst.h"
#include	"tpct.h"
#include	"tbpt.h"
#include	"tabp.h"
#include	"tvmt.h"
#include	"tmrt.h"
#include	"tgmt.h"
#include	"tsgt.h"
#include	"tfmt.h"
#include	"tkmt.h"
#include	"ttct.h"
#include	"tjct.h"
#include	"trbt.h"
#include	"tbkt.h"
#include	"tpvt.h"
#include	"tsur.h"
#include	"tpbt.h"
#include	"tvbt.h"
#include	"twmt.h"
#include	"tsbr.h"

#include	"psect.h"
#include	"mopcb.h"
#include	"mrcom.h"
#include	"mfcom.h"

#include	"mc.h"
#include	"mcdebug.h"
#include	"md.h"

#include	"mr.h"
#include	"mrcode.h"
#include	"mrmac.h"
#include	"mrmuse.h"
#include	"mrmsg.h"
#include	"mrjnl.h"
#include	"mrg.h"
#include	"mrgdef.h"
#include	"mrcsrr.h"

#include	"mo.h"
#include	"moer.h"
#include	"mo_wlg.h"
#include	"momhead.h"

#include	"mf.h"
#include	"mfjnl.h"
