/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム　										*/
/*				ＲＣＶ　ＳＣＳＩリセットプロセス	(mr_gxxx系)				*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 ＳＣＳＩリセットプロセス共通			*/
/*＜サービス項目ＩＤ＞				 ｇ０１									*/
/*＜モジュール名＞					 ＳＣＳＩリセットプロセス関数宣言		*/
/*＜モジュールＩＤ＞				 ０ｘ２４６０００００					*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 赤塚　一元								*/
/*＜設計年月日＞					 １９９５年０２月０１日					*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 赤塚　一元								*/
/*＜ソース作成年月日＞				 １９９５年０４月２０日					*/
/*＜ソース修正者名＞				 赤塚　一元								*/
/*＜ソース修正年月日及び修正ＩＤ＞											*/
/*									 '95.11.06		ST3688					*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*		ＳＣＳＩリセットプロセスで使用する外部関数の宣言					*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*																			*/
/****************************************************************************/
/****************************************************************************/
/*	ＴＲＡＤＥシステムコール												*/
/****************************************************************************/
/****************************************/
/*	実行管理システムコール				*/
/****************************************/
extern	long	osrcvmsp( long, long, char ** );

/****************************************/
/*	ファイル管理システムコール			*/
/****************************************/
extern	long	osdconn( long );
extern	long	osconn( char * );
extern	long	osopen( long, long, long, long, long, long );
extern	long	osclose( long );
/****************************************/
/*	入出力制御システムコール			*/
/****************************************/
extern	long	osioctl( long, long, char *, long );

/****************************************************************************/
/*	提供関数・サービスコール・共通関数										*/
/****************************************************************************/
/****************************************/
/*	ＯＣＰ提供関数						*/
/****************************************/
extern	long	mo_frbf( long * );
extern	void	mo_wlg4( long, long, long, long *, long );
extern	TCOMPAT	*mo_tagt( unsigned char * );

/****************************************/
/*	ＲＣＶ提供関数						*/
/****************************************/
extern	void	mr_sabt( short, long, long, long );

/****************************************/
/*	共通関数							*/
/****************************************/
extern	long	mc_add( char *, char *, char *, long, long, long );
extern	long	mc_bpcn( long, char *, long );
extern	long	mc_bccn( long, char *, long );
extern	long	mc_cbcn( char *, long *, long );
extern	long	mc_ccom( char *, char *, long );
extern	long	mc_ccpy( char *, char *, long );
extern	long	mc_cequ( char *, char *, long, char );
extern	long	mc_chcn( char *, char *, long );
extern	long	mc_copy( char *, char *, long );
extern	long	mc_cpcn( char *, long, char *, long );
extern	long	mc_hccn( char *, char *, long );
extern	long	mc_nmck( char *, long );
extern	long	mc_padd( char *, char * );
extern	long	mc_pbcn( char *, char * );
extern	long	mc_pccn( char *, char *, long );
extern	long	mc_pcom( char *, char * );
extern	long	mc_pdev( char *, char *, char * );
extern	long	mc_pmvl( char *, char * );
extern	long	mc_psub( char *, char * );
extern	long	mc_save( char *, char *, long *, long *, long * );
/*	extern	long	mc_clea( char *, char, long );	*/

/****************************************/
/*	ＳＣＳＩリセット内部関数			*/	
/****************************************/
extern	long	mr_gocn( char * );
extern	long	mr_godn( long );
extern	long	mr_gosi( long, long, char *, long );
extern	long	mr_gopn( long );
extern	long	mr_gcls( long );
extern	void	mr_gwto( char *, char *, char *, char *, char *, char * );
											/*			ST3688				*/
