/****************************************************************************/
/*  著作権  １９９３														*/
/*            ＮＴＴデータ通信株式会社										*/
/*              金融システム事業本部										*/
/*																			*/
/*																			*/
/*  収容物  ＡＣＥーＳＭＰシステム   ＶＲＣＶ前処理プロセス（mr_hxxx系）    */
/****************************************************************************/
/* ＜対象業務名＞                    故障回復業務                       　　*/
/* ＜対象業務ＩＤ＞                  ＲＣＶ                                 */
/* ＜サービス項目名＞                ＶＲＣＶ前処理共通                     */
/* ＜サービス項目ＩＤ＞              ｎ０１                                 */
/* ＜モジュール名＞                  ＶＲＣＶ前処理プロセス制御ブロック     */ 
/* ＜モジュールＩＤ＞             			                                */
/* ＜モジュール通番＞                	                                　　*/
/*--------------------------------------------------------------------------*/
/* ＜適用機種＞                      ＡＣＥ                                 */
/* ＜適用ＯＳ＞                      ＴＲＡＤＥ                             */
/* ＜開発環境＞                      ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ             */
/* ＜記述言語＞                      Ｃ言語                                 */
/* ＜モジュール形態＞                構造体                                 */
/* ＜機能区分＞                      	                                    */
/* ＜対象データ＞                    	                                　　*/
/* ＜工程・階層区分＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞                ＡＣＥ−ＳＭＰシステム                 */
/* ＜開発システム番号＞              ５７２６０１４０２１００               */
/*--------------------------------------------------------------------------*/
/* ＜開発担当者名＞                  営業店システム担当                     */
/* ＜電話番号＞                      169-3573(03-5702-3573)                 */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞　　　　　　　　　　　杉岡　克也                     (TD-90) */
/* ＜設計年月日＞                    １９９４年　３月３０日                 */
/* ＜設計修正者名＞                  杉岡　克也								*/
/* ＜設計修正年月日及び修正ＩＤ＞    １９９４年１１月２９日			CT0690  */
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者名＞                杉岡　克也                             */
/* ＜ソース作成年月日＞              １９９４年  ５月１４日                 */
/* ＜ソース修正者名＞                                                       */
/* ＜ソース修正年月日及び修正ＩＤ＞                                         */
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ＞															*/
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞																*/
/* ＜仮引数＞																*/
/* ＜返却値＞																*/
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構造＞														*/
/* ＜制限事項＞																*/
/* ＜使用外部モジュールＩＤ＞												*/
/* ＜呼出元のモジュールＩＤ＞												*/
/****************************************************************************/

/****************************************************************************/
/*  終了コード／返却値														*/
/****************************************************************************/
#define	MRHNORMAL		0L				/* 正常終了							*/
#define	MRHNORMX		1L				/* 条件付き正常終了                 */

#define	MRHWTOERR		-1L				/* ﾒﾂｾ-ｼﾞ出力ｴﾗ-					*/
#define	MRHIVPARM		-2L				/* ﾊﾟﾗﾒﾀｴﾗ-							*/
#define MRHPMDERR		-3L             /* ﾌﾟﾛｸﾞﾗﾑﾓ-ﾄﾞｴﾗ-                   */
#define	MRHESCON		-4L				/* ｼｽﾃﾑ構成ｴﾗ-                      */
#define	MRHONBKUP		-5L				/* ﾊﾞﾂｸｱﾂﾌﾟ中                       */
#define	MRHONVRCV		-6L				/* VRCV中                           */
#define	MRHONASRCV		-7L				/* 先行ﾘｶﾊﾞﾘ中                      */
#define MRHONRCVF       -8L             /* 使用中RCVﾎﾞﾘﾕ-ﾑがある            */
#define MRHIRCVF        -9L             /* RCVﾌｱｲﾙ初期化中					*/
#define	MRHTBLERR		-10L			/* 必要なTBLが存在しない	CT0690	*/
#define	MRHUMTERR		-11L			/* ｱﾝﾏｳﾝﾄ失敗						*/

/****************************************************************************/
/*  ＭＲＨＣＢ（ＶＲＣＶ前処理プロセス制御ブロック）の定義                  */
/****************************************************************************/
struct	mrhcb{
	char		mrhcbid[4];				/* ﾌﾞﾛﾂｸ識別子                      */
	char		mrhnvsid;				/* 処理種別                         */
	char		mrhnyob1[3];			/* 予備1							*/
	long		mrhnpvtn;				/* PVTﾘｽﾄのｴﾝﾄﾘ数					*/
	short		mrhnpvtl[30];			/* PVTﾘｽﾄ							*/
};
typedef struct mrhcb MRHCB;

