/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž®Ž·Ž¶ ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mri.h)								 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž®Ž·Ž¶ Ž¼Ž®ŽØ												 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽÏŽÂŽ¼ŽÀ Ž´Ž²Ž¼ŽÞ											 */
/*		Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÏŽÂŽ¼ŽÀ Ž´Ž²Ž¼ŽÞ											 */
/*		ŽÍŽÝŽºŽ³ Ž¼Ž¬ :													 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	Ž¼Ž­Ž³ŽØŽ®Ž³ ŽºŽ°ŽÄŽÞ / ŽÍŽÝŽ·Ž¬Ž¸ŽÁ											 */
/*********************************************************************/
#define MRINORMAL	0L		/*	Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³						 */
#define MRINORMX	1L		/*	Ž¼ŽÞŽ®Ž³Ž¹ŽÝ ŽÂŽ· Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³				 */
#define	MRIIVPARM	-1L		/*	ŽÊŽßŽ×ŽÒŽÀ Ž´Ž×Ž°							 */
#define	MRICONPRC	-2L		/*	Ž·Ž®Ž³ŽºŽÞŽ³ ŽÌŽßŽÛŽ¾Ž½ Ž·ŽÄŽÞŽ³ ŽÁŽ­Ž³				 */
#define MRIINTIMP	-3L		/*	ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž®Ž·Ž¶ ŽÌŽÉŽ³						 */
#define MRIINTERR	-4L		/*	ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž®Ž·Ž¶ Ž¼Ž¯ŽÊŽßŽ²					 */
#define MRIOSERR	-5L		/*	ROS Ž¼Ž½ŽÃŽÑ ŽºŽ°ŽÙ Ž´Ž×Ž°					 */
#define MRINOMEM	-6L		/*	ŽÒŽÓŽØ ŽÌŽÞŽ¿Ž¸							 */

/*********************************************************************/
/*	MRICB (Ž·Ž®Ž³ŽÂŽ³ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¾Ž¯ŽÃŽ² ŽØŽ®Ž³Ž²Ž·)									 */
/*********************************************************************/
struct mricb {
	char		mricbid[4];		/* ŽÌŽÞŽÛŽ¯Ž¸ Ž¼Ž·ŽÍŽÞŽÂŽ¼						 */
	TCOMPAT		*mricpbt;		/* PBT Ž¾ŽÝŽÄŽ³ Ž±ŽÄŽÞŽÚŽ½					 */
	TCOMPAT		*mricvbt;		/* VBT Ž¾ŽÝŽÄŽ³ Ž±ŽÄŽÞŽÚŽ½					 */
	char		*mricsnm;		/* Ž¼Ž®Ž·Ž¶ ŽÖŽ³ ŽÄŽ¸Ž¼Ž­ ŽÌŽ§Ž²ŽÙ ŽÒŽ²				 */
	long		mricbkn;		/* BKT Ž¼Ž¹ŽÞŽÝ ŽÊŽÞŽÝŽºŽÞŽ³					 */
	long		mricctd;		/* Ž·ŽÄŽÞŽ³ ŽºŽÏŽÝŽÄŽÞ Ž¼Ž­Ž³ŽØŽ®Ž³ ŽºŽ°ŽÄŽÞ			 */
	short		mricpen;		/* ŽÌŽÞŽÂŽØ ŽÎŽÞŽØŽ­Ž°ŽÑ Ž´ŽÝŽÄŽØ ŽÊŽÞŽÝŽºŽÞŽ³			 */
	char		mriccpu;		/* ŽºŽÏŽÝŽÄŽÞ Ž·ŽÄŽÞŽ³ PU ŽÊŽÞŽÝŽºŽÞŽ³				 */
	char		mricyb1;		/* ŽÖŽËŽÞ 1							 */
	char		mricitp;		/* Ž¼Ž®ŽØ Ž¼Ž­ŽÍŽÞŽÂ						 */
	char		mricmad;		/* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž»Ž·					 */
	char		mrictrm;		/* Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¼Ž®ŽØ Ž¼ŽÞŽ®Ž³ŽÎŽ³				 */
	char		mricyb2;		/* ŽÖŽËŽÞ 2							 */
};
typedef struct mricb MRICB;

/*********************************************************************/
/*	MRICB Ž¼Ž·ŽÍŽÞŽÂŽ¼ ŽÉ Ž±ŽÀŽ²												 */
/*********************************************************************/
#define	MRICBID		"ICB "

/*********************************************************************/
/*	Ž¼Ž®ŽØ Ž¼Ž­ŽÍŽÞŽÂ ŽÉ Ž±ŽÀŽ²													 */
/*********************************************************************/
#define	MRICOMM		'C'			/* ŽÓŽÄŽÁŽ®Ž³ ŽÎŽÞŽØŽ­Ž°ŽÑ ŽÉ Ž¼Ž®Ž·Ž¶				 */
#define	MRIBKUP		'B'			/* ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß ŽÎŽÞŽØŽ­Ž°ŽÑ ŽÉ Ž¼Ž®Ž·Ž¶			 */

/*********************************************************************/
/*	ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž»Ž· ŽÉ Ž±ŽÀŽ²											 */
/*********************************************************************/
#define	MRIUWTO		'O'			/* Ž·ŽÄŽÞŽ³ ŽÀŽÝŽÏŽÂ ŽÆ Ž¼Ž­ŽÂŽØŽ®Ž¸				 */
#define	MRIWTOP		'N'			/* NTC ŽÀŽÞŽ²ŽËŽ®Ž³ I/O ŽÆ Ž¼Ž­ŽÂŽØŽ®Ž¸			 */

/*********************************************************************/
/*	Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¼Ž®ŽØ Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÉ Ž±ŽÀŽ²											 */
/*********************************************************************/
#define MRITSST		0x80		/* SST Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¼Ž®ŽØ ŽÖŽ³				 */
#define MRITENQ		0x40		/* Ž¾ŽÝŽÕŽ³ Ž¼Ž¹ŽÞŽÝ Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¼Ž®ŽØ ŽÖŽ³			 */

/*********************************************************************/
/*	ŽºŽ³Ž¼ŽÝ Ž¼Ž­ŽÍŽÞŽÂ ŽÉ Ž±ŽÀŽ²												 */
/*********************************************************************/
#define	MRIJNLJ		1L			/* Ž¶ŽØ ŽºŽ³Ž¼ŽÝ							 */
#define	MRIJNLR		2L			/* Ž¼ŽÞŽÂ ŽºŽ³Ž¼ŽÝ							 */
#define	MRIJNLN		3L			/* ŽºŽ³Ž¼ŽÝ ŽÊ ŽµŽºŽÅŽÜŽÅŽ²					 */

/*********************************************************************/
/*	ŽËŽÞŽ¯ŽÄ Ž¿Ž³Ž» Ž¼Ž­ŽÍŽÞŽÂ ŽÉ Ž±ŽÀŽ²											 */
/*********************************************************************/
#define	MRIBITON	1L			/* ŽËŽÞŽ¯ŽÄ Ž¦ ŽµŽÝ						 */
#define	MRIBITOFF	2L			/* ŽËŽÞŽ¯ŽÄ Ž¦ ŽµŽÌ						 */

