/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ｼﾞｬｰﾅﾙ ﾍﾝｼｭｳｲｷ､JCF ﾃｲｷﾞ ﾌｧｲﾙ (mrj.h)						 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ｼﾞｬｰﾅﾙ ｼｭﾄｸ													 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ					 					 */
/*		ｻｸｾｲ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ										 */
/*		ﾍﾝｺｳｼﾔ  : ｽｽﾞｷ ｵｻﾑ			 '88/10/05 (L01)				 */
/*				 (ｼﾞｬｰﾅﾙ ﾘｰﾄﾞ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC1230			 */
/*		ﾍﾝｺｳ ｼｬ : 山下　元			 '93/12/20	 					 */
/*				 (ﾛｼﾞｯｸの整理)								TD-@1	 */
/*				 (２重化ﾌｧｲﾙ削除に伴う削除)					TD-27	 */
/*				 (KJ分離に伴う変更)							TD-42	 */
/*				 (BKUP中ｼﾞｬｰﾅﾙ取得)							TD-67	 */
/*		ﾍﾝｺｳ ｼｬ : 山下　元			 '94/06/04	 					 */
/*				 (KJ単独ﾊﾞｯｸｱｯﾌﾟに伴う追加)					TD-83	 */
/*      変更者  : 杉岡  克也		 '95/02/28 --- CT0899(ST2488)	 */
/*               (ﾐﾗ-ﾘﾝｸﾞｻﾎﾟ-ﾄに伴う変更)					TD-22    */
/*      変更者  : 杉岡  克也		 '95/09/25 --- ST3441			 */
/*      変更者  : 山本　有司		 '96/02/19 --- CT1211(ST4062)	 */
/*				 (先行リカバリ高速化に伴う変更)						 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ﾍﾝｼｭｳ ﾊﾞｯﾌｧ												 */
/*********************************************************************/
struct mrjedt{
	 struct mrjedt *mrjenxt;	/* ｼﾞﾊﾞｯﾌｧ ﾉ ｱﾄﾞﾚｽ					 */
	 long	mrjesiz;			/* ﾎﾝﾘｮｳｲｷ ﾉ ﾅｶﾞｻ			ST3441	 */
	 long	mrjeuse;			/* ｼﾖｳ ﾘｮｳｲｷ ﾁｮｳ			ST3441	 */
	 char	mrjedat[4];			/* ﾃﾞｰﾀ ｲｷ							 */
};
typedef struct mrjedt MRJEDT;

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ﾖﾐｺﾐ ﾊﾞｯﾌｧ												 */
/*********************************************************************/
struct mrjrbf{												/* (L01) */
	 struct mrjrbf *mrjrnxt;	/* ｼﾞﾊﾞｯﾌｧ ﾉ ｱﾄﾞﾚｽ			   (L01) */
	 long	mrjrbln;			/* ｶｸﾄｸ ﾊﾞｯﾌｧ ﾁｮｳ		(L01)ST3441	 */
	 long	mrjreln;			/* ﾊﾞｯﾌｧﾅｲ ﾕｳｺｳ ﾃﾞｰﾀ ﾁｮｳ(L01)ST3441  */
	 char	mrjrdat[4];			/* ﾃﾞｰﾀ ｲｷ				 	   (L01) */
};															/* (L01) */
typedef struct mrjrbf MRJRBF;								/* (L01) */

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ﾖﾐｺﾐ ﾊﾞｯﾌｧ(一括読込用)									 */
/*********************************************************************/
struct mrjbbf{											   /* CT1211 */
	 long	mrjbsiz;			/* ｶｸﾄｸ ﾊﾞｯﾌｧ ﾁｮｳ			  CT1211 */
	 long	mrjbeln;			/* ﾊﾞｯﾌｧﾅｲ ﾕｳｺｳ ﾃﾞｰﾀ ﾁｮｳ	  CT1211 */
	 long	mrjbpos;			/* ｹﾞﾝ ﾖﾐｺﾐ ﾃﾞｰﾀ ﾎﾟｼﾞｼｮﾝ	  CT1211 */
	 char	mrjbdat[4];			/* ﾃﾞｰﾀ ｲｷ				 	  CT1211 */
};														   /* CT1211 */
typedef struct mrjbbf MRJBBF;							   /* CT1211 */

/*********************************************************************/
/*	JCF (Journal Control Field)										 */
/*********************************************************************/
struct mrjcf{
	 char		mrjcfid[4];		/* ﾁｪｯｸ ﾊﾟﾀｰﾝ						 */
	 char		mrjcmod;		/* ｵｰﾌﾟﾝ ﾓｰﾄﾞ						 */
	 char		mrjcsts;		/* ｽﾃｰﾀｽ							 */
	 char		mrjckfg;		/* KJ編集付加関数呼出ﾌﾗｸﾞ		TD@1 */
	 char		mrjcjus;		/* ｵｰﾌﾟﾝ種別					TD42 */
	 short		mrjcjum;		/* ｵｰﾌﾟﾝ面/BKUP JNL PBT	ｴﾝﾄﾘ番号TD67 */
	 short		mrjcpbe;		/* BKUP KJ PBT ｴﾝﾄﾘ番号			TD61 */
	 TTCTPSZ	*mrjctct;		/* TTCT ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ			TD00 */
	 TJCTPSZ	*mrjcjct;		/* TJCT ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ			TD00 */
	 long		mrjcext;		/* ｼﾞｬｰﾅﾙ編集域拡張ｻｲｽﾞ			TD00 */
	 long		mrjcfd1;		/* JNL ﾌｧｲﾙﾃﾞｨｽｸﾘﾌﾟﾀ			TD27 */
	 long		mrjcfd2;		/* KJ ﾌｧｲﾙﾃﾞｨｽｸﾘﾌﾟﾀ				TD42 */
	 long		mrjcjad;		/* 現読み込み位置				TD00 */
	 MRJEDT		*mrjcstt;		/* ｾﾝﾄｳ ﾍﾝｼｭｳ ﾘｮｳｲｷ ｱﾄﾞﾚｽ (JNL)	TD00 */
	 MRJEDT		*mrjcedt;		/* ｹﾞﾝ ﾍﾝｼｭｳ ﾘｮｳｲｷ ｱﾄﾞﾚｽ (JNL)	TD00 */
	 MRJEDT		*mrjckst;		/* ｾﾝﾄｳ ﾍﾝｼｭｳ ﾘｮｳｲｷ ｱﾄﾞﾚｽ (KJ)	TD42 */
	 MRJEDT		*mrjcked;		/* ｹﾞﾝ ﾍﾝｼｭｳ ﾘｮｳｲｷ ｱﾄﾞﾚｽ (KJ)	TD42 */
	 void		(*mrjcfnc)();	/* KJ ﾍﾝｼｭｳ ﾌｶｶﾝｽｳ ｱﾄﾞﾚｽ			 */
	 long		mrjckjo;		/* ﾚｺｰﾄﾞﾅｲ KJ ｵﾌｾｯﾄ					 */
	 long		mrjckja;		/* KJ ﾃﾞｰﾀ ｱﾄﾞﾚｽ					 */
	 long		mrjcfd3;		/* ｾﾞﾝｼﾞﾂ KJ ﾌｧｲﾙﾃﾞｨｽｸﾘﾌﾟﾀ		TD00 */
	 long		*mrjceo1;		/* EOF ｵﾌｾｯﾄ ｶｸﾉｳ ｱﾄﾞﾚｽ (fd1)	TD42 */
	 long		*mrjceo2;		/* EOF ｵﾌｾｯﾄ ｶｸﾉｳ ｱﾄﾞﾚｽ (fd2)	TD42 */
	 long		*mrjceo3;		/* EOF ｵﾌｾｯﾄ ｶｸﾉｳ ｱﾄﾞﾚｽ (fd3)	TD42 */
	 long		*mrjcbof;		/* BOF ｵﾌｾｯﾄ ｶｸﾉｳ ｱﾄﾞﾚｽ				 */
	 MRJRBF		*mrjcrbp;		/* ﾖﾐｺﾐ ﾊﾞｯﾌｧ ｾﾝﾄｳ ｱﾄﾞﾚｽ 			 */
	 MRJRBF		*mrjcrbp2;		/* 読込みﾊﾞﾂﾌｱ先頭ｱﾄﾞﾚｽ(副系)	TD22 */
								/*							CT0889   */
	 char		mrjcjut[8];		/* ｵｰﾌﾟﾝ時刻					TD67 */
	 MRJBBF		*mrjcbbp;		/* ｲｯｶﾂ ﾖﾐｺﾐ ﾊﾞｯﾌｧ ｾﾝﾄｳ ｱﾄﾞﾚｽ CT1211 */
};
typedef struct mrjcf MRJCF;
extern MRJCF *mrjcfp;

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	 JCF ﾉ ｵｰﾌﾟﾝ ﾓｰﾄﾞ												 */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
								/* 不用ﾃﾞﾌｧｲﾝ削除(1行)			TD@1 */
#define		MRJRAF	0x0040		/* RCVﾓｰﾄﾞ(=0), APﾓｰﾄﾞ(=1) ﾌﾗｸﾞ		 */
#define		MRJBTF	0x0020		/* ｾﾞﾝｼﾞﾂ(=0), ﾄｳｼﾞﾂ(=1) ﾌﾗｸﾞ		 */
#define		MRJOPF	0x0010		/* ﾌｧｲﾙ ｵｰﾌﾟﾝ(=1) ﾌﾗｸﾞ				 */
#define		MRJENF	0x0008		/* TCT ENQ ﾖｳ ﾌﾖｳ ﾌﾗｸﾞ				 */
#define		MRJNXF	0x0004		/* 待機面ｱｸｾｽﾌﾗｸﾞ				TD83 */

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	 JCF ﾉ ｽﾃｰﾀｽ													 */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define		MRJENQF	0x0080		/* ｼｹﾞﾝ ｾﾝﾕｳ ﾁｭｳ(=1) ﾌﾗｸﾞ			 */

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	 JCT ﾉ ｼﾞｬ-ﾅﾙ ｽﾃ-ﾀｽ ﾉ ﾁｪｯｸ										 */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
								/* 不用ﾛｼﾞｯｸ削除(2行)			TD27 */
								/* 下の行						TD42 */
#define		MRJCHK(kind,usem)	( (kind=='J') ? \
				(mrjcfp->mrjctct->ttctjnls[usem-1] & TTCTJERR) :\
				(mrjcfp->mrjctct->ttctkjst[usem-1] & TTCTKJERR) )

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	 KJ ﾌﾗｸﾞ 														 */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define		MRJKJON		0x01		/* KJ ﾌﾗｸﾞ ON					 */
#define		MRJKJOFF	0x00		/* KJ ﾌﾗｸﾞ OFF					 */

