/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ｼﾞｬｰﾅﾙﾚｺｰﾄﾞﾉ ﾃｲｷﾞﾌｧｲﾙ(mrjnl.h)								 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ｼﾞｬｰﾅﾙ ｼｭﾄｸ													 */
/*		ｼﾞｬｰﾅﾙ ﾀﾞﾝﾌﾟ												 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ										 */
/*		ｻｸｾｲ ｼｬ : ｵﾊﾞﾀ ﾄｼｺ											 */
/*		ﾍﾝｺｳ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ										 */
/*		ﾍﾝｺｳ ｼｬ : ﾉｸﾞﾁ ﾏｽｵ			     '87/10/01 (L01)			 */
/*				  (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) --- STC395			 */
/*		ﾍﾝｺｳ ｼｬ : 山下　元			     '93/12/20 					 */
/*				  (AJの廃止に伴う削除)						TD-41	 */
/*				  (KJ分離に伴う変更)						TD-42	 */
/*				  (ﾌﾟﾛｾｽ最大数拡張に伴う変更)				TD-57	 */
/*				  (BKUP中ｼﾞｬｰﾅﾙ取得)						TD-67	 */
/*				  (SMP日付導入に伴う変更)					TD-92	 */
/*																	 */
/*********************************************************************/
#define	MRJDTSZ		4
#define	MRJITMTYP	0x01
#define	MRJRECTYP	0x02

/*********************************************************************/
/*		JVC (ﾏｴ)													 */
/*********************************************************************/
struct mrjvc1{
	 char	mrjvstt[4];			/* ﾁｪｯｸ ﾊﾟﾀｰﾝ						 */
	 char	mrjvtm1[8];			/* ｼｭﾄｸ ﾋﾂﾞｹ ｼﾞｺｸ					 */
};
typedef struct mrjvc1 MRJVC1;

/*********************************************************************/
/*		SMP ｲﾝﾃﾞｯｸｽ													 */
/*********************************************************************/
struct mrjsmp{
	 char	mrjsatm[8];			/* AP日付時刻					TD92 */
	 short	mrjspno;			/* ﾌﾟﾛｾｽ ｴﾝﾄﾘ ｽｳ					 */
	 char	mrjskjf;			/* KJﾚｺｰﾄﾞ存在ﾌﾗｸﾞ				TD42 */
	 char	mrjsjmc;			/* JNL面切替中ｽﾃｰﾀｽ				TD67 */
	 char	mrjsjls[2];			/* JNLｽﾃｰﾀｽ						TD67 */
	 char	mrjskjs[2];			/* KJｽﾃｰﾀｽ						TD42 */
	 long	mrjskjo;			/* KJ書き込みｵﾌｾｯﾄ				TD42 */
	 char	mrjspst[128];		/* ﾌﾟﾛｾｽ ｽﾃｰﾀｽ					TD57 */
};
typedef struct mrjsmp MRJSMP;

/*********************************************************************/
/*		ｼﾞｬｰﾅﾙ ﾚｺｰﾄﾞ												 */
/*********************************************************************/
struct mrjnl{
	 long	mrjnsiz;			/* ﾚｺｰﾄﾞ ﾁｮｳ		 				 */
	 long	mrjnrno;			/* ﾚｺｰﾄﾞ ﾂｳﾊﾞﾝ 		 				 */
	 short	mrjnpct;			/* pct ｴﾝﾄﾘｰ ﾊﾞﾝｺﾞｳ 	 			 */
	 char	mrjnrtp;			/* ﾚｺｰﾄﾞ ｼｭﾍﾞﾂ			 			 */
	 char	mrjnyob;			/*  ﾖﾋﾞ				 				 */
	 char	mrjngpc[4];			/* ｸﾞﾙｰﾌﾟｺｰﾄﾞ						 */
	 char	mrjnsg1[4];			/* ﾆｭｳﾘｮｸ ｻﾌﾞｸﾞﾙｰﾌﾟｺｰﾄﾞ 			 */
	 char	mrjnsg2[4];			/* ｺｳｼﾝ ｻﾌﾞｸﾞﾙｰﾌﾟｺｰﾄﾞ 				 */
	 short	mrjntno;			/* ﾀﾝﾏﾂ ﾊﾞﾝｺﾞｳ						 */
	 short	mrjndtp;			/* ﾚｺｰﾄﾞﾅｲ ﾃﾞｰﾀ ｼｭﾍﾞﾂ			 	 */
};
typedef struct mrjnl MRJNL;

/*********************************************************************/
/*		JVC (ｳｼﾛ)													 */
/*********************************************************************/
struct	mrjvc2{
	 char	mrjvtm2[8];			/* ｼｭﾄｸ ﾋﾂﾞｹｼﾞｺｸ 					 */
	 char	mrjvend[4];			/* ﾁｪｯｸ ﾊﾟﾀｰﾝ						 */
};
typedef struct mrjvc2 MRJVC2;

/*********************************************************************/
/*		ﾃﾞｰﾀ ﾉ ﾍｯﾀﾞ		 											 */
/*********************************************************************/
struct	mrjhead{
	 char	mrjhdid[2];			/* ﾃﾞｰﾀ ID					 		 */
	 short	mrjhlen;			/* 1ｱｸｾｽﾌﾞﾝ ﾃﾞｰﾀﾁｮｳ					 */
};
typedef struct mrjhead MRJHEAD;

/*********************************************************************/
/*		FJ (ﾌｧｲﾙ ｺｳｼﾝ ﾃﾞｰﾀ)											 */
/*********************************************************************/
struct mrjfj{
	 MRJHEAD mrjfjhd;			/* ﾃﾞｰﾀ ID , ﾃﾞｰﾀ ﾁｮｳ				 */
	 char	 mrjfnam[16];		/* ﾌｧｲﾙ ﾒｲ							 */
	 long	 mrjflid;			/* FMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ					 */
	 unsigned char	mrjfcnt;	/* ﾃﾞｰﾀ ｺｽｳ							 */
	 char	 mrjftyp;			/* ｼｭﾄｸ ｼｭﾍﾞﾂ						 */
	 short	 mrjflen;			/* ﾚｺｰﾄﾞ ﾁｮｳ						 */
	 long	 mrjfadr;			/* ﾚｺｰﾄﾞ ｱﾄﾞﾚｽ						 */
};
typedef struct mrjfj MRJFJ;

/*********************************************************************/
/*		TJ (ﾃｰﾌﾞﾙ ｺｳｼﾝ ﾃﾞｰﾀ)										 */
/*********************************************************************/
struct mrjtj{
	 MRJHEAD mrjtjhd;			/* ﾃﾞｰﾀ ID , ﾃﾞｰﾀ ﾁｮｳ				 */
	 char	 mrjtnam[4];		/* ﾃｰﾌﾞﾙ ﾒｲ							 */
	 unsigned char	mrjtcnt;	/* ﾃﾞｰﾀ ｺｽｳ							 */
	 char	 mrjttyp;			/* ｼｭﾄｸ ｼｭﾍﾞﾂ						 */
	 short	 mrjtnum;			/* ｺﾍﾞﾂﾌﾞ ﾊﾞﾝｺﾞｳ					 */
	 long	 mrjtofs;			/* ﾒﾓﾘ ｵﾌｾｯﾄ						 */
};
typedef struct mrjtj MRJTJ;

/*********************************************************************/
/*		FJ ﾄ TJ ﾉ ｺｳｼﾝﾃﾞｰﾀ ﾌﾞﾌﾞﾝ									 */
/*********************************************************************/
struct mrjdt{
	 short	mrjdofs;			/* ｺｳｼﾝﾃﾞｰﾀ ｵﾌｾｯﾄ					 */
	 short	mrjdlen;			/* ｺｳｼﾝﾃﾞｰﾀ ﾁｮｳ						 */
	 char	mrjdata[MRJDTSZ];	/* ｺｳｼﾝﾃﾞｰﾀ							 */
};
typedef struct mrjdt MRJDT;

/*********************************************************************/
/*		KJ (ｶﾝｼﾞｮｳ ｼｮｳｺﾞｳ ﾃﾞｰﾀ)										 */
/*********************************************************************/
struct mrjkj{
	 MRJHEAD mrjkjhd;			/* ﾃﾞｰﾀ ID , ﾃﾞｰﾀ ﾁｮｳ				 */
	 char	 mrjkdat[MRJDTSZ];	/* ｶﾝｼﾞｮｳ ｼｮｳｺﾞｳ ﾃﾞｰﾀ				 */
};
typedef struct mrjkj MRJKJ;

								/* AJ廃止に伴う削除(7行)		TD41 */
/*********************************************************************/
/*		VJ (ﾎﾞﾘｭｰﾑ ｼｮｳｶﾞｲ ﾃﾞｰﾀ)										 */
/*********************************************************************/
struct mrjvj{
	 MRJHEAD mrjvjhd;			/* ﾃﾞｰﾀ ID , ﾃﾞｰﾀ ﾁｮｳ				 */
	 short	 mrjvpen;			/* ｼｮｳｶﾞｲ PVT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	 short	 mrjvfen;			/* ｼｮｳｶﾞｲ ﾊｯｾｲ ﾌｧｲﾙ FMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ	 */
	 long	 mrjvdtl;			/* ｼｮｳｶﾞｲ ｼｮｳｻｲ ｼﾞｮｳﾎｳ				 */
	 char	 mrjvdat[8];		/* ｼｮｳｶﾞｲ ﾊｯｾｲ ﾋﾂﾞｹ ｼﾞｺｸ			 */
};
typedef struct mrjvj MRJVJ;

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*	 KJﾚｺｰﾄﾞ存在ﾌﾗｸﾞ											TD00 */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
#define		MRJEXREC	0x01		/* 同一ﾄﾗﾝｻﾞｸｼｮﾝのKJあり	TD42 */
#define		MRJNOREC	0x00		/* 同一ﾄﾗﾝｻﾞｸｼｮﾝのKJなし	TD42 */

