/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		ŽÎŽÞŽØŽ­Ž°ŽÑ ŽºŽËŽßŽ° ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mrl.h)								 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽÎŽÞŽØŽ­Ž°ŽÑ ŽºŽËŽßŽ° Ž¼Ž®ŽØ												 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽÀŽ¹Ž³ŽÁ Ž¼ŽÝŽ²ŽÁ											 */
/*		Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÀŽ¹Ž³ŽÁ Ž¼ŽÝŽ²ŽÁ											 */
/*		ŽÍŽÝŽºŽ³Ž¼ŽÔ : Ž½Ž½ŽÞŽ· ŽµŽ»ŽÑ			    '89/03/01 (L01)				 */
/*				(Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³Ž¼ŽÞ Ž±ŽÎŽÞŽ°ŽÄ Ž·ŽÉŽ³ ŽÉ ŽÂŽ²Ž¶)		--- TC2419	 */
/*      ÊÑ¹¹¼Ô : ¿ù²¬¡¡¹îÌé              94/02/03                    */
/*      ÊÑ¹¹¼Ô : ¿ù²¬¡¡¹îÌé              95/02/22                    */
/*				(ŽÎŽÞŽØŽÕ-ŽÑÊÄºÉÄÌÃÎºï½ü¤ËÈ¼¤¦ÊÑ¹¹)	TD-47(CT0880)ST1751	 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	Ž¼Ž­Ž³ŽØŽ®Ž³ ŽºŽ°ŽÄŽÞ 													 */
/*********************************************************************/
#define MRLNORMAL	0L		/*	Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³						 */
#define MRLNORCV	-1L		/*	ŽØŽ¶ŽÊŽÞŽØ ŽÌŽÖŽ³ Ž¼Ž½ŽÃŽÑ						 */
#define MRLIVPARM	-2L		/*	Ž·ŽÄŽÞŽ³ ŽÊŽßŽ×ŽÒŽÀ Ž´Ž×Ž°						 */
#define MRLTYPERR	-3L		/*	Ž²Ž½ŽÞŽÚŽ¶ŽÉ ŽÎŽÞŽØŽ­Ž°ŽÑ ŽÉ Ž¿Ž³ŽÁŽ¼Ž­ŽÍŽÞŽÂ Ž¶ŽÞ ŽÌŽÃŽ·		 */
#define MRLVOLERR	-4L		/*	ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž®Ž³Ž¶ŽÞŽ²ŽÁŽ­Ž³					 */
#define MRLSIZERR	-5L		/*	ŽÛŽÝŽØŽ¾Ž¸ŽÀŽÁŽ®Ž³ ŽÏŽÀŽÊ ŽÎŽÞŽØŽ­Ž°ŽÑŽ»Ž²Ž½ŽÞ Ž¶ŽÞ ŽÁŽ¶ŽÞŽ³	 */
#define MRLMNTERR	-6L		/*	ŽºŽËŽßŽ°Ž»Ž· ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¶ŽÞ ŽÏŽ³ŽÝŽÄ ŽÁŽ­Ž³			 */
#define MRLTBLERR	-7L		/*	ŽÃŽ°ŽÌŽÞŽÙ Ž´Ž×Ž°							 */
							/*  ŽÎŽÞŽØŽÕ-ŽÑÊÄºÉÄÌÃÎºï½ü¤ËÈ¼¤¦ºï½ü(1¹Ô)	 */
							/*  						TD47(CT0880) */
#define MRLCPSTOP	-9L		/*	ŽÌŽßŽÛŽ¾Ž½ Ž·Ž®Ž³Ž¾Ž² Ž¼Ž­Ž³ŽØŽ®Ž³					 */
#define MRLMIOERR	-10L	/*	ŽºŽËŽßŽ°ŽÓŽÄ I/O Ž´Ž×Ž°						 */
#define MRLSIOERR	-11L	/*	ŽºŽËŽßŽ°Ž»Ž· I/O Ž´Ž×Ž°						 */
#define MRLOTHERR	-12L	/*	ŽÎŽÞŽØŽ­Ž°ŽÑŽ±Ž¸Ž¾Ž½Ž¼ŽÞ ŽÉ Ž´Ž×Ž°(I/OŽ´Ž×Ž° Ž²Ž¶ŽÞŽ²)		 */
#define MRLOSERR	-13L	/*	ROS Ž¼Ž½ŽÃŽÑ ŽºŽ°ŽÙ Ž´Ž×Ž°					 */
#define MRLNOMEM	-14L	/*	ŽÒŽÓŽØ ŽÌŽÞŽ¿Ž¸							 */
#define	MRLSCSIHNG	-15L	/*	SCSIŽÊŽÝŽ¸ŽÞ(ŽØŽÄŽ×Ž²²ó¿ôÆâ)			TD61 */
#define	MRLRTRYOVER	-16L	/*	SCSIŽÊŽÝŽ¸ŽÞ(ŽØŽÄŽ×Ž²ŽµŽ°ŽÊŽÞŽ°)				TD61 */

/*********************************************************************/
/*	ŽÍŽÝŽ·Ž¬Ž¸ŽÁ															 */
/*********************************************************************/
#define MRLMSGNOM	-20L	/*	ŽÀ ŽÌŽßŽÛŽ¾Ž½ Ž¶Ž×ŽÉ Ž¼ŽÞŽ­Ž¼ŽÝ					 */
#define MRLGETCPY1	-21L	/*	ŽºŽËŽßŽ° Ž¼Ž®ŽØ 1 ŽÉ Ž¹Ž¯Ž¶ Ž¦ Ž¼ŽÞŽ­Ž¼ŽÝ			 */
#define MRLGETCPY2	-22L	/*	ŽºŽËŽßŽ° Ž¼Ž®ŽØ 2 ŽÉ Ž¹Ž¯Ž¶ Ž¦ Ž¼ŽÞŽ­Ž¼ŽÝ			 */
#define MRLIOERR	-23L	/*	I/O Ž´Ž×Ž°								 */

/*********************************************************************/
/*	MRLCB (Ž·Ž®Ž³ŽÂŽ³ Ž¼ŽÞŽ®Ž³ŽÎŽ³ Ž¾Ž¯ŽÃŽ² ŽØŽ®Ž³Ž²Ž·)									 */
/*********************************************************************/
struct mrlcb{
	 char		mrlcblid[4];	/* ŽÌŽÞŽÛŽ¯Ž¸ Ž¼Ž·ŽÍŽÞŽÂŽ¼						 */
	 char		*mrlcfnm1;		/* ŽºŽËŽßŽ°ŽÓŽÄ ŽÌŽ§Ž²ŽÙŽÒŽ² Ž±ŽÄŽÞŽÚŽ½				 */
	 char		*mrlcfnm2;		/* ŽºŽËŽßŽ°Ž»Ž· ŽÌŽ§Ž²ŽÙŽÒŽ² Ž±ŽÄŽÞŽÚŽ½				 */
	 short		mrlcmote;		/* ŽºŽËŽßŽ°ŽÓŽÄ Ž´ŽÝŽÄŽØ ŽÊŽÞŽÝŽºŽÞŽ³				 */
	 short		mrlcsake;		/* ŽºŽËŽßŽ°Ž»Ž· Ž´ŽÝŽÄŽØ ŽÊŽÞŽÝŽºŽÞŽ³				 */
	 char		mrlctyp1;		/* ŽºŽËŽßŽ°ŽÓŽÄ Ž¿Ž³ŽÁ Ž¼Ž­ŽÍŽÞŽÂ					 */ 
	 char		mrlctyp2;		/* ŽºŽËŽßŽ°Ž»Ž· Ž¿Ž³ŽÁ Ž¼Ž­ŽÍŽÞŽÂ					 */
	 short		mrlcmdid;		/* ŽÓŽ¼ŽÞŽ­Ž°ŽÙID						TD?? */
	 long		mrlcsize;		/* ŽÎŽÞŽØŽ­Ž°ŽÑ Ž»Ž²Ž½ŽÞ						 */
	 long		mrlcsect;		/* ŽÛŽÝŽØ Ž¾Ž¸ŽÀ ŽÁŽ®Ž³						 */
	 short		mrlcmino;		/* Ž¿Ž³ŽÁ Ž¼Ž·ŽÍŽÞŽÂŽ¼						 */
	 short		mrlcyob1;		/* ŽÖŽËŽÞ1								 */
	 long		mrlcrqt1;		/* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ 1					 */
	 long		mrlcrqt2;		/* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ 2					 */
	 long		mrlcrqt3;		/* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ 3					 */
	 char		*mrlcmgbf;		/* ŽÃŽÞŽÝŽÌŽÞŽÝ Ž¼ŽÞŽ­Ž¼ŽÝ ŽÊŽÞŽ¯ŽÌŽ§ Ž±ŽÄŽÞŽÚŽ½			 */
	 char		*mrlcpbf1;		/* ŽºŽËŽßŽ° ŽÊŽÞŽ¯ŽÌŽ§1 Ž±ŽÄŽÞŽÚŽ½				 */
	 char		*mrlcpbf2;		/* ŽºŽËŽßŽ° ŽÊŽÞŽ¯ŽÌŽ§2 Ž±ŽÄŽÞŽÚŽ½				 */
	 long		mrlccprs;		/* ŽºŽËŽßŽ° Ž¼Ž®ŽØ ŽØŽ»ŽÞŽÙŽÄ					 */
	 long		mrlcioer;		/* I/O Ž´Ž×Ž° ŽºŽ°ŽÄŽÞ						 */
	 long		mrlcdtal;		/* ¾ÜºÙ¾ðÊó						TD?? */
};
typedef struct mrlcb MRLCB;


/*********************************************************************/
/*	Ž¼Ž½ŽÃŽÑ ŽºŽ°ŽÙ Ž´Ž×Ž° ŽºŽ°ŽÄŽÞ Ž¶Ž¸ŽÉŽ³ Ž²Ž·										 */
/*********************************************************************/
extern	long	mrlroserr;									/* (L01) */
#define	MRLSETCOD(p1)	mrlroserr = p1						/* (L01) */
