/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		ŽÛŽÝŽØŽÎŽÞŽØŽ­Ž°ŽÑ ŽÐŽÀŽÞŽ¼Ž×ŽÍŽÞŽÙ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ² ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mrlabel.h)			 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		Ž¼ŽÞŽ¬Ž°ŽÅŽÙ Ž¼Ž­ŽÄŽ¸													 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽÔŽÏŽ¸ŽÞŽÁ ŽÏŽ»ŽËŽÛ					 					 */
/*		Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÔŽÏŽ¸ŽÞŽÁ ŽÏŽ»ŽËŽÛ										 */
/*		ŽÍŽÝŽºŽ³ Ž¼Ž¬ :													 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ŽÛŽÝŽØŽÎŽÞŽØŽ­Ž°ŽÑ ŽÐŽÀŽÞŽ¼Ž×ŽÍŽÞŽÙ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²									 */
/*********************************************************************/
struct	mrvlabl{
	char	mrvname[6];				/* ŽÛŽÝŽØŽÎŽÞŽØŽ­Ž°ŽÑ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ² 			 */
	short	mrvdum1;				/*  ŽÖ  ŽËŽÞ						 */
	long	mrvvadd;				/* VTOC Ž±ŽÄŽÞŽÚŽ½ 					 */
	long	mrvtbls;				/* FLCB Ž¶ŽÝŽØŽÃŽ°ŽÌŽÞŽÙ Ž»Ž²Ž½ŽÞ			 */
	long	mrvnum;					/* FLCB ŽºŽ½Ž³						 */
	short	mrvsize;				/* FLCB Ž»Ž²Ž½ŽÞ					 */
	short	mrvsect;				/* ŽÛŽÝŽØŽ¾Ž¸ŽÀ ŽÁŽ®Ž³ 					 */
	char	mrvextn[8];				/* ŽØŽÖŽ³Ž²Ž· Ž¶ŽÝŽØŽÌŽ§Ž²ŽÙ EXTENT Ž¼ŽÞŽ®Ž³ŽÎŽ³	 */
};
typedef struct mrvlabl MRVLABL;
