/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		RCV ŽÏŽ¸ŽÛ ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mrmac.h)									 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽØŽ¶ŽÊŽÞŽØ Ž·Ž®Ž³ŽÂŽ³													 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ											 */
/*		Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ							 				 */
/*		ŽÍŽÝŽºŽ³ Ž¼Ž¬ : 													 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	RCV ŽÅŽ² ŽÏŽ¸ŽÛ ŽÃŽ²Ž·ŽÞ                                           		 */
/*********************************************************************/
											/*  ŽÃŽ°ŽÌŽÞŽÙŽ±ŽÄŽÞŽÚŽ½			 */
#define	MRTBLAD(p1,p2) ((p2) ? (char *)p1 + sizeof(TCOMPAT) \
									    + (unsigned char)p1->tcomsbps \
									    + (p1->tcomprsl * (p2 - 1)) \
						   : (char *)p1 + sizeof(TCOMPAT))
											/*  Ž´Ž×- Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÉ Ž¾Ž¯ŽÃŽ²    */
#define	MROSERR(p1,p2)	{ pscparea.pscoseki=p1;pscparea.pscosede=p2; }
#define	MRBITON(p1,P2)	(p1 |= P2)			/*  ŽËŽÞŽÂŽÄ Žµ ON ŽÆ Ž½ŽÙ 		 */
#define	MRBITOFF(p1,P2)	(p1 &= ~(P2))		/*  ŽËŽÞŽÂŽÄ Žµ OFF ŽÆ Ž½ŽÙ 	 */
											/*  ŽÃŽ°ŽÌŽÞŽÙ ŽÉ ŽµŽµŽ·Ž» 		 */
#define	MRTBLSIZE(p1)   sizeof(TCOMPAT) + \
						(unsigned char)((p1)->tcomsbps) + \
						((p1)->tcomprsl * ((p1)->tcomefen))
#define	MRCTOI(p1)		(p1 & 0x00FFL)		/* 	 */	
#define	MRLTOU(p1)		((p1)-('a'-'A'))	/* ŽºŽÓŽ¼ŽÞ ŽµŽµŽÓŽ¼ŽÞ ŽÍŽÝŽ¶ŽÝ		 */

