/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム   ミラーリング制御同期関数(mr_mxxxx系)	*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 ミラーリング制御同期機能共通			*/
/*＜サービス項目ＩＤ＞				 ０６０									*/
/*＜モジュール名＞					 ミラーリング制御同期関数共通ヘッダ		*/
/*＜モジュールＩＤ＞				 										*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 杉岡  克也								*/
/*＜設計年月日＞					 １９９５年　１月２３日					*/
/*＜設計修正者名＞															*/
/*＜設計修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 杉岡	克也							*/
/*＜ソース作成年月日＞				 １９９５年  １月２８日					*/
/*＜ソース修正者名＞			     杉岡  克也								*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９５年  ５月２４日	CT1043(ST2749)	*/
/*＜ソース修正者名＞			     赤塚  一元								*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９５年０８月０８日	ST3026			*/
/*＜ソース修正者名＞			     杉岡  克也								*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９５年１１月２３日	CT1165(ST3810)	*/
/*															CT1168(ST3813)	*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*    共通																	*/
/*																			*/
/****************************************************************************/

/****************************************************************************/
/*		ミラーリング制御同期機能固有返却値									*/
/****************************************************************************/
/****************************************/
/*	正常								*/
/****************************************/
#define	MRMNORMAL		0L				/* 正常終了							*/
#define	MRMNORMX		1L				/* 条件付き正常終了					*/

/****************************************/
/*  基本ｴﾗ-(0xffffffff〜f7)				*/
/****************************************/
#define	MRMNOMEM		-1L				/* ﾒﾓﾘ不足							*/
#define	MRMBUFERR		-2L				/* ﾊﾞﾂﾌｱ解放失敗					*/
#define	MRMMNTERR		-3L				/* ﾏｳﾝﾄ失敗							*/
#define	MRMUMTERR		-4L				/* ｱﾝﾏｳﾝﾄ失敗						*/
#define	MRMUMTFERR		-5L				/* 強制ｱﾝﾏｳﾝﾄ失敗					*/
#define MRMTAPERR		-6L				/* 特定APがPCTに存在しない			*/
#define	MRMSNAPERR		-7L				/* 電文送信(ossenmsp)失敗			*/
#define MRMRPCTERR		-8L				/* RBIﾌﾟﾛｾｽがPCTに未定義	CT1043	*/

/****************************************/
/*  ﾃ-ﾌﾞﾙｴﾗ-(0xfffffff6〜ed)			*/
/****************************************/
#define	MRMSSTERR		-10L			/* TSSTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMCSTERR		-11L			/* TCSTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMTCTERR		-12L			/* TTCTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMJCTERR		-13L			/* TJCTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMRBTERR		-14L			/* TRBTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMMRTERR		-15L			/* TMRTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMVMTERR		-16L			/* TVMTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMPVTERR		-17L			/* TPVTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMFMTERR		-18L			/* TFMTﾃ-ﾌﾞﾙｴﾗ-						*/
#define	MRMSGTERR		-19L			/* TSGTﾃ-ﾌﾞﾙｴﾗ-						*/

/****************************************/
/*  ﾐﾗ-ﾘﾝｸﾞ制御ｴﾗ-(0xffffffec〜d9)		*/
/****************************************/
#define	MRMICLERR1		-20L			/* 状態遷移(osioctl)失敗            */
#define	MRMICLERR2		-21L			/* 復旧コピー(osioctl)失敗          */
#define	MRMICLERR3		-22L			/* 状態取得(osioctl)失敗            */
#define	MRMICLERR4		-23L			/* SPMﾘｾﾂﾄ(osioctl)失敗  	        */
#define	MRMICLERR5		-24L			/* SPM情報変更/登録(osioctl)失敗	*/
#define	MRMICLERR6		-25L			/* SPM情報取得(osioctl)失敗         */
#define	MRMICLERR7		-26L			/* SPMｱｸｾｽ抑止情報取得(osioctl)失敗 */
#define	MRMICLERR8		-27L			/* SPMｱｸｾｽ抑止/抑止解除(osioctl)失敗*/
#define	MRMICLERR9		-28L			/* 更新領域ﾛｸﾞ取得(osioctl)失敗     */
#define	MRMICLERRA		-29L			/* 更新領域ﾛｸﾞ設定(osioctl)失敗     */
#define	MRMMCERR1		-30L			/* ﾐﾗ-ﾘﾝｸﾞ制御矛盾(復旧ｺﾋﾟ-中)		*/
#define	MRMMCERR2		-31L			/* ﾐﾗ-ﾘﾝｸﾞ制御矛盾(使用中)			*/
#define	MRMMCERR3		-32L			/* ﾐﾗ-ﾘﾝｸﾞ制御矛盾(復旧状態)		*/
#define	MRMMCERR4		-33L			/* ﾐﾗ-ﾘﾝｸﾞ制御矛盾(引継復旧状態)	*/

/****************************************/
/*  ﾐﾗ-特殊ﾌｱｲﾙｴﾗ-(0xffffffd8〜cf)		*/
/****************************************/
#define MRMCONERR		-40L			/* ﾐﾗ-特殊ﾌｱｲﾙｺﾈｸﾄ失敗              */
#define MRMOPNERR		-41L			/* ﾐﾗ-特殊ﾌｱｲﾙｵ-ﾌﾟﾝ失敗             */
#define MRMCLSERR		-42L			/* ﾐﾗ-特殊ﾌｱｲﾙｸﾛ-ｽﾞ失敗             */
#define MRMDCONERR		-43L			/* ﾐﾗ-特殊ﾌｱｲﾙﾃﾞｲｽｺﾈｸﾄ失敗          */

/****************************************/
/*  SPMﾌｱｲﾙｴﾗ-(0xffffffce〜bb)			*/
/****************************************/
#define	MRMSPMFCOERR	-50L			/* SPMﾌｧｲﾙコネクト失敗				*/
#define	MRMSPMFOERR		-51L			/* SPMﾌｧｲﾙオープン失敗				*/
#define	MRMSPMFRERR		-52L			/* SPMﾌｧｲﾙリード失敗				*/
#define	MRMSPMFWERR		-54L			/* SPMﾌｧｲﾙライト失敗				*/
#define	MRMSPMFCLERR	-55L			/* SPMﾌｧｲﾙクローズ失敗				*/
#define	MRMSPMFDCERR	-56L			/* SPMﾌｧｲﾙディスコネクト失敗		*/
#define	MRMSPMFGERR		-57L			/* SPMﾌｧｲﾙ情報取得失敗				*/
#define	MRMSPMFBGERR	-58L			/* SPMﾌｧｲﾙ展開バッファ獲得失敗		*/
#define	MRMSPMFBFERR	-59L			/* SPMﾌｧｲﾙ展開バッファ解放失敗		*/
#define	MRMSPMFNC		-60L			/* SPMﾌｧｲﾙ無効						*/
#define	MRMSPMFSZER		-61L			/* SPMﾌｧｲﾙサイズエラー(min) ST3026	*/
										/*							CT1165	*/

/****************************************/
/*  JNLﾌｱｲﾙｴﾗ-(0xffffffba〜a7)			*/
/****************************************/
#define MRMJCONERR		-70L			/* JNLﾌｱｲﾙｺﾈｸﾄ失敗              	*/
#define MRMJOPNERR		-71L			/* JNLﾌｱｲﾙｵ-ﾌﾟﾝ失敗     	        */
#define	MRMJREDERR		-72L			/* JNLﾌｱｲﾙ読込み失敗				*/
#define	MRMJWRTERR		-73L			/* JNLﾌｱｲﾙ書込み失敗				*/
#define MRMJCLSERR		-74L			/* JNLﾌｱｲﾙｸﾛ-ｽﾞ失敗  	            */
#define MRMJDCONERR		-75L			/* JNLﾌｱｲﾙﾃﾞｲｽｺﾈｸﾄ失敗          	*/
#define	MRMJDTERR		-76L			/* JNLﾃﾞ-ﾀｴﾗ-						*/
#define	MRMJNLERR1		-77L			/* JNL(1面)二重故障					*/
#define	MRMJNLERR2		-78L			/* JNL(2面)二重故障					*/
#define	MRMKJERR1		-79L			/* KJ(1面)二重故障					*/
#define	MRMKJERR2		-80L			/* KJ(2面)二重故障					*/
#define	MRMJROPNERR		-81L			/* JNL再ｵ-ﾌﾟﾝ失敗			CT1168	*/

/****************************************/
/*  RBIﾌｱｲﾙｴﾗ-(0xffffffa6〜)			*/
/****************************************/
#define MRMRCONERR		-90L			/* RBIﾌｱｲﾙｺﾈｸﾄ失敗              	*/
#define MRMROPNERR		-91L			/* RBIﾌｱｲﾙｵ-ﾌﾟﾝ失敗     	        */
#define	MRMRREDERR		-92L			/* RBIﾌｱｲﾙ読込み失敗				*/
#define MRMRCLSERR		-93L			/* RBIﾌｱｲﾙｸﾛ-ｽﾞ失敗  	            */
#define MRMRDCONERR		-94L			/* RBIﾌｱｲﾙﾃﾞｲｽｺﾈｸﾄ失敗          	*/
#define	MRMRDTERR		-95L			/* RBIﾃﾞ-ﾀｴﾗ-						*/
#define	MRMRBIERR1		-96L			/* RBI(CM)二重故障					*/
#define	MRMRBIERR2		-97L			/* RBI(LM0)二重故障					*/
#define	MRMRBIERR3		-98L			/* RBI(LM1)二重故障					*/

/****************************************/
/*  制御状態							*/
/****************************************/
#define	MRMRMSN		1L					/* 両肺状態							*/
#define MRMRMHR		2L					/* 引継復旧状態（正を元とした）		*/
#define MRMRSHR		3L					/* 引継復旧状態（副を元とした）		*/
#define	MRMRMN		4L					/* 正系片肺							*/
#define	MRMRSN		5L					/* 副系片肺							*/
#define	MRMRMR		6L					/* 復旧状態（正→副）				*/
#define	MRMRSR		7L					/* 復旧状態（副→正）				*/
#define	MRMRMC		8L					/* コピー状態（正→副）				*/
#define	MRMRSC		9L					/* コピー状態（副→正）				*/
#define	MRMRVU		10L					/* 使用中							*/

/****************************************/
/*  ボリューム状態						*/
/****************************************/
#define	MRMVMSERR	11L					/* 両系故障中						*/
#define	MRMVMERR	12L					/* 正系故障中						*/
#define	MRMVSERR    13L					/* 副系故障中						*/
#define MRMVNORM	14L					/* 両系正常							*/

/****************************************/
/*  マウント状態						*/
/****************************************/
#define	MRMNOTUMT	15L					/* ｱﾝﾏｳﾝﾄの失敗したﾎﾞﾘﾕ-ﾑがある		*/

/****************************************/
/*  ＲＢＩ状態							*/
/****************************************/
#define MRMRMSERR	16L					/* 両系故障中						*/
#define	MRMRMERR	17L					/* 正系故障中						*/
#define	MRMRSERR	18L					/* 副系故障中						*/
#define	MRMRMSNORM	19L					/* 両系正常							*/

/****************************************/
/*  ＪＮＬ状態							*/
/****************************************/
#define MRMJMSERR	20L					/* 両系故障中						*/
#define	MRMJMERR	21L					/* 正系故障中						*/
#define	MRMJSERR	22L					/* 副系故障中						*/
#define	MRMJMNORM	23L					/* 暫定正系正常						*/
#define	MRMJSNORM	24L					/* 暫定副系正常						*/
#define	MRMJMSNORM	25L					/* 両系正常							*/
#define	MRMJEOF		26L					/* EOF								*/

/****************************************************************************/
/*		ミラーリング制御同期機能固有define値								*/
/****************************************************************************/
/****************************************/
/* osioctlにて取得した					*/
/*		  構造体osf_mvinfoのstateの値	*/
/****************************************/
#define	MRMIMSK		0xFFFF0000			/* マスク用							*/
#define	MRMIMSN		0x00000000			/* 両肺状態							*/
#define	MRMIMN		0x80000000			/* 正系片肺状態						*/
#define	MRMIMR		0x20000000			/* 正系→副系復旧状態				*/
#define	MRMIMC		0x10000000			/* 正系→副系コピー状態				*/
#define	MRMIMHR		0x01000000			/* 正系→副系引継復旧状態			*/
#define	MRMISN		0x00800000			/* 副系片肺状態						*/
#define	MRMISR		0x00200000			/* 副系→正系復旧状態				*/
#define	MRMISC		0x00100000			/* 副系→正系コピー状態				*/
#define	MRMISHR		0x00010000			/* 副系→正系引継復旧状態			*/
#define	MRMIVU		0x00008000			/* 使用中（ＯＰＥＮ中）				*/

/****************************************/
/* RCVﾌｱｲﾙ収容ﾎﾞﾘﾕ-ﾑの定義				*/
/****************************************/
#define	MRMRVCM		0x01				/* RBI(CM用)処理対象				*/
#define	MRMRVL0		0x02				/* RBI(LM0用)処理対象				*/
#define	MRMRVL1		0x04				/* RBI(LM1用)処理対象				*/
#define	MRMRVJ1		0x08				/* JNL(1面)処理対象					*/
#define	MRMRVK1		0x10				/* KJ(1面)処理対象					*/
#define	MRMRVJ2		0x20				/* JNL(2面)処理対象					*/
#define	MRMRVK2		0x40				/* KJ(2面)処理対象					*/

