/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム   ミラーリング制御同期関数(mr_mxxxx系)	*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 ミラーリング制御同期機能共通			*/
/*＜サービス項目ＩＤ＞				 ０６０									*/
/*＜モジュール名＞					 ミラーリング制御同期関数共通ヘッダ		*/
/*＜モジュールＩＤ＞				 										*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 杉岡  克也								*/
/*＜設計年月日＞					 １９９５年　１月２３日					*/
/*＜設計修正者名＞															*/
/*＜設計修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 杉岡	克也							*/
/*＜ソース作成年月日＞				 １９９５年  １月２８日					*/
/*＜ソース修正者名＞				 杉岡  克也								*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９５年０８月０１日 ST3017			*/
/*＜ソース修正者名＞				 杉岡  克也								*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９５年０９月１４日 ST3417			*/
/*															CT1137(ST3466)	*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*																			*/
/****************************************************************************/
#include	"ttct.h"
#include	"tjct.h"
#include	"trbt.h"
#include	"mrj.h"
#include	"mrjnl.h"

/****************************************************************************/
/*      ＭＲＭＪＣＢ（ミラー同期機能用プロセス管理ブロック（ＪＮＬ））		*/
/****************************************************************************/
struct	mrmjcb
{
	MRJRBF	*mrmjrbf1;					/* JNL読込み領域(正)先頭ｱﾄﾞﾚｽ		*/
	MRJRBF	*mrmjrbf2;					/* JNL読込み領域(副)先頭ｱﾄﾞﾚｽ		*/
	long	mrmbjad1;					/* 1REC前最新読込み位置(正)			*/
	long	mrmbjad2;					/* 1REC前最新読込み位置(副)			*/
	long	*mrmeofs1;					/* 最後尾JNLｵﾌｾﾂﾄ(正)ｱﾄﾞﾚｽ			*/
	long	*mrmeofs2;					/* 最後尾JNLｵﾌｾﾂﾄ(副)ｱﾄﾞﾚｽ			*/
	char	mrmcallm;					/* JNL同期呼出元					*/
	char	mrmjkbn;					/* JNL/KJ媒体区分					*/
	char	mrmusem;					/* 使用面							*/
	char	mrmbflg;					/* 読込みﾊﾞｯﾌｧ解放ﾌﾗｸﾞ		ST3017	*/
	short	mrmfmte;					/* FMTｴﾝﾄﾘ番号						*/
	short	mrmvmtm;					/* VMTｴﾝﾄﾘ番号(正)					*/
	short	mrmvmts;					/* VMTｴﾝﾄﾘ番号(副)					*/
	short	mrmmrte;					/* MRTｴﾝﾄﾘ番号						*/
	char	mrmjvtm1m[8];				/* 最新JVC前取得日付時刻(正)CT1137	*/
	char	mrmjvtm1s[8];				/* 最新JVC前取得日付時刻(副)CT1137	*/
};
typedef	struct	mrmjcb	MRMJCB;

/********************************************/
/*  ＪＮＬ同期呼出元の定義(mrmcallm)		*/
/********************************************/
#define	MRMCALMJRS		0x01			/* mr_mjrsからの呼出				*/
#define	MRMCALMJRS2		0x02			/* mr_mjrs2からの呼出				*/

/********************************************/
/*  読込みバッファ解放フラグの定義(mrmbflg) */
/********************************************/
#define	MRMNOTBUF		0x00			/* バッファ解放不要	ST3017	ST3417  */
#define	MRMMFRBUF		0x01			/* バッファ（正）解放要		ST3417	*/
#define	MRMSFRBUF		0x02			/* バッファ（副）解放要		ST3417	*/

