/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム   ミラーリング制御同期関数(mr_mxxxx系)	*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 ＪＮＬ＆ＲＢＩ同期処理（異常終了時）	*/
/*＜サービス項目ＩＤ＞				 ０６４									*/
/*＜モジュール名＞					 ミラーリング制御同期関数共通ヘッダ		*/
/*＜モジュールＩＤ＞				 										*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 杉岡  克也								*/
/*＜設計年月日＞					 １９９５年　１月２３日					*/
/*＜設計修正者名＞															*/
/*＜設計修正年月日及び修正id＞												*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 杉岡	克也							*/
/*＜ソース作成年月日＞				 １９９５年  ２月２８日					*/
/*＜ソース修正者名＞														*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*																			*/
/****************************************************************************/
#include	"ttct.h"
#include	"trbt.h"
#include	"mrmuse.h"
#include	"mrrbi.h"

/****************************************************************************/
/*      ＭＲＭＲＣＢ（ミラー同期機能用プロセス管理ブロック（ＲＢＩ））		*/
/****************************************************************************/
struct	mrmrcb
{
	TRBTPSZ *mrmrbtp;					/* RBTｱﾄﾞﾚｽ							*/
	long	mrmrfd1;					/* ﾌｱｲﾙ記述子(正)					*/
	long	mrmrfd2;					/* ﾌｱｲﾙ記述子(副)					*/
	MRRBIDX	mrmridp1[2];				/* RBIｲﾝﾃﾞﾂｸｽ(正)格納領域			*/
	MRRBIDX	mrmridp2[2];				/* RBIｲﾝﾃﾞﾂｸｽ(副)格納領域			*/
	long	mrmridl;					/* RBIｲﾝﾃﾞﾂｸｽ長						*/
	char	mrmrdate1[8];				/* RBI取得日時(正)					*/
	char	mrmrdate2[8];				/* RBI取得日時(副)					*/
	char	mrmrgm1;					/* RBI取得面(正)					*/
	char	mrmrgm2;					/* RBI取得面(副)					*/
	char	mrmrkbn;					/* 媒体区分							*/
	char	mrmjnlm;					/* JNL使用面						*/
	short	mrmfmte;					/* FMTｴﾝﾄﾘ番号						*/
	short	mrmvmtm;					/* VMTｴﾝﾄﾘ番号(正)					*/
	short	mrmvmts;					/* VMTｴﾝﾄﾘ番号(副)					*/
	short	mrmmrte;					/* MRTｴﾝﾄﾘ番号						*/
	long	mrmjro[2];					/* JNLﾚｺ-ﾄﾞ書込みｵﾌｾﾂﾄ				*/
	long	mrmkjro[2];					/* KJﾚｺ-ﾄﾞ書込みｵﾌｾﾂﾄ				*/
};
typedef	struct	mrmrcb	MRMRCB;

/********************************************/
/*  ＲＢＩ取得面							*/
/********************************************/
#define	MRMRAM		0x00				/* A面　							*/
#define	MRMRBM		0x01				/* B面　							*/
