/**************************** NTC-SMP-RCV ****************************/
/*																 	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳ ｼｬ ｲｷ ﾃｲｷﾞ(mrmuse.h)						 */
/*																 	 */
/*	2 ｸﾌﾞﾝ															 */
/*		RCV ｷｮｳﾂｳ													 */
/*																 	 */
/*	3 ﾘﾚｷ														 	 */
/*		ｾｯｹｲ ｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲ ｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ						 					 */
/*		ﾍﾝｺｳ ｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'87/10/01 (L01)				 */
/*				  (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) --- STC395			 */
/*		ﾍﾝｺｳ ｼｬ : ﾏﾂｼﾀ ｴｲｼﾞ				'87/12/24 (L02)				 */
/*				  (ｼｮｳｶﾞｲ ｱﾄ ｼｮﾘ ﾌﾟﾛｾｽ ｷﾉｳ ﾂｲｶ)	--- STC559			 */
/*		ﾍﾝｺｳ ｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'88/03/23 (L03)				 */
/*				  (ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ ｷﾉｳ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC911		 */
/*      ﾍﾝｺｳ ｼｬ : ｳﾁﾀﾞ ﾕｳｽｹ             '88/07/29 (L04)				 */
/*                (RBI ﾑｺｳｶ ｷﾉｳ ﾂｲｶ)			    --- TC1229       */
/*		ﾍﾝｺｳｼﾔ  : ｽｽﾞｷ ｵｻﾑ				'89/02/10 (L05)				 */
/*				  (ﾎﾞﾘｭｰﾑ ｼｮｳｶﾞｲ ｼﾞｮｳﾎｳ ﾂｳﾁ ｷﾉｳ ﾂｲｶ) --- TC2368		 */
/*		ﾍﾝｺｳ ｼｬ : ｽｽﾞｷ ｵｻﾑ 				'89/04/15 (L06)				 */
/*				  (SCSI ﾊﾞｽ ﾘｾｯﾄ ｼｮﾘ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC2466	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'89/11/02 (L07)				 */
/*			 	  (ｼｮｳｶﾞｲ ﾎﾞﾘｭｰﾑ ｴﾗｰｼｭﾍﾞﾂ ﾂｳﾁ ｷﾉｳ ﾉ ﾂｲｶ --- TCXXXX	 */
/*      変更者 : 杉岡　克也              93/11/12  TD-00             */
/*                (他TC動作監視に伴う変更)         TD-01             */
/*                (ﾎﾞﾘﾕ-ﾑ閉塞通知削除に伴う変更)   TD-47             */
/*                (SCSIﾘｾﾂﾄ機能の変更に伴う変更)   TD-61             */
/*                (SRCV失敗時復旧に伴う変更)       TD-78             */
/*                (JNL・RBIの初期化に伴う変更)     TD-79             */
/*                (KJ単独ﾊﾞﾂｸｱﾂﾌﾟに伴う変更)       TD-83             */
/*                (ﾎﾞﾘﾕ-ﾑ閉塞単位変更に伴う変更)   TD-90             */
/*      変更者 : 山本　智也              94/11/07  M06               */
/*      (故障ﾎﾞﾘﾕ-ﾑｴﾗｰ種別通知への故障論理ﾎﾞﾘｭｰﾑ識別名追加			)*/
/*      (故障処理票 ST1248											)*/
/*		変更者 : 杉岡  克也				 95/ 2/ 6 					 */
/*                (mr_efcl復活に伴う修正			ST1550)			 */
/*		変更者 : 夛田　透				 95/ 3/ 2 --- CT0894(ST2490) */
/*				  (ﾐﾗｰ同期保証機能追加に伴う修正)  TD-22	 		 */
/*		変更者 : 今井　弘幸				 95/ 3/28 					 */
/*				  (2重故障時面切替機能追加に伴う修正			 	 */
/*				  仕様変更要求書 SSCYXXXX ）		  CT0977(ST2646) */
/*		変更者 : 杉岡  克也				 95/04/18 --- ST1766/ST1767  */
/*                (ｲﾝﾀ-ﾌｴ-ｽｺ-ﾄﾞ1及び2の追加)						 */
/*		変更者 : 今井　弘幸				 95/04/21 --- CT0990(ST2652) */
/*				  (ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ2の追加)								 */
/*		変更者 : 赤塚　一元				 95/05/16 --- CT1039(ST2764) */
/*      変更者 : 山本　智也              95/05/18 --- ST2703 		 */
/*           ( 故障ボリュームエラー種別通知のI/Fｺｰﾄﾞ2追加			)*/
/*           ( ボリューム閉塞処理依頼のI/Fｺｰﾄﾞ2変更					)*/
/*		変更者 : 杉岡  克也				 95/06/28 --- ST2895		 */
/*		変更者 : 赤塚　一元				 95/08/16 --- CT1106(ST3142) */
/*		変更者 : 今井　弘幸				 95/12/11 					 */
/*				  (通常版VRCV用ｲﾝﾀｰﾌｪｰｽｺｰﾄﾞ2の追加)   TD-90			 */
/*＜ソース修正者名＞				 Com'App 山口		 			 */
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９６年４月１０日	ST4008	 */
/*									 (装置間通信用バスリセット機能)	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-005-09										 */
/*改造内容			:バイト反転対応									 */
/*改造日			:2002.11.06										 */
/*改造者			:supply watanabe								 */
/*********************************************************************/

/*********************************************************************/
/*		ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ｹｲｸﾌﾞﾝ ｼｷﾍﾞﾂｼ									 */
/*********************************************************************/
#define     MRMKOWN     0x00        /* 自系識別子               TD01 */
#define		MRMKTU		0x01		/* 現用系識別子             TD01 */
#define		MRMKSH		0x02		/* 予備系識別子             TD01 */

/*********************************************************************/
/*		ﾒｯｾｰｼﾞ ｼｷﾍﾞﾂｼ												 */
/*********************************************************************/
#define		MRMK1		0x03		/* ﾓﾁﾏﾜﾘ ﾒｯｾｰｼﾞ					 */
#define		MRMK2		0x0D		/* ﾘｶﾊﾞﾘ ﾒｯｾｰｼﾞ					 */

/*********************************************************************/
/*		ﾃﾞｰﾀ ｶｸﾉｳｲｷ ｼｭﾍﾞﾂ											 */
/*********************************************************************/
#define		MRMDUSBF	0x01		/* ﾘﾖｳｼｬｶﾞﾜ ﾉ ｿｳｼﾞｭｼﾝ ﾊﾞｯﾌｧ		 */

/*********************************************************************/
/*		ﾃﾞｰﾀ ｼｭﾍﾞﾂ													 */
/*********************************************************************/
#define		MRMDSGLM	0x10		/* ﾀﾝｲﾂ ﾃﾞﾝﾌﾞﾝ					 */

/*********************************************************************/
/*		ｹｲｶﾝ ﾌﾘﾜｹ ﾀｲﾌﾟ												 */
/*********************************************************************/
#define		MRMKPRO		0x01		/* ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ ﾆ ﾖﾙ ﾌﾘﾜｹ		 */

/*********************************************************************/
/*		ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ RCV ｷｮｳﾂｳ ﾌｫ-ﾏｯﾄ						 */
/*********************************************************************/
struct	mrmuse	{
/*********************************************************************/
/*	PRC-005-09  修正 START 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
	long	mrmumk34;				/* ｲﾝﾀﾌｪｰｽｺｰﾄﾞ					 */	/* PRC-005-09 */
/*********************************************************************/
/*	PRC-005-09  修正 END 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
	char	mrmudis;				/* ﾂｳﾁ ｸﾌﾞﾝ						 */
	char	mrmucod;				/* ﾂｳﾁ ｺｰﾄﾞ						 */
	short	mrmuent;				/* ｴﾝﾄﾘ番号						 */
};
typedef	struct	mrmuse	MRMUSE;
/*********************************************************************/
/*	PRC-005-09  修正 START 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
union mrmumk_u	{														/* PRC-005-09 */
	long mrmumk_l;														/* PRC-005-09 */
	struct{																/* PRC-005-09 */
			short			mrmumk3;									/* PRC-005-09 */
			short			mrmumk4;									/* PRC-005-09 */
	} mrmumk_s;															/* PRC-005-09 */
};																		/* PRC-005-09 */
typedef	union	mrmumk_u	MRMUMK34_U;									/* PRC-005-09 */
/*********************************************************************/
/*	PRC-005-09  修正 END 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/

/*********************************************************************/
/*	インターフェースコード１								    TD01 */
/*********************************************************************/
#define		MRMSMSG		0x1000		/* ﾏｽﾀｰｽｹｼﾞｭｰﾗ ｶﾗ ﾉ ﾃﾞﾝﾌﾞﾝ(OCP)	 */
#define		MRMUISRCV	0x2000		/* ｼｽﾃﾑ ﾘｶﾊﾞﾘ					 */
#define		MRMUIVRCV	0x2010		/* ﾎﾞﾘｭｳﾑ ﾘｶﾊﾞﾘ                  */
#define		MRMUIBKUP	0x2020		/* ﾊﾞｯｸ ｱｯﾌﾟ                     */
#define		MRMUIRBI	0x2030		/* RBI ｼｭﾄｸ			             */
#define		MRMUIAVRCV	0x2040		/* VRCV前処理		             */
#define		MRMUISERP	0x2050		/* ｻﾌﾞ故障管理ﾌﾟﾛｾｽ				 */
#define		MRMUIMIRR	0x2060		/* ミラーリング同期保証	CT0894	 */
#define		MRMUIRMAN	0x2070		/* 故障管理                 TD01 */
#define		MRMUIJNL	0x2080		/* ｼﾞｬｰﾅﾙ ｼｭﾄｸ	                 */
#define		MRMUIERRP	0x2090		/* 故障管理ﾌﾟﾛｾｽ            TD01 */
#define		MRMUICERR	0x2326		/* mr_cerr		ST1766/ST1767    */
#define		MRMUICSMP	0x2327		/*	mr_csmp		CT1039			 */

/*********************************************************************/
/*	インターフェースコード２                                    TD01 */
/*********************************************************************/
#define		MRTRMPR		0x0600		/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ ｲﾗｲ ﾃﾞﾝﾌﾞﾝ(OCP)	 */
#define		MRMUICRERR	0x1000		/* RBI二重故障			ST1766   */
#define		MRMUIJEND	0x1000		/* JNLﾆｱｴﾝﾄﾞ			ST1767   */
#define		MRMUIKJEND	0x1001		/* KJﾆｱｴﾝﾄﾞ				ST1767   */
#define		MRMUIEFCL	0x0000 		/* ﾎﾞﾘﾕ-ﾑ閉塞処理依頼	ST2703   */
#define		MRMUIFALT	0x0001 		/* 故障ﾎﾞﾘﾕ-ﾑｴﾗｰ種別通知 ST2703  */
#define		MRMUIJRIC	0x0002		/* JNL･RBI初期化完了通知CT0990   */
#define		MRMUISRA1	0x0003		/*	疑似ＳＭＰ通知１	CT1039	 */
#define		MRMUISRA2	0x0004		/*	疑似ＳＭＰ通知２	CT1039	 */
#define		MRMUISRA3	0x0005		/*	疑似ＳＭＰ通知３	CT1106	 */
#define		MRMUISRA4	0x0006		/*	疑似ＳＭＰ通知４	ST4008	 */
#define		MRMUIRMS1	0x0001		/*	故障ﾎﾞﾘｭｰﾑ回復通知		TD90 */
									/*  （論理ﾎﾞﾘｭｰﾑ情報無し）	TD00 */
#define		MRMUIIMS1	0x0002		/*	ﾎﾞﾘｭｰﾑ復旧情報通知		TD90 */
									/*  （論理ﾎﾞﾘｭｰﾑ情報無し）	TD00 */
#define		MRMUIRMS2	0x0003		/*	故障ﾎﾞﾘｭｰﾑ回復通知		TD90 */
									/*  （論理ﾎﾞﾘｭｰﾑ情報有）	TD00 */
#define		MRMUIIMS2	0x0004		/*	ﾎﾞﾘｭｰﾑ復旧情報通知		TD90 */
									/*  （論理ﾎﾞﾘｭｰﾑ情報有り）	TD00 */

/*********************************************************************/
/*	ﾂｳﾁ ｸﾌﾞﾝ ﾃｲｷﾞ													 */
/*********************************************************************/
#define		MRMUDASK	0x00		/* ｲﾗｲ ﾂｳﾁ						 */
#define		MRMUDCOM	0x01		/* ｶﾝﾘｮｳ ﾂｳﾁ					 */
#define		MRMUDSTA	0x02		/* ｶｲｼ ﾂｳﾁ						 */
#define		MRMUDEND	0x03		/* ｼｭｳﾘｮｳ ﾂｳﾁ					 */
#define		MRMUDTRV	0x04		/* ｺｼｮｳ ﾂｳﾁ						 */
#define		MRMUDREV	0x05		/* ｶｲﾌｸ ﾂｳﾁ						 */

/*********************************************************************/
/*	ﾂｳﾁ ｺｰﾄﾞ ﾃｲｷﾞ(ｲﾗｲ ﾂｳﾁ)											 */
/*********************************************************************/
#define		MRMUARBGET	0x00		/* RBI ﾁｮｸｾﾂ ｼｭﾄｸ ｲﾗｲ			 */
#define		MRMUARBSTA	0x01		/* RBI ﾃｲｼｭｳｷ ｼｭﾄｸ ｶｲｼ ｲﾗｲ		 */
#define		MRMUARBSTP	0X02		/* RBI ﾃｲｼｭｳｷ ｼｭﾄｸ ｼｭｳﾘｮｳ ｲﾗｲ	 */
#define		MRMUARBEND	0X03		/* RBI ｼｭﾄｸ ｼｭｳﾘｮｳ ｲﾗｲ			 */
#define		MRMUAACC6A	0x04		/* ACC#6 ｶｸﾄｸ ｲﾗｲ				 */
#define		MRMUAACC6R	0x05		/* ACC#6 ｶｸﾄｸ ｶｲﾎｳ ｲﾗｲ			 */
#define		MRMUACROS	0x06		/* ｸﾛｽ ｺ-ﾙ ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ	   (L03) */
#define		MRMUAJNL	0x07		/* ｼﾞｬ-ﾅﾙ ｼｭﾄｸ ｲﾗｲ		   (L03) */
#define		MRMUAROS	0x08		/* TRADE故障通知依頼        TD00 */
#define		MRMUARBINV  0X09		/* RBI ﾑｺｳｶ ｼｮﾘ ｲﾗｲ        (L04) */
#define		MRMUAPVHR   0X0A		/* RBI ﾑｺｳｶ ｼｮﾘ ｲﾗｲ        (L04) */
#define		MRMUAPVNR   0X0B		/* RBI ﾑｺｳｶ ｼｮﾘ ｲﾗｲ        (L04) */
									/* SCSIﾘｾﾂﾄ機能の変更に伴う削除  */
									/* (2行)                    TD61 */
#define		MRMUMRCV	0x0C		/* ﾐﾗｰﾎﾞﾘｭｰﾑ復旧依頼	CT0894	 */
#define     MRMUAJRC    0X11        /* JNL・RBI初期化依頼       TD79 */

/*********************************************************************/
/*	ﾂｳﾁ ｺｰﾄﾞ ﾃｲｷﾞ(ｶﾝﾘｮｳ ﾂｳﾁ)										 */
/*********************************************************************/
#define		MRMUCRBNOM	0x00		/* RBI ｲﾗｲ ｾｲｼﾞｮｳ				 */
#define		MRMUCRBFAE	0x01		/* RBI ﾌｧｲﾙ ｱｸｾｽ ｴﾗｰ			 */
#define		MRMUCRBTME	0x02		/* RBI ﾀｲﾏｰ ｾｯﾃｲ ｴﾗｰ			 */
#define		MRMUCRBTDE	0x03		/* RBI 2 ｼﾞｭｳ ﾀｲﾏｰ ｾｯﾃｲ ｴﾗｰ		 */
#define		MRMUCRBTCE	0x04		/* RBI ﾀｲﾏｰ ｶｲｼﾞｮ ｴﾗｰ			 */
#define		MRMUCRBTNO	0x05		/* RBI ﾀｲﾏｰ ﾐ ｾｯﾃｲ ｴﾗｰ			 */
#define		MRMUCRBNTB	0x06		/* RBI ｼｮｷｶ ｴﾗｰ					 */
#define		MRMUCRBSDE	0x07		/* RBI ﾃｲｼｭｳｷ ｶｲｼ 2 ｼﾞｭｳ ﾊｯｺｳ	 */
#define		MRMUCRBEDE	0x08		/* RBI ﾐ ﾃｲｼｭｳｷ ｶｲｼ ｼﾞｭｳﾀｲ		 */
#define		MRMUCVBLK	0x09		/* ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ ｶﾝﾘｮｳ	   (L03) */
#define		MRMUCPVHR   0X0A		/* 物理ﾎﾞﾘｭｰﾑ閉塞完了 		TD02 */
#define		MRMUCPVNR   0X0B		/* 物理ﾎﾞﾘｭｰﾑ閉塞解除完了 	TD02 */
#define		MRMUCACC6R	0x10		/* ACC#6 ｼﾖｳ ｷｮｶ ﾂｳﾁ			 */
#define		MRMUCRBREJ  0x11		/* RBI ﾑｺｳｶ ｷｮﾋ            (L04) */
#define     MRMUCJRC    0x12        /* JNL・RBI初期化完了       TD79 */

/*********************************************************************/
/*	ﾂｳﾁ ｺｰﾄﾞ ﾃｲｷﾞ(ｶｲｼ ﾂｳﾁ)											 */
/*********************************************************************/
#define		MRMUSSRCV	0x00		/* ｼｽﾃﾑ ﾘｶﾊﾞﾘ ｶｲｼ				 */
#define		MRMUSVRCV	0x01		/* ﾎﾞﾘｭｳﾑ ﾘｶﾊﾞﾘ ｶｲｼ				 */
#define		MRMUSBKUP	0x03		/* ﾊﾞｯｸｱｯﾌﾟ ｶｲｼ					 */
#define		MRMUSRMAN	0x06		/* 故障管理開始             TD00 */

/*********************************************************************/
/*	ﾂｳﾁ ｺｰﾄﾞ ﾃｲｷﾞ(ｼｭｳﾘｮｳ ﾂｳﾁ)										 */
/*********************************************************************/
#define		MRMUESRCV	0x00		/* ｼｽﾃﾑ ﾘｶﾊﾞﾘ ｼｭｳﾘｮｳ			 */
#define		MRMUEVRCV	0x01		/* ﾎﾞﾘｭｳﾑ ﾘｶﾊﾞﾘ ｼｭｳﾘｮｳ			 */
#define		MRMUEBKUP	0x03		/* ﾊﾞｯｸｱｯﾌﾟ ｼｭｳﾘｮｳ				 */
#define		MRMUERMAN	0x06		/* 故障管理終了             TD00 */

/*********************************************************************/
/*	ﾂｳﾁ ｺｰﾄﾞ ﾃｲｷﾞ(ｺｼｮｳ ﾂｳﾁ)											 */
/*********************************************************************/
#define		MRMUTSYS	0x00		/* ｼｽﾃﾑ ｺｼｮｳ					 */
#define		MRMUTSYSF	0x01		/* ｼｽﾃﾑ ﾌｧｲﾙ ｺｼｮｳ				 */
#define		MRMUTVOL	0x02		/* ﾎﾞﾘｭｳﾑ ｺｼｮｳ					 */
#define		MRMUTBKER	0x03		/* ﾊﾞｯｸｱｯﾌﾟ ｼｯﾊﾟｲ		   (L05) */
#define		MRMUTRCVF	0x04		/* RCVﾌｧｲﾙ故障				TD00 */
#define		MRMUTJEND	0x05		/* ｼﾞｬｰﾅﾙ ﾆｱｴﾝﾄﾞ			TD65 */
#define		MRMUTBAT	0x09		/* ﾊﾞｯﾃﾘｰ ｱﾗｰﾑ			   (L02) */

/*********************************************************************/
/*	ﾂｳﾁ ｺｰﾄﾞ ﾃｲｷﾞ(ｶｲﾌｸ ﾂｳﾁ)											 */
/*********************************************************************/
#define		MRMURSYS	0x00		/* ｼｽﾃﾑ ｶｲﾌｸ					 */
#define		MRMURSYSF	0x01		/* ｼｽﾃﾑ ﾌｧｲﾙ ｶｲﾌｸ				 */
#define		MRMURVOL	0x02		/* ﾎﾞﾘｭｳﾑ ｶｲﾌｸ					 */

/*-------------------------------------------------------------------*/
/*  故障管理プロセス出力電文                                    TD-00*/
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*		ﾎﾞﾘｭｰﾑ ﾍｲｿｸ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬｲｷ ﾌｫ-ﾏｯﾄ							 */
/*********************************************************************/
                                    /* 強制ｱﾝﾏｳﾝﾄの採用に伴う削除    */
									/* (8行)                    TD47 */
									/* mr_efcl復活に伴う復活  ST1550 */
struct	mrvoluse {
	MRMUSE	mrvluse;				/* RCV共通利用者域				 */
    short	mrvlptn;				/* 故障PVTｴﾝﾄﾘ番号               */
    short	mrvlvtn;				/* 故障VMTｴﾝﾄﾘ番号			TD90 */
	char	mrvlvnm[6];				/* 故障物理ﾎﾞﾘﾕ-ﾑ識別名 		 */
	short	mrvlyb1;				/* 予備1					TD@1 */
	char	mrvlrvnm[6];			/* 故障論理ﾎﾞﾘﾕ-ﾑ識別名 	TD90 */
	short	mrvlyb2;				/* 予備2					TD90 */
};
typedef	struct	mrvoluse MRVOLUSE;

/*********************************************************************/
/*		ﾊﾞｽ ﾘｾｯﾄ ﾖｳｷｭｳ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬｲｷ ﾌｫ-ﾏｯﾄ						 */
/*********************************************************************/
									/* SCSIﾘｾﾂﾄ機能の変更に伴う削除  */
									/* (5行)                    TD61 */
/*********************************************************************/
/*		故障ﾎﾞﾘｭｰﾑ ｴﾗｰ ｼｭﾍﾞﾂ ﾂｳﾁ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬｲｷ ﾌｫ-ﾏｯﾄ			 	 */
/*********************************************************************/
struct	mreiduse {					/*						   (L07) */
	MRMUSE  mreiuse;				/* ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ	   (L07) */
	char    mrervnm[8];     		/* ｼｮｳｶﾞｲ ﾌﾞﾂﾘﾎﾞﾘｭｰﾑｼｷﾍﾞﾂﾒｲ(L07) */
	char	mrerrid;				/* ｴﾗｰ ｼｭﾍﾞﾂ  			   (L07) */
	char	mreryob[3];	        	/* ﾖﾋﾞ 		 			   (L07) */
	char    mrerlvnm[8];     		/* 故障論理ﾎﾞﾘｭｰﾑ識別名    (M06) */
};															/* (L07) */
typedef	struct	mreiduse MREIDUSE;							/* (L07) */
/*******************************/
/*  エラー種別の定義      TD-00*/
/*******************************/
#define		MRMEUEC		0x00		/* ﾊﾞｲﾀｲ ｺｳｶﾝ ﾌﾖｳ		   (L07) */
#define		MRMENEC		0x01    	/* ﾊﾞｲﾀｲ ｺｳｶﾝ ﾖｳ		   (L07) */

/*********************************************************************/
/*		ﾀｹｲ ﾍｲｿｸ ｲﾗｲ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬｲｷ ﾌｫ-ﾏｯﾄ							 */
/*********************************************************************/
struct	mrvrquse {					/*						   (L03) */
	MRMUSE	mrvruse;				/* ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ	   (L03) */
	char	mrvrvnm[6];				/* 論理ﾎﾞﾘﾕ-ﾑ識別名         TD90 */
	short	mrvryb1;				/* ﾖﾋﾞ1					   (L03) */
	long	mrvrcod;				/* ｴﾗ- ｼｮｳｻｲ ｺ-ﾄﾞ		   (L03) */
};															/* (L03) */
typedef	struct	mrvrquse MRVRQUSE;							/* (L03) */

/*********************************************************************/
/*		ｼﾞｹｲ ﾍｲｿｸ ｶﾝﾘｮｳ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬｲｷ ﾌｫ-ﾏｯﾄ						 */
/*********************************************************************/
struct	mrvfnuse {					/*						   (L03) */
	MRMUSE	mrvfuse;				/* ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ	   (L03) */
	char	mrvfvnm[6];				/* 論理ﾎﾞﾘﾕ-ﾑ識別名         TD90 */
	short	mrvfyb1;				/* ﾖﾋﾞ1					   (L03) */
};															/* (L03) */
typedef	struct	mrvfnuse MRVFNUSE;							/* (L03) */

/*********************************************************************/
/*      ＪＮＬ・ＲＢＩ初期化完了電文利用者域                    TD00 */
/*********************************************************************/
struct  mriecuse {                  /*                          TD79 */
	MRMUSE 	 mrieuse;               /* RCV共通利用者域          TD79 */
    unsigned char	mrieekbn;       /* 完了区分                 TD79 */
	char	mrieyobi[3];            /* 予備                     TD79 */
};                                                           /* TD79 */
typedef struct mriecuse MRIECUSE;                            /* TD79 */
/*******************************/
/*  完了区分の定義(mrieekbn)   */
/*******************************/
#define     MRIEJNLCHG     0x80      /* JNLの初期化完了          TD79 */
#define     MRIERBICHG     0x40      /* RBIの初期化完了          TD79 */
#define     MRIEKJCHG      0x20      /* KJ の初期化完了          TD83 */
#define     MRIEJNLERR     0x81      /* JNLの初期化失敗          TD79 */
#define     MRIERBIERR     0x41      /* RBIの初期化失敗          TD79 */
#define     MRIEKJERR      0x21      /* KJ の初期化失敗          TD83 */
#define     MRIEJNLINT     0x82      /* JNLの初期化中            TD79 */
#define     MRIERBIINT     0x42      /* RBIの初期化中            TD79 */
#define     MRIEKJINT      0x22      /* KJ の初期化中            TD83 */
#define     MRIESWH        0x10      /* JNL使用面の切替完了    CT0977 */
#define     MRIESWHERR     0x11      /* JNL使用面の切替失敗    CT0977 */

/*-------------------------------------------------------------------*/
/*  ＶＲＣＶ前処理プロセス出力電文                              TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*	物理ボリューム閉塞/閉塞解除依頼電文利用者域                 TD00 */
/*********************************************************************/
struct	mrprcuse {					/*						    TD02 */
	MRMUSE	mrpruse;				/* ﾒｯｾｰｼﾞﾍｯﾀﾞｰ				TD02 */
	long	mrprsoch;				/* 装置ID					TD02 */	
	short	mrprpvte;				/* PVTｴﾝﾄﾘ番号				TD02 */
	short	mrpryob1;				/* ﾖﾋﾞ1					   	TD02 */
	long	mrprwhtm[2];			/* 閉塞時間				   	TD02 */
};									/* 							TD02 */
typedef	struct	mrprcuse MRPRCUSE;	/* 							TD02 */

/*********************************************************************/
/*  ボリューム閉塞通知電文利用者域                              TD00 */
/*********************************************************************/
struct	mrhvnuse {					/*						    TD90 */
	MRMUSE  mrhvuse;				/* ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ	    TD90 */
	char    mrhvvnm[8];     		/* 閉塞ﾎﾞﾘｭｰﾑ識別名         TD90 */
};															 /* TD90 */
typedef	struct	mrhvnuse MRHVNUSE;							 /* TD90 */

/*-------------------------------------------------------------------*/
/*  サブ故障管理プロセス出力電文	                            TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*	物理ボリューム閉塞/閉塞解除完了電文利用者域                 TD00 */
/*********************************************************************/
struct	mrpecuse {					/*						    TD02 */
	MRMUSE	mrpeuse;				/* ﾒｯｾｰｼﾞﾍｯﾀﾞｰ				TD02 */
	unsigned char	mrpeekbn;		/* 完了区分					TD02 */
	char	mrpeyob1[3];			/* ﾖﾋﾞ1					   	TD02 */
	long	mrpewhtm[2];			/* 閉塞時間				   	TD02 */
};									/* 							TD02 */
typedef	struct	mrpecuse MRPECUSE;	/* 							TD02 */

/*******************************/
/*  完了区分(mrpeekbn)の定義   */
/*******************************/
#define     MRPEHEND	   0x80      /* 閉塞完了				 TD02 */
#define     MRPENEND       0x40      /* 閉塞解除完了	         TD02 */
#define     MRPEHERR       0x81      /* 閉塞失敗		         TD02 */
#define     MRPENERR       0x41      /* 閉塞解除失敗	         TD02 */
#define     MRPEHUNO       0x82      /* 閉塞時装置未実装         TD02 */
#define     MRPENUNO       0x42      /* 閉塞解除時装置未実装     TD02 */

/*-------------------------------------------------------------------*/
/*  故障管理提供関数出力電文                                    TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*		故障管理提供関数利用者域                                TD00 */
/*********************************************************************/
struct mrmeruse {					/*						   (L03) */
	MRMUSE	mrmeuse;				/* ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ	   (L03) */
	char	mrmertyp;				/* ｲﾗｲ ｼｭﾍﾞﾂ 			   (L03) */
	char	mrmedtyp;				/* ｼｮﾘ ｼｭﾍﾞﾂ			   (L03) */
									/*	FIP ｶﾗ ﾉ ｲﾗｲ : MREJFIP('F')	 */
	char	mrmeyobi[2];			/* ﾘｻﾞｰﾌﾞ				   (L03) */
	long	mrmeevnt;				/* ｲﾍﾞﾝﾄ ﾊﾞﾝｺﾞｳ			   (L03) */
};															/* (L03) */
typedef struct mrmeruse MRMERUSE;							/* (L03) */

/*********************************************************************/
/*		ＪＮＬ・ＲＢＩ初期化依頼電文利用者域                    TD00 */
/*********************************************************************/
struct  mrearuse {                  /*                          TD79 */
    MRMERUSE  mrmeause;             /* 故障管理提供関数利用者域 TD79 */
	char      mreartyp;             /* 依頼区分                 TD79 */
	char      mrearyob[3];          /* 予備		                TD79 */
};															 /* TD79 */
typedef struct mrearuse MREARUSE;							 /* TD79 */

/*-------------------------------------------------------------------*/
/*  ミラーリング制御同期機能出力電文					CT0894	TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*		ミラー論理ボリューム復旧可能通知利用者域フォーマット	TD00 */
/*********************************************************************/
struct	mrmlvuse {											/*	TD22 */
	MRMUSE	mrmluse;				/* ﾒｯｾｰｼﾞﾍｯﾀﾞ利用者域		TD22 */
	char	mlvvnam[8];				/* 論理ﾎﾞﾘｭｰﾑ識別名			TD22 */
	char	mlvfkbn;				/* 復旧区分					TD22 */
	char	mlverr;					/* エラー種別				TD22 */
	char	mlvyobi[2];				/* 予備						TD22 */
	long	mlvercd;				/* エラーコード				TD22 */
};															/*	TD22 */
typedef	struct	mrmlvuse MRMLVUSE;							/*	TD22 */

/*********************************************************************/
/*		復旧区分												TD00 */
/*********************************************************************/
#define	MRRSTIMP		0x00		/* 復旧不可能				TD22 */
#define	MRRSTPOS		0x01		/* 復旧可能					TD22 */

/*********************************************************************/
/*		エラー種別												TD00 */
/*********************************************************************/
#define	MRMLCON			0x01		/* ﾐﾗｰ特殊ﾌｧｲﾙｺﾈｸﾄ失敗		TD22 */
#define	MRMLOPN			0x02		/* ﾐﾗｰ特殊ﾌｧｲﾙｵｰﾌﾟﾝ失敗		TD22 */
#define	MRMLINF			0x03		/* ﾐﾗｰ状態取得失敗			TD22 */
#define	MRMLGET			0x04		/* 更新領域ログ取得失敗		TD22 */
#define	MRMLSET			0x05		/* 更新領域ログ設定失敗		TD22 */
#define	MRMLERR			0x0F		/* 更新領域ログ不確定復旧不可TD22 */

/*-------------------------------------------------------------------*/
/*  その他提供関数出力電文                                      TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*      ＪＮＬ・ＲＢＩ２重故障時処理電文利用者域                TD00 */
/*********************************************************************/
struct  mrceruse {                  /*                          TD78 */
	MRMUSE 	 mrceuse;               /* RCV共通利用者域          TD78 */
	char     mrcertyp;              /* 依頼区分                 TD78 */
	         /* 媒体種別削除(1行)							ST2895	 */
	char     mrcermen;              /* 媒体対象面               TD78 */
	char     mrcerrid;              /* ｴﾗ-種別                  TD78 */
	char	 mrceryob;				/* 予備					ST2895	 */
};                                                           /* TD78 */
typedef struct mrceruse MRCERUSE;                            /* TD78 */

/*-------------------------------------------------------------------*/
/*  ＶＲＣＶプロセス（ｍｒｏ）出力電文							TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*		ボリューム復旧情報通知利用者域							TD00 */
/*********************************************************************/
struct	mrvecuse
{
	MRMUSE	mrvmuse;				/* RCV共通利用者域				 */
	char	mrvbkid[8];				/* バックアップID				 */
	char	mrvrvmd;				/* 復旧モード					 */
	unsigned char	mrvrcvf;		/* RCVﾌｱｲﾙ情報					 */
	char	mrvrsv1[2];				/* 予備							 */
	long	mrvrcod;				/* 復旧情報						 */
	short	mrvpvte;				/* 復旧TPVTｴﾝﾄﾘ番号				 */
	short	mrvvmte;				/* 復旧TVMTｴﾝﾄﾘ番号				 */
	char	mrvpnam[8];				/* 物理ﾎﾞﾘﾕ-ﾑ識別名				 */
	char	mrvvnam[8];				/* 論理ﾎﾞﾘﾕ-ﾑ識別名				 */
};
typedef	struct	mrvecuse	MRVECUSE;

/*********************************************************************/
/*		復旧モード												TD00 */
/*********************************************************************/
#define	MRVNBVL		'0'				/* ﾊﾞｯｸｱｯﾌﾟﾃﾞｰﾀからのﾘｽﾄｱ		 */ 
#define	MRVUBVL		'1'				/* ﾊﾞｯｸｱｯﾌﾟ不要ﾎﾞﾘｭｰﾑの回復		 */
#define	MRVMRVL		'2'				/* ﾐﾗｰﾎﾞﾘｭｰﾑ復旧				 */
#define	MRVWKVL		'3'				/* ﾜｰｸﾌｧｲﾙﾎﾞﾘｭｰﾑの回復			 */
#define	MRVRVVL		'4'				/* ﾘｶﾊﾞﾘﾌｧｲﾙﾎﾞﾘｭｰﾑの回復		 */

/*********************************************************************/
/*		復旧情報												TD00 */
/*********************************************************************/
#define	MRVVNRM		0L				/* 復旧正常						 */
#define	MRVVFLT		-1L				/* 復旧失敗						 */

/*-------------------------------------------------------------------*/
/*  バックアッププロセス（ｍｒｐ）出力電文						TD00 */
/*-------------------------------------------------------------------*/
/*********************************************************************/
/*		ﾎﾞﾘｭｰﾑ ｼｮｳｶﾞｲ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬｲｷ ﾌｫ-ﾏｯﾄ							 */
/*********************************************************************/
struct	mrveruse {					/*						   (L05) */
	MRMUSE	mrveuse;				/* ﾒｯｾｰｼﾞ ﾍｯﾀﾞｰ ﾘﾖｳｼｬｲｷ	   (L05) */
	char	mrvenam[8];				/* ｼｮｳｶﾞｲ ﾛﾝﾘﾎﾞﾘｭｰﾑ ｼｷﾍﾞﾂﾒｲ(L05) */
	short	mrveent;				/* VMT ﾏﾀﾊ VBT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ (L05) */
	char	mrveid;					/* ｺﾋﾟｰ ﾓﾄ/ｻｷ ｼｷﾍﾞﾂｼ	   (L05) */
	char	mrveyb1;				/* ﾖﾋﾞ1					   (L05) */
};
typedef	struct	mrveruse MRVERUSE;

/*----------------------------------------------------------------------*/
/*	ＳＣＳＩリセット機能関連出力電文			TD61					*/
/*----------------------------------------------------------------------*/
/************************************************************************/
/*	疑似ＳＭＰ通知利用者域フォーマット									*/
/************************************************************************/
struct	mrmcesmp	{					/*					CT1039		*/
	MRMUSE	mrmceuse;					/*	メッセージヘッダ利用者域	*/
	char	mrmcrecd;					/*	識別種別		CT1039		*/
	char	mrmcencd;					/*	中分類コード	CT1039		*/
	char	mrmcdtcd;					/*	詳細分類コード	CT1039		*/
	unsigned char	mrmcrctb;			/*	テーブル種別フラグ	CT1039	*/
	long	mrmcsrcd;					/*	システムコール返却値 CT1039	*/
	short	mrmcmbnm;					/*	TVMT/TVBT個別部番号	 CT1039	*/
};										/*					CT1039		*/
typedef	struct	mrmcesmp	MRMCESMP;	/*					CT1039		*/

/************************************************************************/
/*	識別種別															*/
/************************************************************************/
#define		MRMCSMPRE		0x0C		/*	識別種別		CT1039		*/

/************************************************************************/
/*	中分類コード														*/
/************************************************************************/
#define		MRMCSMPCE		0x05		/*	中分類コード	CT1039		*/

/************************************************************************/
/*	詳細分類コード														*/
/************************************************************************/
#define		MRMCSMPDE1		0x05		/*	疑似ＳＭＰ通知１	CT1039	*/
#define		MRMCSMPDE2		0x03		/*	疑似ＳＭＰ通知２	CT1039	*/
#define		MRMCSMPDE3		0x07		/*	疑似ＳＭＰ通知３	CT1106	*/

