/*****************************NTC-SMP-RCV*****************************/
/*                                                                   */
/*   1 ﾌｧｲﾙﾒｲ                                                        */
/*      RBI ﾃｲｷﾞ ﾌｧｲﾙ (mrrbi.h)                                      */
/*                                                                   */
/*   2 ｸﾌﾞﾝ                                                          */
/*      RBI ｼｭﾄｸ ｼｮﾘ                                                 */
/*                                                                   */
/*   3 ﾘﾚｷ                                                           */
/*      ｾｯｹｲ ｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ                        			         */
/*      ｻｸｾｲ ｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ                         			     */
/*      ﾍﾝｺｳ ｼｬ : 佐藤　亘          93/11/12                         */
/*				  (2重化ﾌｱｲﾙの削除に伴う変更)         TD-27          */
/*                (LMﾃｰﾌﾞﾙのRBI取得に伴う変更)        TD-40          */
/*                (内部事情による変更)                TD-@1          */
/*                                                                   */
/*********************************************************************/

/*********************************************************************/
/*    MRRCB (ｷｮｳﾂｳ ｼﾞｮｳﾎｳ ｾｯﾃｲ ﾘｮｳｲｷ)                                */
/*********************************************************************/
struct mrrcb{
	 long    mrrbmin;          /* ｼｭﾄｸ ｶﾝｶｸ ｼﾞｶﾝ                     */
	 long    mrrbmsg;          /* ﾒｯｾｰｼﾞ ｼﾞｭｼﾝ ﾖｳｷｭｳ ｼｷﾍﾞﾂｼ          */
	 long    mrrbtim;          /* ﾀｲﾏ ｼﾞｭｼﾝ ﾖｳｷｭｳ ｼｷﾍﾞﾂｼ             */
	 long    mrrbrfd;          /* RBIﾌｧｲﾙ記述子                 TD@1 */
	 char	 mrrbtyp;          /* 起動区分                      TD40 */
	 char    mrrbsid;          /* ｼｽﾃﾑｺ-ﾙID                          */
	 char	 mrrbyob[2];       /* 予備                          TD@1 */
	 long	 mrrbrcd;		   /* ｼｽﾃﾑｺｰﾙ ﾉ ﾍﾝｷｬｸﾁ					 */
	 TRBTPSZ *mrrbrbt;         /* TRBT個別部ｱﾄﾞﾚｽ				TD40 */
};
typedef struct mrrcb MRRCB;

/*********************************************************************/
/*    MRRBIDX  (RBI ｲﾝﾃﾞｯｸｽ ﾊﾞｯﾌｧ)                                   */
/*********************************************************************/
struct mrrbidx {
	 long    mrrxuse;          /* ﾕｳｺｳ ﾋｮｳｼﾞ                         */
	 long    mrrxcnt;          /* ｼｭﾄｸ ｶｳﾝﾀ                          */
	 long    mrrxday;          /* SMP日付上位2ﾊﾞｲﾄ              TD@1 */
	 long    mrrxtim;          /* SMP日付下位2ﾊﾞｲﾄ              TD@1 */
};
typedef struct mrrbidx  MRRBIDX;

/*********************************************************************/
/*    MRRBUSE  (RBI ｿｳｼﾞｭｼﾝ ﾃﾞﾝﾌﾞﾝ ﾘﾖｳｼｬ ｲｷ)                         */
/*********************************************************************/
struct mrrbuse {
	 MRMUSE	 mrrbma1;
	 long    mrrbma2;          /*                                    */
};
typedef struct mrrbuse  MRRBUSE;
                                             
/*********************************************************************/
/*	  RBI ﾌﾟﾛｾｽ ﾅｲ ﾌﾗｸﾞ ｵﾝ ｵﾌ 										 */
/*********************************************************************/
#define		MRRBFON		0x0080			/* ﾌﾗｸﾞ ｵﾝ 					 */
#define		MRRBFOF		0x0000			/* ﾌﾗｸﾞ ｵﾌ 					 */

/*********************************************************************/
/*	  RBI ﾌﾟﾛｾｽ ﾅｲ ｾｲﾌｸ ｸﾌﾞﾝ 										 */
/*********************************************************************/
										/* 2重化ﾌｱｲﾙの削除に伴う削除 */
										/* (2行)                TD27 */

/*********************************************************************/
/*	RBI ﾕｳｺｳ/ﾑｺｳ ﾋｮｳｼﾞ												 */
/*********************************************************************/
#define		MRRBVOID	0x00000000L		/* RBI ﾑｺｳ ﾋｮｳｼﾞ			 */
#define		MRRBUSEF	0xFFFFFFFFL		/* RBI ﾕｳｺｳ ﾋｮｳｼﾞ			 */

/*********************************************************************/
/*  RBIﾌﾟﾛｾｽ起動区分                                                 */
/*********************************************************************/
#define     MRRBICM     0x00            /* CMﾃｰﾌﾞﾙ用            TD40 */
#define     MRRBIL0     0x01            /* PU0配下LMﾃｰﾌﾞﾙ用     TD40 */
#define     MRRBIL1     0x02            /* PU1配下LMﾃｰﾌﾞﾙ用     TD40 */

