/*****************************NTC-SMP-RCV*****************************/
/*                                                                   */
/*   1 ﾌｧｲﾙﾒｲ                                                        */
/*      RBI ﾌｧｲﾙ ｱｸｾｽ ﾖｳ ﾏｸﾛ ﾃｲｷﾞ (mrrfac.h)						 */
/*                                                                   */
/*   2 ｸﾌﾞﾝ                                                          */
/*      RBI ｼｭﾄｸ ｼｮﾘ                                                 */
/*                                                                   */
/*   3 ﾘﾚｷ                                                           */
/*      ｾｯｹｲ ｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ                        			         */
/*      ｻｸｾｲ ｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ                         			     */
/*		変更者  : 佐藤　亘									TD-00	 */
/*				  (内部事情による変更)						TD-@1	 */
/*                                                                   */
/*********************************************************************/

									/* ｼｽﾃﾑｺｰﾙのﾌｧﾝｸｼｮﾝ定義削除	TD@1 */
									/* 5行削除						 */

/*********************************************************************/
/*    TRADEｼｽﾃﾑｺｰﾙのﾏｸﾛ定義										TD00 */
/*********************************************************************/
									/* 変更開始位置				TD@1 */
#define	MROSCONN(p1,p2)				mr_rocn(p1,p2)
#define	MROSOPEN(p1,p2,p3,p4,p5,p6)	osopen(p1,p2,p3,p4,p5,p6)
#define	MROSWRITD(p1,p2,p3,p4,p5)	mr_rowd(p1,p2,p3,p4,p5)
#define	MROSFLUSH(p1,p2,p3)			mr_rofl(p1,p2,p3)
#define	MROSCLOSE(p1)				osclose(p1)
#define	MROSDCONN(p1)				osdconn(p1)
									/* 変更終了位置				TD@1 */

									/* mr_rfac関数の定義を削除	TD@1 */
									/* 3行削除						 */
