/*****************************NTC-SMP-RCV*****************************/
/*                                                                   */
/*   1 ﾌｧｲﾙﾒｲ                                                        */
/*      ｼｽﾃﾑ ｼｮｷｶ/ｼｭｩﾘｳｼｮﾘ ﾃｲｷﾞ ﾌｧｲﾙ (mrs.h)                         */
/*                                                                   */
/*   2 ｸﾌﾞﾝ                                                          */
/*      ｼｽﾃﾑ ｼｮｷｶ/ｼｭｩﾘｳｼｮﾘ											 */
/*                                                                   */
/*   3 ﾘﾚｷ                                                           */
/*      ｾｯｹｲ ｼｬ : ｺﾐﾔﾏ ｲｸﾖ											 */
/*      ｻｸｾｲ ｼｬ : ｺﾐﾔﾏ ｲｸﾖ											 */
/*		ﾍﾝｺｳｼﾔ  : ｽｽﾞｷ ｵｻﾑ			 '88/10/05 (L01)				 */
/*				 (ｼﾞｬｰﾅﾙ ﾘｰﾄﾞ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC1230			 */
/*		変更者  : 佐藤　亘           '94/01/05						 */
/*				  (LMﾃｰﾌﾞﾙのRBI取得による変更)				TD-40	 */
/*				  (PUの独立化による変更)					TD-59	 */
/*				  (内部事情による変更)						TD-@1	 */
/*                                                                   */
/*********************************************************************/

/*********************************************************************/
/*    MRSCB (ｷｮｳﾂｳ ｼﾞｮｳﾎｳ ｾｯﾃｲ ﾘｮｳｲｷ)                                */
/*********************************************************************/
struct mrscb{
	 TPCTPSZ *mrspctp[4];      /* RBIﾌﾟﾛｾｽのPCT個別部ｱﾄﾞﾚｽ		TD40 */
							   /* RBT/JCT ｾﾝﾄｳ ｱﾄﾞﾚｽの削除		TD@1 */
	 char    mrssmun;          /* ｻﾌﾞMS要／不要                 TD59 */
	 char    mrsrsv[3];        /* 予備                          TD59 */
};
typedef struct mrscb MRSCB;
