/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		Ž¼Ž½ŽÃŽÑ ŽÀŽÞŽ³ŽÝ ŽÖŽ³Ž·Ž­Ž³ ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (mrsdwn.h)						 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽØŽ¶ŽÊŽÞŽØ Ž·Ž®Ž³ŽÂŽ³													 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž² Ž¼Ž¬ : ŽÎŽ¼ŽÉ ŽËŽÛŽÄŽ¼											 */
/*		Ž»Ž¸Ž¾Ž² Ž¼Ž¬ : ŽÎŽ¼ŽÉ ŽËŽÛŽÄŽ¼							 				 */
/*		ŽÍŽÝŽºŽ³ Ž¼Ž¬ : 													 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*  ŽÀŽÞŽ³ŽÝ ŽÖŽ³Ž·Ž­Ž³ ŽÃŽÞŽÝŽÌŽÞŽÝ ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                         */
/*********************************************************************/
struct  mrmsa {
	long  mrmdwnt;
	long  mrmendcd;
	long  mrmdtlc;
};
typedef  struct mrmsa MRMSA;
