/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ﾊﾞｯｸ ｱｯﾌﾟ ﾃｲｷﾞ ﾌｧｲﾙ (mru.h)									 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾊﾞｯｸ ｱｯﾌﾟ ｼｮﾘ												 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼｬ : ｽｽﾞｷ ｵｻﾑ											 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ			    '89/03/01 (L01)				 */
/*				(ｲｼﾞｮｳ ｼｭｳﾘｮｳｼﾞ ｱﾎﾞｰﾄ ｷﾉｳ ﾉ ﾂｲｶ)		--- TC2419	 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾀﾞ ｶｽﾞﾉﾘ				'89/04/13 (L02)				 */
/*				(ｷﾄﾞｳ ﾊﾟﾗﾒﾀ ﾁｪｯｸ ｷﾉｳ ﾉ ﾂｲｶ)				--- TC2528	 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ			 	'89/07/18 (L03)				 */
/*				(ﾊﾞｯｸｱｯﾌﾟ ｻｲ ｷﾄﾞｳ ｷﾉｳ ﾉ ﾂｲｶ)			--- TC2701	 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ			 	'89/10/19 (L04)				 */
/*				(ﾊﾞｯｸｱｯﾌﾟ ﾎﾞﾘｭｰﾑ A･Bﾒﾝ ｼﾖｳ ｷﾉｳ ﾉ ﾂｲｶ)	--- TC3020	 */
/*		ﾍﾝｺｳｼｬ : ﾖｼﾓﾄ ﾋﾛｶｽﾞ　	 		'90/04/28 (L05)				 */
/*              (ｺﾋﾟ- ﾌﾟﾛｾｽ ﾏﾙﾁ ｷﾄﾞｳ ｷﾉｳ ﾉ ﾂｲｶ)         --- TC3550   */
/*      変更者 : 今井　弘幸				 94/08/27  TD-00			 */
/*			    (ﾌﾟﾛｾｽｱﾎﾞｰﾄの見直しに伴う変更)                 TD-49 */
/*				(ﾊﾞｯｸｱｯﾌﾟ変更に伴う変更)					   TD-46 */
/*				(LMﾃｰﾌﾞﾙﾘｶﾊﾞﾘに伴う変更)					   TD-39 */
/*				(2重化ﾌｧｲﾙ削除に伴う変更)					   TD-27 */
/*				(SMP日付の導入に伴う変更)					   TD-92 */
/*			    (KJの分離に伴う変更)						   TD-42 */
/*********************************************************************/

/*********************************************************************/
/*	返却値 														TD00 */
/*********************************************************************/
#define MRUNORMAL	0L		/*	ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ						 */
/* Pｱﾎﾞｰﾄの見直しにより削除（１５行）							TD49 */
#define MRUIVPARM   -1L		/*  ﾊﾟﾗﾒｰﾀｴﾗｰ                       TD49 */ 
#define	MRUBKSTOP	-2L		/*  終了依頼受信			        TD49 */	
#define MRUNSTART   -3L		/*  ﾊﾞｯｸｱｯﾌﾟ続行不能			    TD49 */
#define	MRUCMIOER	-4L		/*  ﾊﾞｯｸｱｯﾌﾟ元I/Oｴﾗｰによるﾊﾞｯｸｱｯﾌﾟ  TD49 */
							/*  失敗								 */
#define MRUBVIOER	-5L		/*  ﾊﾞｯｸｱｯﾌﾟﾎﾞﾘｭｰﾑI/Oｴﾗｰ 			TD49 */  
#define MRUCPKILL	-6L		/*  ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽ強制終了による   TD49 */
							/*  ﾊﾞｯｸｱｯﾌﾟ失敗						 */
#define MRUDUPVRCV  -7L		/*  VRCV前処理中の起動				TD49 */
#define MRUJNAPON   -8L		/*  ｼﾞｬｰﾅﾙ取得AP動作中				TD49 */
#define MRUHOTWAIT  -9L		/*  自系がﾎｯﾄｽﾀﾝﾊﾞｲの予備系			TD02 */
#define MRUCPYERR  -10L		/*  ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽ異常終了			TD49 */

/*********************************************************************/
/*	内部返却値													TD00 */
/*********************************************************************/
/* Pｱﾎﾞｰﾄの見直しにより削除（１０行）						    TD49 */
#define	MRUABORT	 99L	/*  異常終了						TD49 */
#define MRUGETVCP1	 1L		/* mrc1からのﾘｻﾞﾙﾄ受信				TD49 */
#define MRUGETVCP2	 2L		/* mrc2からのﾘｻﾞﾙﾄ受信				TD49 */ 
#define MRUGETRBI    3L		/* RBI完了通知受信  				TD49 */
#define MRUGETTIM	 4L		/* ﾀｲﾏからのﾘｻﾞﾙﾄ受信    			TD49 */
#define MRUSYSTOP    5L     /* 終了依頼受信(ｼｽﾃﾑｽﾄｯﾌﾟ)			TD49 */
#define MRUCMSTOP    6L     /* 終了依頼受信(ｺﾏﾝﾄﾞｽﾄｯﾌﾟ)			TD49 */

/*  不要な定義の為削除（４行）								    TD@1 */

/*********************************************************************/
/*	VMT ﾘｽﾄ      													 */
/*********************************************************************/
struct mruvmt{                                              /* (L05) */
	 char 		mruvsid;    	/* ｼｮﾘｼｭﾍﾞﾂ　　　　　　　	   (L05) */
	 char		mruvyob[3];     /* ﾖﾋﾞ                         (L05) */
	 short		mruvmt1;        /* VMT ｴﾝﾄﾘ1                   (L05) */
	 short		mruvmt2;        /* VMT ｴﾝﾄﾘ2                   (L05) */
};      												    /* (L05) */
typedef struct mruvmt MRUVMT;                               /* (L05) */

/*********************************************************************/
/*	MRUCB (ｷｮｳﾂｳ ｼﾞｮｳﾎｳ ｾｯﾃｲ ﾘｮｳｲｷ)									 */
/*********************************************************************/
struct mrucb{
	 char		mrupblid[4];	/* ﾌﾞﾛｯｸ ｼｷﾍﾞﾂｼ						 */
/*  不要な項目の為削除（３行）　　　　　　　　　　　　　　　　　TD@1 */
	 long		mrupbktn;		/* BKT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ					 */
/*  不要な項目の為削除（１行）　　　　　　　　　　　　　　　　　TD@1 */
	 short		mrupbkte;		/* ﾊﾞｯｸ ｱｯﾌﾟ BKT ｴﾝﾄﾘ				 */
/*  バックアップ変更に伴い削除（２行）	 						TD46 */
	 char		mrupjopf;		/* ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ﾌﾗｸﾞ				 */
/*  バックアップ変更に伴い削除（１行）	 						TD46 */
	 char		mrupespf;		/* ｼｭｳﾘｮｳ ﾄﾞｳｷ ｼｮﾘ ﾖｳ ﾌﾗｸﾞ			 */
	 char		mruprbif[3];	/* RBI ﾃｲｼｭｳｷ ﾃｲｼ ﾌﾗｸﾞ		    TD39 */
	 char		mrupjbkf;		/* ｼﾞｬｰﾅﾙﾊﾞｯｸｱｯﾌﾟﾌﾗｸﾞ			TD39 */
/*  ２重化ファイル削除に伴う変更（２行）						TD27 */
	 long		mruprqt1;		/* ﾘｸｴｽﾄ ｼｷﾍﾞﾂｼ 1					 */
	 long		mruprqt5;		/* ﾘｸｴｽﾄ ｼｷﾍﾞﾂｼ 5					 */
	 char		*mrupmgbf;		/* ﾃﾞﾝﾌﾞﾝ ｼﾞｭｼﾝ ﾊﾞｯﾌｧ ｱﾄﾞﾚｽ			 */
	 long		mrupcpcd;		/* ｺﾋﾟｰ ｼｮﾘ ｼｭｳﾘｮｳ ｺｰﾄﾞ1		(L05)*/
/*  Pｱﾎﾞｰﾄの見直しにより削除（１行）						    TD49 */
/*  不要な項目の為削除（１行）　　　　　　　　　　　　　　　　　TD@1 */
	 char		mruprtry;		/* ﾊﾞｯｸ ｱｯﾌﾟ ﾘﾄﾗｲ ﾌﾗｸﾞ			(L03)*/
	 char		mrupyob1;		/* 予備１						TD@1 */
	 short		mrupvmen;		/* VMT ﾘｽﾄ ｼｮﾘﾁｭｳ ｴﾝﾄﾘ	        (L05)*/
	 char		mrupdate[8];	/* ﾊﾞｯｸｱｯﾌﾟ ID					TD92 */
	 char		*mruppblt;		/* ｴﾗｰ PBT ﾘｽﾄ ｾﾝﾄｳ ｱﾄﾞﾚｽ		(L03)*/
	 long		mrupcpc2;		/* ｺﾋﾟｰ ｼｮﾘ ｼｭｳﾘｮｳ ｺｰﾄﾞ2		(L05)*/
/*  Pｱﾎﾞｰﾄの見直しにより削除（１行）						    TD49 */
     char		*mruppctp1;		/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽTPCTｱﾄﾞﾚｽ1    TD@1 */	
     char		*mruppctp2;		/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽTPCTｱﾄﾞﾚｽ2    TD@1 */	
	 char		mrupcpn1[9];	/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽ識別名1		TD@1 */
	 char		mrupuob2[3];	/* 予備２						TD@1 */
	 char		mrupcpn2[9];	/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽ識別名2		TD@1 */
	 char		mrupuob3[3];	/* 予備３						TD@1 */
	 char		mrupcmrn[8];	/* CM用RBIﾌﾟﾛｾｽ識別名			TD39 */
	 char		mrupl0rn[8];	/* LM0用RBIﾌﾟﾛｾｽ識別名			TD39 */
	 char		mrupl1rn[8];	/* LM1用RBIﾌﾟﾛｾｽ識別名			TD39 */
	 short		mrupemid;		/* ｴﾗｰ発生ﾓｼﾞｭｰﾙID				TD49 */
	 char		mrupyob4[2];	/* 予備４						TD@1 */
	 long		mrupedi1;		/* ｴﾗｰ詳細情報1					TD49 */
	 long		mrupedi2;		/* ｴﾗｰ詳細情報2					TD49 */
	 long		mrupedi3;		/* ｴﾗｰ詳細情報3					TD49 */
	 MRUVMT		mrupvmlt[21];   /* VMT ﾘｽﾄ      				(L05)*/
};
typedef struct mrucb MRUCB;

/*  バックアップ変更に伴い削除（５行）	 						TD46 */

/*********************************************************************/
/*	ｼｭｳﾘｮｳ ﾄﾞｳｷ ｼｮﾘ ﾖｳ ﾌﾗｸﾞ ﾉ ｱﾀｲ									 */
/*********************************************************************/
#define MRUPESPON	0x01		/* ｼｭｳﾘｮｳ ﾄﾞｳｷ ｼｮﾘ ﾖｳ ﾌﾗｸﾞ ｵﾝ		 */

/*********************************************************************/
/*	RBI ﾃｲｼｭｳｷ ﾃｲｼ ﾌﾗｸﾞ ﾉ ｱﾀｲ										 */
/*********************************************************************/
#define MRUPRBION	0x01		/* RBI ﾃｲｼｭｳｷ ﾃｲｼ ﾌﾗｸﾞ ｵﾝ			 */

/*  バックアップ変更に伴い削除（４行）	 						TD46 */

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ﾌﾗｸﾞ ﾉ ｱﾀｲ											 */
/*********************************************************************/
#define MRUPJOPON	0x01		/* ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ﾌﾗｸﾞ ｵﾝ				 */
#define MRUPJOPOF	0x00		/* ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ﾌﾗｸﾞ ｵﾌ				 */

/*  ２重化ファイル削除に伴う変更（１１行）						TD27 */

/*  不要な項目の為削除（４行）　　　　　　　　　　　　　　　　　TD@1 */

/*  Pｱﾎﾞｰﾄの見直しにより削除（５行）						    TD49 */

/*********************************************************************/
/* バックアップリトライフラグのＤＥＦＩＮＥ 					TD00 */
/*********************************************************************/
#define MRUPRTRY	0x01		/* ﾊﾞｯｸ ｱｯﾌﾟ ﾘﾄﾗｲ ﾌﾗｸﾞ ｵﾝ	   (L03) */

/*********************************************************************/
/* ｴﾗｰ PBT ﾘｽﾄ ﾌﾗｸﾞ ﾉ ｱﾀｲ											 */
/*********************************************************************/
#define MRUPPBER	0x01		/* PBT ﾘｽﾄ ｴﾗｰ ﾌﾗｸﾞ ｵﾝ		   (L03) */
#define MRUPURAE	0x02		/* PBT ﾘｽﾄ ｳﾗﾒﾝ ｴﾗｰ ﾌﾗｸﾞ ｵﾝ	   (L04) */
#define MRUPREDY	0x03		/* PBT ﾘｽﾄ ｼｮﾘｽﾞﾐ ﾌﾗｸﾞ ｵﾝ	   (L04) */

/*  不要な項目の為削除（４行）　　　　　　　　　　　　　　　　　TD@1 */

/*********************************************************************/
/* ＲＢＩプロセス電文送信用ＤＥＦＩＮＥ							TD00 */
/*********************************************************************/
#define MRUCMRBI	0x01		/* CM用RBIへ電文送信		    TD39 */
#define	MRULM0RBI	0x02		/* LM0用RBIへ電文送信		    TD39 */
#define	MRULM1RBI	0x03		/* LM1用RBIへ電文送信		    TD39 */

/*********************************************************************/
/* ジャーナルバックアップフラグのＤＥＦＩＮＥ					TD00 */
/*********************************************************************/
#define	MRUPJNBK	0x80		/* JNLﾊﾞｯｸｱｯﾌﾟ済み				TD42 */
#define	MRUPKJBK	0x40		/* KJﾊﾞｯｸｱｯﾌﾟ済み				TD42 */

/*********************************************************************/
/* エラー情報設定領域初期化のＤＥＦＩＮＥ						TD00 */
/*********************************************************************/
#define	MRUECLR	mc_clea((char *)&ucb->mrupemid,0x00, \
				sizeof(ucb->mrupemid)); \
				mc_clea((char *)&ucb->mrupedi1,0x00, \
				sizeof(ucb->mrupedi1)); \
				mc_clea((char *)&ucb->mrupedi2,0x00, \
				sizeof(ucb->mrupedi2)); \
				mc_clea((char *)&ucb->mrupedi3,0x00, \
				sizeof(ucb->mrupedi3))
								/* 							    TD49 */
								/* 							    TD49 */
								/* 							    TD49 */
								/* 							    TD49 */
								/* 							    TD49 */
								/* 							    TD49 */
								/* 							    TD49 */
								/* 							    TD49 */
