/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム　										*/
/*				ＲＣＶ　ボリュームリカバリ（ＦＪ無し）	(mr_vxxx系)			*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 										*/
/*＜サービス項目ＩＤ＞				 										*/
/*＜モジュール名＞					 ＶＲＣＶ（ＦＪ無し）共通ヘッダ			*/
/*＜モジュールＩＤ＞				 										*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 柴崎　智子								*/
/*＜設計年月日＞					 １９９４年０６月０１日					*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 柴崎　智子								*/
/*＜ソース作成年月日＞				 １９９４年１０月０５日					*/
/*--------------------------------------------------------------------------*/
/*＜ソース修正者名＞				 杉岡  克也								*/
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９５年  ３月１５日	CT0934(ST2492)  */
/*＜ソース修正者名＞				 杉岡  克也								*/
/*＜ソース修正年月日及び修正ＩＤ＞   １９９５年  ６月１３日	ST2814			*/
/*＜ソース修正者名＞				 柴崎　智子								*/
/*＜ソース修正年月日及び修正ＩＤ＞   １９９５年  ７月１４日	ST2893			*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*		ＶＲＣＶ（ＦＪ無し）プロセス制御ブロック定義						*/
/*		ＶＲＣＶ（ＦＪ無し）関数返却値定義									*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*																			*/
/****************************************************************************/
/****************************************************************************/
/*	ＶＲＣＶ（ＦＪ無し）終了コード											*/
/****************************************************************************/
#define	MRVNORMAL	0L					/* 正常終了							*/
#define	MRVNORMX	1L					/* 復旧不可能なボリュームが存在する	*/
#define	MRVTRMRQ	-3L					/* プロセス終了依頼受信				*/
#define	MRVIVPARM	-6L					/* パラメタエラー					*/
#define	MRVENVERR	-9L					/* 起動環境エラー					*/

/****************************************************************************/
/*	ＶＲＣＶ（ＦＪ無し）返却値												*/
/****************************************************************************/
/****************************************/
/*	共通								*/
/****************************************/
#define	MRVNRML		0L					/* 正常終了							*/
#define	MRVNRMX		1L					/* 条件付き正常終了					*/
#define	MRVVERR		-1L					/* 復旧失敗（Ｉ／Ｏエラー）			*/
#define	MRVFALT		-2L					/* 復旧失敗（Ｉ／Ｏエラー以外）		*/
#define	MRVVBSY		-3L					/* ボリューム使用中					*/
#define	MRVPRER		-4L					/* パラメタエラー					*/
#define	MRVBKUE		-5L					/* パラメタエラー(ﾊﾞｯｸｱｯﾌﾟID異常)	*/
#define	MRVENVE		-6L					/* 起動環境エラー					*/
#define	MRVUNKN		-7L					/* 未対応の完了／電文受信			*/
#define	MRVTRRQ		-8L					/* プロセス終了要求					*/
#define	MRVEBID		-9L					/* バックアップＩＤが異なる			*/
#define	MRVEBYT		-10L				/* バックアップ未である				*/
#define	MRVFDEL		-11L				/* ファイル削除						*/
#define	MRVABRT		-12L				/* アボート要因発生					*/

/****************************************/
/*	物理ﾎﾞﾘｭｰﾑ閉塞解除完了電文受信処理	*/
/*								mr_vany	*/
/****************************************/
#define	MRVPVNR		0L					/* 物理ｖｏｌ閉塞解除完了			*/
#define	MRVPVXO		1L					/* 物理ﾎﾞﾘｭｰﾑ閉塞解除時未実装(自系)	*/
#define	MRVPVXY		5L					/* 物理ﾎﾞﾘｭｰﾑ閉塞解除時未実装(他系)	*/
#define	MRVPVEO		2L					/* 物理ｖｏｌ閉塞解除失敗(自系)		*/
#define	MRVPVEY		6L					/* 物理ｖｏｌ閉塞解除失敗(他系)		*/
#define	MRVTOUT		3L					/* タイマ完了						*/

/****************************************/
/*	ﾐﾗｰﾎﾞﾘｭｰﾑ状態取得処理		mr_vvmi	*/
/*		*)osioctlにて取得した			*/
/*		  構造体osf_mvinfoのstateの値	*/
/****************************************/
#define	MRVMRSMSK	0xFFFF0000			/* マスク用					CT0934	*/
#define	MRVMRSNML	0x00000000			/* 両肺状態							*/
#define	MRVMRSM		0x80000000			/* 正系片肺状態						*/
										/* 正系片肺（障害時）削除	CT0934  */
#define	MRVMRSMR	0x20000000			/* 正系→副系復旧状態				*/
#define	MRVMRSMC	0x10000000			/* 正系→副系コピー状態				*/
#define	MRVMRSMHR	0x01000000			/* 正系→副系引継復旧状態	CT0934  */
#define	MRVMRSS		0x00800000			/* 副系片肺状態						*/
										/* 副系片肺（障害時）削除	CT0934  */
#define	MRVMRSSR	0x00200000			/* 副系→正系復旧状態				*/
#define	MRVMRSSC	0x00100000			/* 副系→正系コピー状態				*/
#define	MRVMRSSHR	0x00010000			/* 副系→正系引継復旧状態	CT0934	*/
#define	MRVMRSVU	0x00008000			/* 使用中（ＯＰＥＮ中）				*/

/****************************************/
/*	該当ファイルチェック処理	mr_vfck	*/
/****************************************/
#define	MRVFCRE		1L					/* ファイル創成要					*/
#define	MRVFNCR		0L					/* ファイル創成不要					*/

/****************************************************************************/
/*	リクエスト識別子格納域インデックス										*/
/****************************************************************************/
#define	MRVREQCNT	3					/* リクエスト識別子最大個数			*/
#define	MRVRMPR		0					/* メイルボックスへの受信要求		*/
#define	MRVIIOC		1					/* ｏｓｉｉｏｃｔｌ発行				*/
#define	MRVWTIM		2					/* タイマ							*/

/****************************************************************************/
#define	MRVADIR		0x04000000			/* osf_info.aflag ディレクトリ		*/
#define	MRVABSF		0x06000000			/* osf_info.aflag 					*/

#define	MRVAMSK		0x0F000000			/* osf_info.aflag					*/

/****************************************************************************/
/*	物理ボリューム情報構造体												*/
/****************************************************************************/
struct	mrvnpvt
{
	char	*mrvvnam;					/* 物理ボリューム識別名				*/
	short	mrvpvte;					/* ＴＰＶＴエントリ番号				*/
	short	mrvhsts;					/* 閉塞解除ステータス				*/
	long	mrvcrcd;					/* ｏｓｃｏｎｆｉｇ返却値格納域		*/
};
typedef	struct	mrvnpvt	MRVNPVT;
#define	MRVNPVTSZ	sizeof(MRVNPVT)

/****************************************/
/*	閉塞解除ステータス					*/
/****************************************/
#define	MRVENUNO	(short)-1			/* 装置未実装						*/

/****************************************************************************/
/*	論理ボリューム情報構造体												*/
/****************************************************************************/
struct	mrvrvmt
{
	char	*mrvvnam;					/* 論理ボリューム識別名				*/
	short	mrvvmtm;					/* ＴＶＭＴエントリ番号（正）		*/
	short	mrvvmts;					/* ＴＶＭＴエントリ番号（副）		*/
	long	mrvvrcm;					/* 回復結果（正）					*/
	long	mrvvrcs;					/* 回復結果（副）					*/
	unsigned	char	mrvsysm;		/* I/Oｴﾗｰ発生処理種別(正)	(ST2893)*/
	unsigned	char	mrvsyss;		/* I/Oｴﾗｰ発生処理種別(副)	(ST2893)*/
	char	mrvrcv1[2];					/* 予備						(ST2893)*/
	long	mrvecdm;					/* Ｉ／Ｏエラー詳細（正）	(ST2893)*/
	long	mrvecds;					/* Ｉ／Ｏエラー詳細（副）	(ST2893)*/
	char	*mrverrf;					/* I/Oｴﾗｰ発生ﾌｧｲﾙ名			(ST2893)*/
	short	mrvvbte;					/* ＴＶＢＴエントリ番号				*/
	char	mrvstsm;					/* ボリュームステータス退避域（正）	*/
	char	mrvstss;					/* ボリュームステータス退避域（副）	*/
	unsigned	char	mrvrcvm;		/* 回復処理情報						*/
	unsigned	char	mrvrcvf;		/* リカバリファイル情報				*/
	unsigned	char	mrvrcve;		/* 異常リカバリファイル情報			*/
	char	mrvbmnt;					/* ﾊﾞｯｸｱｯﾌﾟﾎﾞﾘｭｰﾑﾏｳﾝﾄ要/不要		*/
	long	mrvmrfd;					/* ﾐﾗｰﾎﾞﾘｭｰﾑ特殊ﾌｧｲﾙﾌｧｲﾙ記述子		*/
	long	*mrvbfad;					/* ﾐﾗｰﾎﾞﾘｭｰﾑ復旧ｺﾋﾟｰﾊﾞｯﾌｧ域ｱﾄﾞﾚｽ	*/
	long	*mrvdfnm;					/* 削除ファイル名退避域アドレス		*/
};
typedef	struct	mrvrvmt	MRVRVMT;
#define	MRVRVMTSZ	sizeof(MRVRVMT)

/****************************************/
/*	回復処理情報定義					*/
/****************************************/
#define	MRVSFMM		0x01				/* フォーマット要（ｍ）				*/
#define	MRVSFMS		0x02				/* フォーマット要（ｓ）				*/
#define	MRVSMVT		0x04				/* ミラーボリューム状態遷移要		*/
#define	MRVSMRC		0x08				/* ボリュームコピープロセス起動要	*/
#define	MRVSMRI		0x10				/* ＲＣＶファイル創成プロセス起動要	*/
#define	MRVSMVR		0x20				/* ミラーボリューム復旧要			*/
#define	MRVSMDR		0x40				/* バックアップ不要ボリューム回復要	*/
#define	MRVSWKV		0x80				/* ワークファイルボリューム回復要	*/

/****************************************/
/*	リカバリファイル情報(ビット情報)	*/
/****************************************/
#define	MRVRRCM		0x01				/* ＲＢＩ（ＣＭ用）ファイル			*/
#define	MRVRRL0		0x02				/* ＲＢＩ（ＬＭ０用）ファイル		*/
#define	MRVRRL1		0x04				/* ＲＢＩ（ＬＭ１用）ファイル		*/
#define	MRVRFK1		0x08				/* KJ（現在使用面）ﾌｧｲﾙ		ST2814	*/
#define	MRVRFJ1		0x10				/* JNL（現在使用面）ﾌｧｲﾙ	ST2814	*/
#define	MRVRFK2		0x20				/* KJ（待機面）ﾌｧｲﾙ			ST2814	*/
#define	MRVRFJ2		0x40				/* JNL（待機面）ﾌｧｲﾙ		ST2814	*/
#define	MRVRCVT		(MRVRFJ2|MRVRFK2)	/* 待機面ファイル					*/

/****************************************************************************/
/*	ＶＲＣＶ（ＦＪ無し）プロセス情報制御ブロック							*/
/****************************************************************************/
struct	mrvcb
{
	char	mrvbkid[4];					/* ブロック識別子					*/
	char	mrvmode;					/* 処理種別							*/
	char	mrvydrv;					/* 起動時予備系運転状態(ﾎｯﾄｽﾀﾝﾊﾞｲ)	*/
	char	mrvverr;					/* 回復状況フラグ					*/
	char	mrvjnlf;					/* ジャーナルオープンフラグ			*/
	long	mrvpvts;					/* ＴＰＶＴ資源番号					*/
	long	mrvvmts;					/* ＴＶＭＴ資源番号					*/
	long	mrvsrts;					/* ＴＳＲＴ資源番号					*/
	long	mrvrqid[MRVREQCNT];			/* リクエスト識別子格納域			*/
	char	*mrvrmsg;					/* 受信電文アドレス格納域			*/
	TPCTPSZ	*mrvmrcp;					/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽTPCTｴﾝﾄﾘｱﾄﾞﾚｽ		*/
	char	mrvmrcn[12];				/* ボリュームコピープロセス識別名	*/
	char	mrvmrcf;					/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽ起動ﾌﾗｸﾞ			*/
	char	mrvrsv1[3];
	TPCTPSZ	*mrvmrip;					/* ﾘｶﾊﾞﾘﾌｧｲﾙ創成ﾌﾟﾛｾｽTPCTｴﾝﾄﾘｱﾄﾞﾚｽ	*/
	char	mrvmrin[12];				/* ﾘｶﾊﾞﾘﾌｧｲﾙ創成ﾌﾟﾛｾｽ識別名			*/
	char	mrvmrif;					/* ﾘｶﾊﾞﾘﾌｧｲﾙ創成ﾌﾟﾛｾｽ起動ﾌﾗｸﾞ		*/
	char	mrvrsv2[3];
	TPCTPSZ	*mrvmria;					/* ﾎﾞﾘｭｰﾑ復旧情報通知先APﾌﾟﾛｾｽTPCT	*/
	short	mrvbkte;					/* 復旧元ＴＢＫＴエントリ番号		*/
	char	mrvrsv3[2];					/* 予備								*/
	long	mrvvolc;					/* 処理対象ボリューム数				*/
	union	{
		MRVNPVT	*mrvnpvt;				/* 回復ボリューム情報				*/
		MRVRVMT	*mrvrvmt;				/* リストアボリューム情報			*/
	}mrvvoll;
										/* ２行削除			CT1091(ST2993)	*/
	long	*mrvvmtf;					/* ＶＭＴ処理済フラグ				*/
	long	mrvmdid;					/* アボート要因発生モジュールＩＤ	*/
	long	mrvdtl1;					/* 詳細情報１						*/
	long	mrvdtl2;					/* 詳細情報２						*/
	long	mrvdtl3;					/* 詳細情報３						*/
	long	mrvercd;					/* Ｉ／Ｏエラーコード退避域			*/
	unsigned	char	mrvsysk;		/* I/Oｴﾗｰ発生ｼｽﾃﾑｺｰﾙ種別	(ST2893)*/
	char	mrvrcv4[3];					/* 予備						(ST2893)*/
	char	*mrverrf;					/* I/Oｴﾗｰ発生ﾌｧｲﾙ名			(ST2893)*/
};
typedef	struct	mrvcb	MRVCB;

#define	MRVCBSZ 	sizeof(MRVCB)		/* プロセス情報制御ブロック領域長	*/
#define	MRVCBID		"VCB "				/* ブロック識別子					*/

#define	mrvnpvtp	mrvvoll.mrvnpvt
#define	mrvrvmtp	mrvvoll.mrvrvmt

/****************************************************************************/
/*	ディレクトリ形式														*/
/****************************************************************************/
/****************************************/
/*	自ディレクトリの為のエレメント形式	*/
/****************************************/
struct	mrvowne
{
	long	mrvofln;					/* 自ディレクトリのＦＬＣＢ番号		*/
	long	mrvpfln;					/* 親ディレクトリのＦＬＣＢ番号		*/
	char	mrvrsv1[12];				/* 未使用							*/
	long	mrvflag;					/* エレメントを管理するフラグ		*/
};
typedef	struct	mrvowne	MRVOWNE;

/****************************************/
/*	ﾌｧｲﾙまたは子ﾃﾞｨﾚｸﾄﾘの為のｴﾚﾒﾝﾄ形式	*/
/****************************************/
struct	mrvchde
{
	char	mrvname[16];				/* ファイル名／ディレクトリ名		*/
	long	mrvflcb;					/* 当該ファイルＦＬＣＢ番号			*/
	long	mrvflag;					/* エレメントを管理するフラグ		*/
};
typedef	struct	mrvchde	MRVCHDE;

struct	mrvelmn
{
	long	mrvelnm;					/* エレメント個数					*/
	long	mrvsynm;					/* シノニム情報						*/
};
typedef	struct	mrvelmn	MRVELMN;
