/****************************************************************************/
/*	Ãøºî¸¢¡¡£±£¹£¹£³														*/
/*			¡¡£Î£Ô£Ô¥Ç¡¼¥¿ÄÌ¿®³ô¼°²ñ¼Ò										*/
/*				¶âÍ»¥·¥¹¥Æ¥à»ö¶ÈËÜÉô										*/
/*																			*/
/*																			*/
/*	¼ýÍÆÊª¡¡£Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à¡¡										*/
/*				£Ò£Ã£Ö¡¡¥Ü¥ê¥å¡¼¥à¥ê¥«¥Ð¥ê¡Ê£Æ£ÊÌµ¤·¡Ë	(mr_vxxx·Ï)			*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä					 ¸Î¾ã²óÉü¶ÈÌ³							*/
/*¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä					 £Ò£Ã£Ö									*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä				 										*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜ£É£Ä¡ä				 										*/
/*¡ã¥â¥¸¥å¡¼¥ëÌ¾¡ä					 £Ö£Ò£Ã£Ö¡Ê£Æ£ÊÌµ¤·¡Ë¥Ø¥Ã¥À¥Õ¥¡¥¤¥ëÄêµÁ	*/
/*¡ã¥â¥¸¥å¡¼¥ë£É£Ä¡ä				 										*/
/*¡ã¥â¥¸¥å¡¼¥ëÄÌÈÖ¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ãÅ¬ÍÑµ¡¼ï¡ä						 £Á£Ã£Å									*/
/*¡ãÅ¬ÍÑ£Ï£Ó¡ä						 £Ô£Ò£Á£Ä£Å								*/
/*¡ã³«È¯´Ä¶­¡ä						 £Ó£Õ£Î  £Ó£Ð£Á£Ò£Ã¡Ý£É£Ð£Ø				*/
/*¡ãµ­½Ò¸À¸ì¡ä						 £Ã¸À¸ì									*/
/*¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä				 ´Ø¿ô									*/
/*¡ãµ¡Ç½¶èÊ¬¡ä																*/
/*¡ãÂÐ¾Ý¥Ç¡¼¥¿¡ä															*/
/*¡ã¹©Äø¡¦³¬ÁØ¶èÊ¬¡ä				 										*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä				 £Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à					*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä				 £µ£·£²£¶£°£±£´£°£²£±£°£°				*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯Ã´ÅöÌ¾¡ä					 ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö						*/
/*¡ãÅÅÏÃÈÖ¹æ¡ä						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*¡ãÀß·×¼ÔÌ¾¡ä						 ¼Æºê¡¡ÃÒ»Ò								*/
/*¡ãÀß·×Ç¯·îÆü¡ä					 £±£¹£¹£´Ç¯£°£¶·î£°£±Æü					*/
/*--------------------------------------------------------------------------*/
/*¡ã¥½¡¼¥¹ºîÀ®¼ÔÌ¾¡ä				 ¼Æºê¡¡ÃÒ»Ò								*/
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				 £±£¹£¹£´Ç¯£±£°·î£°£µÆü					*/
/*--------------------------------------------------------------------------*/
/*¡ã¸«ÀÑ¥¹¥Æ¥Ã¥×¿ô¡ä				 ¡©¡©¡©¥¹¥Æ¥Ã¥×							*/
/*--------------------------------------------------------------------------*/
/*¡ãµ¡Ç½³µÍ×¡ä																*/
/*		£Ö£Ò£Ã£Ö¡Ê£Æ£ÊÌµ¤·¡Ë¥×¥í¥»¥¹¤Ç»ÈÍÑ¤¹¤ë¥Ø¥Ã¥À¥Õ¥¡¥¤¥ë¤ò¶¦ÄÌ¤Ë£é£î£ã	*/
/*		£ì£õ£ä£å¤¹¤ë														*/
/*--------------------------------------------------------------------------*/
/*¡ã¸Æ½Ð·Á¼°¡ä																*/
/*																			*/
/*¡ã²¾°ú¤­¿ô¡ä																*/
/*																			*/
/*¡ãÊÖµÑÃÍ¡ä   																*/
/*--------------------------------------------------------------------------*/
/*¡ãÆþ½ÐÎÏ¥Ç¡¼¥¿¹½Â¤¡ä														*/
/*																			*/
/*¡ãÀ©¸Â»ö¹à¡ä																*/
/*	  ÆÃ¤Ë¤Ê¤·																*/
/*																			*/
/*¡ã»ÈÍÑ³°Éô¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*																			*/
/*¡ã¸Æ½Ð¸µ¤Î¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*																			*/
/****************************************************************************/
#include	<ossstd.h>
#include	<osgetinf.h>
#include	<osizze.h>
#include	<osf.h>
#include	<osfmrr.h>
#include	<oscrepr.h>
#include	<oswchld.h>
#include	<osgfinf.h>
#include	<ossenmsp.h>
#include	<osrcvmsp.h>
#include	<osrcvmspr.h>
#include	<ossnsms.h>
#include	<osanyrl.h>
#include	<oscanrq.h>
#include	<ossttim.h>
#include	<osgtdat.h>

#include	"tcom.h"
#include	"tsst.h"
#include	"tsrt.h"
#include	"tcst.h"
#include	"tpct.h"
#include	"tbpt.h"
#include	"tabp.h"
#include	"tvmt.h"
#include	"tmrt.h"
#include	"tgmt.h"
#include	"tsgt.h"
#include	"tfmt.h"
#include	"tkmt.h"
#include	"ttct.h"
#include	"tjct.h"
#include	"trbt.h"
#include	"tbkt.h"
#include	"tpvt.h"
#include	"tsur.h"
#include	"tpbt.h"
#include	"tvbt.h"
#include	"twmt.h"

#include	"psect.h"
#include	"mopcb.h"
#include	"mrcom.h"
#include	"mfcom.h"

#include	"mc.h"
#include	"mcdebug.h"
#include	"md.h"

#include	"mr.h"
#include	"mrcode.h"
#include	"mrmac.h"
#include	"mrmuse.h"
#include	"mrmsg.h"
#include	"mrjnl.h"
#include	"mrf.h"
#include	"mrl.h"
#include	"mrv.h"
#include	"mrvdef.h"

#include	"mo.h"
#include	"mo_wlg.h"
#include	"momhead.h"

#include	"mf.h"
#include	"mfjnl.h"
