/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム　										*/
/*				ＲＣＶ　ボリュームリカバリ（ＦＪ無し）	(mr_vxxx系)			*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 										*/
/*＜サービス項目ＩＤ＞				 										*/
/*＜モジュール名＞					 ＶＲＣＶ（ＦＪ無し）システムコール定義	*/
/*＜モジュールＩＤ＞				 										*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 柴崎　智子								*/
/*＜設計年月日＞					 １９９５年０７月１３日					*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 柴崎　智子								*/
/*＜ソース作成年月日＞				 １９９５年０７月１３日					*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 ？？？ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*		ＶＲＣＶ（ＦＪ無し）プロセスで使用するシステムコールの種別、及びシ	*/
/*		ステムコール名を定義する(ST2893)									*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*																			*/
/*＜仮引き数＞																*/
/*																			*/
/*＜返却値＞   																*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*																			*/
/****************************************************************************/
static	struct	mrvmsg	{
	unsigned	char	mrvsysk;		/* システムコール種別				*/
	char				rsv[3];			/* 予備								*/
	char				*mrvsysn;		/* システムコール名					*/
}	mrvmsg[] = 
{
{
	(unsigned char)0,
	{0,0,0},
	" "
},
{
	MRVCLOSE,
	{0,0,0},
	"osclose"
},
{
	MRVCONN,
	{0,0,0},
	"osconn"
},
{
	MRVCREAT,
	{0,0,0},
	"oscreat"
},
{
	MRVDCONN,
	{0,0,0},
	"osdconn"
},
{
	MRVDELET,
	{0,0,0},
	"osdelet"
},
{
	MRVEXTEN,
	{0,0,0},
	"osexten"
},
{
	MRVMOUNT,
	{0,0,0},
	"osmount"
},
{
	MRVOPEN,
	{0,0,0},
	"osopen"
},
{
	MRVTRUNC,
	{0,0,0},
	"ostrunc"
},
{
	MRVUMOUNT,
	{0,0,0},
	"osumount"
},
{
	MRVUMOUNTF,
	{0,0,0},
	"osumountf"
},
{
	MRVREAD,
	{0,0,0},
	"osread"
},
{
	MRVSEEK,
	{0,0,0},
	"osseek"
},
{
	MRVWRITD,
	{0,0,0},
	"oswritd"
},
{
	MRVGFINF,
	{0,0,0},
	"osgfinf"
},
{
	MRVIOCTL,
	{0,0,0},
	"osioctl"
},
{
	MRVIIOCTL,
	{0,0,0},
	"osiioctl"
},
{
	MRVCONFIG,
	{0,0,0},
	"osconfig"
}
};

#define	MRVMCNT		( sizeof( mrvmsg ) / sizeof( struct mrvmsg ) )
