/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		ﾎﾞﾘｭｰﾑ ﾘｶﾊﾞﾘ ﾃｲｷﾞ ﾌｧｲﾙ (mrw.h)								 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾎﾞﾘｭｰﾑ ﾘｶﾊﾞﾘ ｼｮﾘ											 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲ ｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*		ｻｸｾｲ ｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*		ﾍﾝｺｳｼﾔ  : ｽｽﾞｷ ｵｻﾑ			 	'88/10/11 (L01)				 */
/*				 (ｼﾞｬｰﾅﾙ ﾘｰﾄﾞ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC1230			 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			    '89/03/01 (L02)				 */
/*				(ｲｼﾞｮｳ ｼｭｳﾘｮｳｼﾞ ｱﾎﾞｰﾄ ｷﾉｳ ﾉ ﾂｲｶ) --- TC2419			 */
/*      変更者 : 今井　弘幸              95/05/22  TD-00             */
/*                (ﾌﾟﾛｾｽｱﾎﾞｰﾄの見直しに伴う変更)        TD-49        */
/*				  (ﾊﾞｯｸｱｯﾌﾟ変更に伴う変更)				TD-46		 */
/*				  (ﾎﾞﾘｭｰﾑ閉塞単位変更に伴う変更)		TD-90		 */
/*				  (2重化ﾌｧｲﾙ削除に伴う変更)				TD-27		 */
/*				  (ﾎｯﾄｽﾀﾝﾊﾞｲ変更に伴う変更)				TD-02 		 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ｼｭｳﾘｮｳ ｺｰﾄﾞ / ﾍﾝｷｬｸﾁ											 */
/*********************************************************************/
#define MRWNORMAL	0L		/*	ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ						 */
#define MRWNORMX	1L		/*	ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ						 */
#define MRWGETMSG	2L		/*	ﾀ ﾌﾟﾛｾｽ ｶﾗﾉ ｼﾞｭｼﾝ					 */
#define	MRWALLRCV	3L		/*	ﾌｯｷｭｳ ｼｮﾘ ｼｭｳﾘｮｳ					 */
#define	MRWNALLRCV	4L		/*	ﾌｯｷｭｳ ｶﾞ ｼｭｳﾘｮｳ ｼﾃｲﾅｲ ﾓﾉｶﾞ ｿﾝｻﾞｲ ｽﾙ  */
#define MRWSTATERR	-1L		/*	ﾘｶﾊﾞﾘ ﾌﾖｳ ｼｽﾃﾑ						 */
#define	MRWIVPARM	-2L		/*	ﾊﾟﾗﾒﾀ ｴﾗｰ							 */
#define MRWVRTERM	-3L		/*	ﾌﾟﾛｾｽ ｷｮｳｾｲ ｼｭｳﾘｮｳ					 */
#define	MRWONBKUP	-4L		/*	ﾊﾞｯｸ ｱｯﾌﾟ ﾁｭｳ					TD49 */
#define	MRWNONVOL	-5L		/*	ﾘﾗﾝ対応の復旧ﾎﾞﾘｭｰﾑが存在しない TD49 */
#define	MRWHOTWAIT	-6L		/*  ﾎｯﾄｽﾀﾝﾊﾞｲ予備系での起動			TD02 */
#define	MRWONHINF	-7L		/*  VRCV前処理中					TD90 */
#define MRWENVERR	-8L		/*	ﾎｯﾄｽﾀﾝﾊﾞｲでの起動中予備系ﾀﾞｳﾝ	TD02 */
/* プロセスアボート見直しにより削除（２行）						TD49 */
/* ﾊﾞｯｸｱｯﾌﾟ変更に伴う削除（１行）								TD46 */
#define MRWEOF		-9L		/*	ﾃﾞ-ﾀ ﾉ ｵﾜﾘ							 */
#define	MRWNOBKUP	-10L	/*	ﾊﾞｯｸ ｱｯﾌﾟ ｼﾞｮｳﾎｳ ｶﾞ ｿﾝｻﾞｲ ｼﾅｲ		 */
#define	MRWNOJNL	-11L	/*	ｼﾞｬｰﾅﾙ ｼﾞｮｳﾎｳ ｶﾞ ｿﾝｻﾞｲ ｼﾅｲ			 */
#define MRWJNLERR	-12L	/*	ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ｱｸｾｽ ｴﾗｰ				 */
#define	MRWIOERR	-13L	/*	I/O ｴﾗｰ								 */
#define	MRWPIOERR	-14L	/*	ﾌｯｷｭｳ ﾎﾞﾘｭｳﾑ I/O ｴﾗｰ				 */
#define	MRWBIOERR	-15L	/*	ﾊﾞｯｸ ｱｯﾌﾟ ﾎﾞﾘｭｳﾑ I/O ｴﾗｰ			 */
#define	MRWINITERR	-16L	/*	ｼｮｷｶ ｼｯﾊﾟｲ							 */
#define MRWTIMOUT	-17L	/*	ﾀｲﾑ ｱｳﾄ								 */
#define MRWJDERR	-18L	/*	ｼﾞｬ-ﾅﾙ ﾃﾞ-ﾀ ｴﾗ-						 */
#define MRWVCPSTP	-19L	/*	ﾎﾞﾘｭｰﾑ ｺﾋﾟｰ ﾌﾟﾛｾｽ ｷｮｳｾｲ ｼｭｳﾘｮｳ		 */
#define MRWNOTOBJ	-20L	/*	ＶＲＣＶ対象のボリュームでない	TD90 */
#define MRWSDOWN	-22L	/*	システムダウン要因発生			TD02 */
#define	MRWOSERR	-23L	/*	ｼｽﾃﾑｺｰﾙｴﾗｰ						TD61 */
#define	MRWNOVMT	-24L	/* 指定されたﾎﾞﾘｭｰﾑに該当するﾌｧｲﾙでない	 */
							/*									TD@1 */
#define	MRWNOEXT	-25L	/* 未創成							TD@1 */
#define	MRWNOFIP	-26L	/* FIP管理外						TD@1 */
#define	MRWABORT	-99L	/*	ｱﾎﾞｰﾄ要因発生					TD49 */

/*********************************************************************/
/*	ｼﾞｭｼﾝ ﾃﾞﾝﾌﾞﾝ ｼｭﾍﾞﾂ ﾉ ｱﾀｲ										 */
/*********************************************************************/
/* ﾊﾞｯｸｱｯﾌﾟ変更に伴う削除（１行）								TD49 */
#define	MRWVOLERR	2L		/*	ﾎﾞﾘｭｰﾑ ﾍｲｿｸ ﾃﾞﾝﾌﾞﾝ					 */
#define	MRWTRMPR	3L		/*	ﾌﾟﾛｾｽ ｼｮｳﾒﾂ ﾂｳﾁ ﾃﾞﾝﾌﾞﾝ				 */
#define	MRWTHMSG	4L		/*	ｶﾝｹｲ ﾉ ﾅｲ ﾃﾞﾝﾌﾞﾝ					 */


/*********************************************************************/
/*	MRWFEB (ﾌｯｷｭｳ ﾌｧｲﾙ ｼﾞｮｳﾎｳ ｶﾝﾘ ﾘｮｳｲｷ ﾍｯﾀﾞｰﾌﾞ)					 */
/*********************************************************************/
struct mrwfeb {
	char	mrwwfbid[4];		/* ﾌﾞﾛｯｸ ｼｷﾍﾞﾂｼ						 */
	short	mrwwfent;			/* ﾕｳｺｳ ｴﾝﾄﾘ ｽｳ						 */
	char	mrwwfyb1[2];		/* ﾖﾋﾞ								 */
	char	*mrwwfwvp;			/* MRWVEB ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ				 */
	char	*mrwwfveb;			/* MRVEB ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ				 */
};
typedef	struct mrwfeb MRWFEB;

/*********************************************************************/
/*	MRWFEBP (ﾌｯｷｭｳ ﾌｧｲﾙ ｼﾞｮｳﾎｳ ｶﾝﾘ ﾘｮｳｲｷ ｺﾍﾞﾂﾌﾞ)					 */
/*********************************************************************/
struct mrwfebp {
	short	mrwwfmtn;			/* ﾌｯｷｭｳ FMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	short	mrwwfyb1;			/* 予備１			 		    TD27 */
	long	mrwwffd;			/* ﾌｧｲﾙ ｷｼﾞｭﾂｼ						 */
	char	mrwwfyb2[4];		/* ﾖﾋﾞ							TD27 */
};
typedef	struct mrwfebp MRWFEBP;

/*********************************************************************/
/*	MRWFEB ｼｷﾍﾞﾂｼ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWWFBID	"WFEB"

/* 2重化ﾌｧｲﾙ廃止による削除（４行）								TD27 */

/*********************************************************************/
/*	MRWVEB (ﾌｯｷｭｳ ﾛﾝﾘ ﾎﾞﾘｭｰｳﾑ ｼﾞｮｳﾎｳ ｶﾝﾘ ﾘｮｳｲｷ ﾍｯﾀﾞｰﾌﾞ)				 */
/*********************************************************************/
struct mrwveb {
	char		mrwwvbid[4];	/* ﾌﾞﾛｯｸ ｼｷﾍﾞﾂｼ						 */
	short		mrwwvent;		/* ﾕｳｺｳ ｴﾝﾄﾘ ｽｳ						 */
	char		mrwwvyb1[2];	/* ﾖﾋﾞ								 */
	char		mrwwvyb2[4];	/* ﾖﾋﾞ								 */
};
typedef	struct mrwveb MRWVEB;

/*********************************************************************/
/*	MRWVEB (ﾌｯｷｭｳ ﾛﾝﾘ ﾎﾞﾘｭｰｳﾑ ｼﾞｮｳﾎｳ ｶﾝﾘ ﾘｮｳｲｷ ｺﾍﾞﾂﾌﾞ)				 */
/*********************************************************************/
struct mrwvebp {
	short		mrwwvmtn;		/* ﾌｯｷｭｳ VMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	short		mrwwvsta;		/* 復旧ステータス				TD90 */
	MRWFEB		*mrwwvfbp;		/* MRWFEB ｱﾄﾞﾚｽ						 */
	char		*mrwwvebp;		/* MRVEBPｱﾄﾞﾚｽ					TD90 */
	long		mrwwveof;		/* EOF ｼﾞｮｳﾎｳ ｶｸﾉｳ ｲｷ ｱﾄﾞﾚｽ			 */
	char		mrwwrtim[8];	/* 故障発生日付時刻				TD90 */
	long		mrwwerif;		/* RCVﾌｧｲﾙ故障情報				TD22 */
	long		mrwwbeif;		/* RCVﾌｧｲﾙ収容情報				TD22 */
	long		mrwwercd;		/* ﾎﾞﾘｭｰﾑ故障ｺｰﾄﾞ				TD90 */
};
typedef	struct mrwvebp MRWVEBP;

/*********************************************************************/
/*	MRWVEB ｼｷﾍﾞﾂｼ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWWVBID	"WVEB"

/* ﾎﾞﾘｭｰﾑ閉塞単位変更により削除（６行）							TD90 */

/*********************************************************************/
/*	MRVEB (ﾌｯｷｭｳ ﾌﾞﾂﾘ ﾎﾞﾘｭｰｳﾑ ｼﾞｮｳﾎｳ ｶﾝﾘ ﾘｮｳｲｷ ﾍｯﾀﾞｰﾌﾞ)				 */
/*********************************************************************/
struct mrveb {
	char		mrwvhbid[4];	/* ﾌﾞﾛｯｸ ｼｷﾍﾞﾂｼ						 */	
	short		mrwvhent;		/* ﾕｳｺｳ ｴﾝﾄﾘ ｽｳ						 */
	short		mrwvhyb1;		/* ﾖﾋﾞ								 */
};
typedef	struct mrveb MRVEB;

/*********************************************************************/
/*	MRVEB (ﾌｯｷｭｳ ﾌﾞﾂﾘ ﾎﾞﾘｭｰｳﾑ ｼﾞｮｳﾎｳ ｶﾝﾘ ﾘｮｳｲｷ ｺﾍﾞﾂﾌﾞ)				 */
/*********************************************************************/
struct mrvebp {
	TPVTPSZ		*mrwvpvtp;		/* ﾌｯｷｭｳ PVT ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ			 */
	MRWVEB		*mrwvwebp;		/* MRWVEB ｱﾄﾞﾚｽ						 */
	short		mrwvrstt;		/* 物理ﾎﾞﾘｭｰﾑ復旧情報			TD00 */
	short		mrwvpvtn;		/* ﾌｯｷｭｳ PVT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	char		mrwvyob2[4];	/* 予備２					    TD90 */
	char		mrwvyob3[8];	/* 予備３			  		    TD90 */
	short		mrwvvmno;		/* ﾛﾝﾘ ﾎﾞﾘｭｰﾑ ｽｳ					 */
	short		mrwvvmna;		/* ｾﾞﾝ ﾛﾝﾘ ﾎﾞﾘｭｰﾑ ｽｳ				 */
};
typedef	struct mrvebp MRVEBP;

/*********************************************************************/
/*	物理ボリューム復旧情報の値									TD00 */
/*********************************************************************/
#define	MRWVRFL		0x0001		/* 復旧失敗						TD90 */
#define	MRWVRFN		0x0002		/* 復旧完了						TD90 */

/*********************************************************************/
/*	MRVEB ｼｷﾍﾞﾂｼ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWVBID		"VEB "

/*********************************************************************/
/*	ﾌｯｷｭｳ ｽﾃｰﾀｽ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWWRNO		0x8000		/* 復旧不可能					TD90 */
#define	MRWWRED		0x4000		/* ＦＪ復旧終了					TD90 */
#define	MRWWRRS		0x2000		/* リラン時リストア対象			TD90 */
#define	MRWWRLS		0x1000		/* 最終復旧中					TD90 */
#define	MRWWRFJ		0x0800		/* ＦＪ復旧要					TD90 */
#define	MRWWRFN		0x0400		/* 復旧完了						TD90 */
#define	MRWWRST		0x0200		/* リストア対象					TD90 */
#define	MRWWMIR		0x0100		/* ミラーボリューム復旧要		TD90 */
#define	MRWWARS		0x0080		/* 処理済み						TD22 */
#define	MRWWVDI		0x0040		/* 初期化要						TD22 */ 
#define	MRWWKEO		0x0020		/* EOF仮同期済み				TD22 */
#define	MRWWZEO		0x0010		/* EOF実同期済み				TD22 */

/*********************************************************************/
/*	MRWCB (ｷｮｳﾂｳ ｼﾞｮｳﾎｳ ｾｯﾃｲ ﾘｮｳｲｷ)									 */
/*********************************************************************/
struct mrwcb {
	char		mrwcbid[4];		/* ﾌﾞﾛｯｸ ｼｷﾍﾞﾂｼ						 */
	TCOMPAT		*mrwcpvt;		/* PVT ｱﾄﾞﾚｽ						 */
	TCOMPAT		*mrwcpbt;		/* PBT ｱﾄﾞﾚｽ						 */
	TCOMPAT		*mrwcvbt;		/* VBT ｱﾄﾞﾚｽ						 */
	char		mrwcyb1[4];		/* ﾖﾋﾞ								 */
/* ﾎﾞﾘｭｰﾑ閉塞単位変更に伴う削除（１行）							TD90 */
	long		mrwcsrn;		/* SRT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ					 */
	long		mrwcvmn;		/* VMT ｼｹﾞﾝ ﾊﾞﾝｺﾞｳ				TD90 */
	char		mrwcyb2[4];		/* ﾖﾋﾞ								 */
	char		mrwcvmd;		/* VRCV ｼｮﾘ ﾓｰﾄﾞ					 */
	char		mrwcrmd;		/* VRCV ﾌｯｷｭｳ ﾓｰﾄﾞ					 */
	char		mrwcyb3[2];		/* ﾖﾋﾞ								 */
	char		mrwcdat[8];		/* バックアップＩＤ				TD46 */
	short		mrwcbtn;		/* ﾊﾞｯｸｱｯﾌﾟBKTｴﾝﾄﾘﾊﾞﾝｺﾞｳ			 */
	char		mrwcyb4[2];		/* ﾖﾋﾞ								 */
	long		mrwcagc;		/* ﾊﾟﾗﾒﾀ ｺｽｳ						 */
	char		**mrwagv;		/* ﾊﾟﾗﾒﾀﾘｽﾄ ｱﾄﾞﾚｽ					 */
	MRVEB		*mrwcveb;		/* MRVEB ｱﾄﾞﾚｽ						 */
	char		*mrwcjrd;		/* ｼﾞｬｰﾅﾙ ﾖﾐｺﾐ ﾘｮｳｲｷ ｾﾝﾄｳ ｱﾄﾞﾚｽ(L01) */
	char		mrwcyb5[8];		/* ﾖﾋﾞ						   (L01) */
/* ボリューム閉塞単位変更により削除（１行）						TD90 */
	short		mrwcevn;		/* ｼｮｳｶﾞｲ VMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	short		mrwcefn;		/* ｼｮｳｶﾞｲ FMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	long		mrwceif;		/* ｴﾗｰ ｼｮｳｻｲ ｼﾞｮｳﾎｳ					 */
	long		mrwctrd;		/* ﾀｲﾏ ﾖｳ ﾘｸｴｽﾄ ｼｷﾍﾞﾂｼ				 */
	long		mrwcmrd;		/* ｼﾞｭｼﾝ ﾃﾞﾝﾌﾞﾝ ﾖｳ ﾘｸｴｽﾄ ｼｷﾍﾞﾂｼ		 */
	long		mrwccmp;		/* ｷﾄﾞｳ ｺﾏﾝﾄﾞ ﾌﾟﾛｾｽ ｼｷﾍﾞﾂｼ			 */
	long		mrwctcd;		/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ ｺｰﾄﾞ				 */
	long		mrwctdt;		/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ ｼｮｳｻｲ ｼﾞｮｳﾎｳ		 */
	char		*mrwcmad;		/* ﾃﾞﾝﾌﾞﾝ ｼﾞｭｼﾝ ｲｷ ｱﾄﾞﾚｽ			 */
	char		mrwcyb6[2];		/* ﾖﾋﾞ								 */
	short		mrwcvme;		/* ﾍｲｿｸ VMT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ				 */
	char		mrwcyb7[4];		/* ﾖﾋﾞ								 */
	char		mrwcjnf;		/* ｼﾞｬｰﾅﾙ ﾌﾗｸﾞ						 */
	unsigned 	char	mrwcbjf;/* ﾊﾞｯｸｱｯﾌﾟｼﾞｬｰﾅﾙ ﾕｳｺｳ ﾌﾗｸﾞ		TD@1 */
	char		mrwcjus;		/* ｼﾞｬｰﾅﾙ ｼﾖｳ ｼﾞｼﾞｮｳﾎｳ				 */
	char		mrwcyb8;		/* ﾖﾋﾞ								 */
	short		mrwcsjm;		/* ﾊﾞｯｸｱｯﾌﾟｼﾞｬｰﾅﾙﾏｳﾝﾄ情報		TD27 */
/* 二重化ファイルの廃止により削除（３行）						TD27 */
	short		mrwcsjv;		/* ﾊﾞｯｸｱｯﾌﾟｼﾞｬｰﾅﾙ VBT			TD27 */
								/* ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ						 */
/* 二重化ファイルの廃止により削除（２行）						TD27 */
	short		mrwcjbk;		/* ｼﾞｬｰﾅﾙ ﾖｳ BKT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ		 */
	char		mrwcyb9[2];		/* ﾖﾋﾞ								 */
	short		mrwcrsn;		/* ﾌｯｷｭｳ ﾎﾞﾘｭｰﾑ ｽｳ					 */
	char		mrwcenf;		/* ｼｭｳﾘｮｳ ｼｮﾘ ﾌﾗｸﾞ					 */
/* バックアップ変更により削除（１行）							TD46 */
	char		mrwcvcp;		/* ﾎﾞﾘｭｰﾑ ｺﾋﾟｰ ｷﾄﾞｳﾁｭｳ ﾌﾗｸﾞ			 */
	char		mrwcyba[3];		/* ﾖﾋﾞ								 */
	short		mrwcemid;		/* ｴﾗｰ発生ﾓｼﾞｭｰﾙID				TD49 */
	char		mrwcyob4[2];	/* 予備４						TD@1 */
	long		mrwcedi1;		/* ｴﾗｰ詳細情報1					TD49 */
	long		mrwcedi2;		/* ｴﾗｰ詳細情報2					TD49 */
	long		mrwcedi3;		/* ｴﾗｰ詳細情報3					TD49 */
	char		mrwcmrcn[9];	/* ﾎﾞﾘｭｰﾑｺﾋﾟｰﾌﾟﾛｾｽ識別名		TD46 */
};
typedef struct mrwcb MRWCB;

/*********************************************************************/
/*	MRWCB ｼｷﾍﾞﾂｼ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWCBID		"WCB "

/*********************************************************************/
/*	VRCV ｼｮﾘ ﾓｰﾄﾞ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWOBSTA	0x01		/* ｼｮｳｶﾞｲ ﾎﾞﾘｭｰﾑ ﾌｯｷｭｳ				 */
#define	MRWRRUN		0x02		/* ﾘﾗﾝﾀｲｵｳ							 */

/*********************************************************************/
/*	VRCV ﾌｯｷｭｳ ﾓｰﾄﾞ ﾉ ｱﾀｲ											 */
/*********************************************************************/
#define	MRWRSFJCN	'0'			/* ﾘｽﾄｱ 'FJ'ﾌｯｷｭｳ					 */
#define	MRWRSONLY	'1'			/* ﾘｽﾄｱ ﾉﾐ							 */
#define	MRWFJONLY	'2'			/* 'FJ'ﾌｯｷｭｳ ﾉﾐ						 */

/*********************************************************************/
/*	ﾏｳﾝﾄ ｼｭﾍﾞﾂ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWBUMT		1L			/* ｱﾝﾏｳﾝﾄ ｼｮﾘ ﾀﾞｹ					 */
#define	MRWBNOUMT	2L			/* ｱﾝﾏｳﾝﾄ ｼｮﾘｲｶﾞｲﾓ ｵｺﾅｳ 			 */

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ｼｭﾍﾞﾂ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWJNLOP	1L			/* ﾄｳｼﾞﾂ ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ				 */
#define	MRWBJNLOP	2L			/* ﾊﾞｯｸ ｱｯﾌﾟ ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ			 */

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ﾌﾗｸﾞ ﾉ ｱﾀｲ											 */
/*********************************************************************/
#define MRWJOPON	0x80		/* ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ﾌﾗｸﾞ ｵﾝ				 */

/*********************************************************************/
/*	ﾊﾞｯｸｱｯﾌﾟ ｼﾞｬｰﾅﾙ ﾕｳｺｳ ﾌﾗｸﾞ ﾉ ｱﾀｲ									 */
/*********************************************************************/
#define	MRWBJNLS	0x80		/* ﾊﾞｯｸｱｯﾌﾟｼﾞｬｰﾅﾙﾕｳｺｳ			TD00 */
/* 二重化ファイルの廃止により削除（１行）						TD27 */

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ｼﾖｳ ｼﾞｮｳﾎｳ ﾉ ｱﾀｲ											 */
/*********************************************************************/
#define	MRWJNLUS	0x00		/* ﾄｳｼﾞﾂ ｼﾞｬｰﾅﾙ ｼﾖｳ ﾁｭｳ				 */
#define MRWBJNLSU	0x01		/* ﾊﾞｯｸ ｱｯﾌﾟ ｼﾞｬｰﾅﾙ ｼﾖｳ ﾁｭｳ	    TD27 */
/* 二重化ファイルの廃止により削除（１行）						TD27 */
#define	MRWNOJNLUS	0xFF		/* ｼﾞｬｰﾅﾙ ﾐ ｼﾖｳ						 */

/*********************************************************************/
/*	ﾊﾞｯｸ ｱｯﾌﾟ ｼﾞｬｰﾅﾙ ﾏｳﾝﾄ ｼﾞｮｳﾎｳ ﾉ ｱﾀｲ								 */
/*********************************************************************/
#define	MRWJNLMN	1			/* ﾏｳﾝﾄ ｼﾀ							 */
#define	MRWJNLMX	2			/* ｽﾃﾞﾆ ﾏｳﾝﾄ ｻﾚﾃｲﾀ					 */

/*********************************************************************/
/*	ｼｭｳﾘｮｳ ﾄﾞｳｷ ｼｮﾘ ﾖｳ ﾌﾗｸﾞ ﾉ ｱﾀｲ									 */
/*********************************************************************/
#define MRWESPON	0x01		/* ｼｭｳﾘｮｳ ﾄﾞｳｷ ｼｮﾘ ﾖｳ ﾌﾗｸﾞ ｵﾝ		 */

/* バックアップ変更に伴い削除（４行）							TD46 */

/*********************************************************************/
/*	ﾎﾞﾘｭｰﾑ ｺﾋﾟｰ ｷﾄﾞｳﾁｭｳ ﾌﾗｸﾞ ﾉ ｱﾀｲ									 */
/*********************************************************************/
#define MRWVCPON	0x01		/*	ﾎﾞﾘｭｰﾑ ｺﾋﾟｰ ｷﾄﾞｳﾁｭｳ ﾌﾗｸﾞ ｵﾝ		 */


/*********************************************************************/
/*	ｺｳｼﾝ ｼｭﾍﾞﾂ ﾉ ｱﾀｲ												 */
/*********************************************************************/
#define	MRWJNLJ		1L			/* ｶﾘ ｺｳｼﾝ							 */
#define	MRWJNLR		2L			/* ｼﾞﾂ ｺｳｼﾝ							 */

/*********************************************************************/
/*	ﾋﾞｯﾄ ｿｳｻ ｼｭﾍﾞﾂ ﾉ ｱﾀｲ											 */
/*********************************************************************/
#define	MRWBITON	1L			/* ﾋﾞｯﾄ ｦ ｵﾝ						 */
#define	MRWBITOFF	2L			/* ﾋﾞｯﾄ ｦ ｵﾌ						 */

/*********************************************************************/
/*	ｼｮｳｶﾞｲ ｼﾞｮｳﾎｳ ｸﾘｱ ﾀｲｼｮｳ ｼｭﾍﾞﾂ ﾉ ｱﾀｲ								 */
/*********************************************************************/
#define	MRWCALL		1L			/* ｽﾍﾞﾃ ﾉ ｼｮｳｶﾞｲ ｼﾞｮｳﾎｳ ｦ ｸﾘｱ		 */
#define	MRWCNALL	2L			/* ﾍｲｿｸ ｽﾃｰﾀｽ ﾉﾐ ｦ ｸﾘｱ				 */


/*********************************************************************/
/*	故障ﾎﾞﾘｭｰﾑ回復通知電文(論理ﾎﾞﾘｭｰﾑ情報有)ﾃﾞｰﾀ域(ﾍｯﾀﾞｰ部)	   TD-00 */
/*********************************************************************/
struct mrwmrdl {				/*							   TD90  */
	short		mrwmrpvn;		/* 回復物理ボリューム数        TD90	 */
	short		mrwmrvmn;		/* 回復論理ボリューム数		   TD90  */
};								/*							   TD90  */
typedef	struct mrwmrdl MRWMRDL; /*							   TD90  */

/*********************************************************************/
/*	故障ﾎﾞﾘｭｰﾑ回復通知電文(論理ﾎﾞﾘｭｰﾑ情報有)ﾃﾞｰﾀ域(個別部) 	   TD-00 */
/*********************************************************************/
struct mrwmrpl {				/*							   TD90  */
	short		mrwmrpve;		/* 回復PVTｴﾝﾄﾘ番号			   TD90	 */
	short		mrwmrvme;		/* 回復VMTｴﾝﾄﾘ番号			   TD90	 */
	char		mrwmrpnm[8];	/* 回復物理ﾎﾞﾘｭｰﾑ識別名		   TD90	 */
	char		mrwmrvld[8];	/* 回復論理ﾎﾞﾘｭｰﾑ識別名		   TD90	 */
};								/*							   TD90  */
typedef	struct mrwmrpl MRWMRPL;

/*********************************************************************/
/*	ﾎﾞﾘｭｰﾑ復旧情報電文(論理ﾎﾞﾘｭｰﾑ情報有)ﾃﾞｰﾀ域(ﾍｯﾀﾞｰ部)		   TD-00 */
/*********************************************************************/
struct mrwmidl {				/*							   TD90  */
	short		mrwmipvn;		/* 復旧物理ﾎﾞﾘｭｰﾑ数			   TD90  */
	short		mrwmivmn;		/* 復旧論理ﾎﾞﾘｭｰﾑ数			   TD90  */
	char		mrwmidat[8];	/* ﾊﾞｯｸｱｯﾌﾟID				   TD90	 */
	char		mrwmirmd;		/* 復旧ﾓｰﾄﾞ					   TD90	 */
	char		mrwmiyb1[3];	/* 予備１					   TD90	 */
};								/*							   TD90  */
typedef	struct mrwmidl MRWMIDL;	/*							   TD90  */

/*********************************************************************/
/*	ﾎﾞﾘｭｰﾑ復旧情報電文(論理ﾎﾞﾘｭｰﾑ情報有)ﾃﾞｰﾀ域(個別部)		   TD-00 */
/*********************************************************************/
struct mrwmipl {				/*							   TD90  */
	short		mrwmipve;		/* 復旧PVTｴﾝﾄﾘ番号			   TD90	 */
	short		mrwmivme;		/* 復旧VMTｴﾝﾄﾘ番号			   TD90	 */
	long		mrwmipif;		/* 復旧情報					   TD90	 */
	char		mrwmipnm[8];	/* 復旧物理ﾎﾞﾘｭｰﾑ識別名		   TD90	 */
	char		mrwmivld[8];	/* 復旧論理ﾎﾞﾘｭｰﾑ識別名		   TD90	 */
};								/*							   TD90  */
typedef	struct mrwmipl MRWMIPL;	/*							   TD90  */

/*********************************************************************/
/*	故障ﾎﾞﾘｭｰﾑ回復通知電文(論理ﾎﾞﾘｭｰﾑ情報なし)ﾃﾞｰﾀ域(ﾍｯﾀﾞｰ部)	TD00 */
/*********************************************************************/
struct mrwmrd {
	short		mrwmrpvn;		/* ｶｲﾌｸ ﾎﾞﾘｭｰﾑ ｽｳ					 */
	char		mrwmryb1[2];	/* ﾖﾋﾞ 1							 */
};
typedef	struct mrwmrd MRWMRD;

/*********************************************************************/
/*	故障ﾎﾞﾘｭｰﾑ回復通知電文(論理ﾎﾞﾘｭｰﾑ情報なし)ﾃﾞｰﾀ域(個別部)	TD00 */
/*********************************************************************/
struct mrwmrp {
	short		mrwmrpve;		/* ｶｲﾌｸ PVT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ				 */
	char		mrwmryb2[2];	/* ﾖﾋﾞ 2							 */
	char		mrwmrpnm[6];	/* ﾌﾞﾂﾘ ﾎﾞﾘｭｰﾑ ｼｷﾍﾞﾂﾒｲ				 */
	char		mrwmryb3[2];	/* ﾖﾋﾞ 3							 */
};
typedef	struct mrwmrp MRWMRP;

/*********************************************************************/
/*	ﾎﾞﾘｭｰﾑ復旧情報電文(論理ﾎﾞﾘｭｰﾑ情報なし)ﾃﾞｰﾀ域(ﾍｯﾀﾞｰ部)		TD00 */
/*********************************************************************/
struct mrwmid {
	short		mrwmipvn;		/* ﾌｯｷｭｳ ﾎﾞﾘｭｰﾑ ｽｳ					 */
	char		mrwmiyb1[2];	/* ﾖﾋﾞ 1							 */
	char		mrwmidat[8];	/* ﾊﾞｯｸｱｯﾌﾟID					TD46 */
	char		mrwmirmd;		/* ﾌｯｷｭｳ ﾓｰﾄﾞ						 */
	char		mrwmiyb2[3];	/* ﾖﾋﾞ 2							 */
};
typedef	struct mrwmid MRWMID;

/*********************************************************************/
/*	ﾎﾞﾘｭｰﾑ復旧情報電文(論理ﾎﾞﾘｭｰﾑ情報なし)ﾃﾞｰﾀ域(個別部)		TD00 */
/*********************************************************************/
struct mrwmip {
	short		mrwmipve;		/* ﾌｯｷｭｳ PVT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ			 */
	char		mrwmiyb3[2];	/* ﾖﾋﾞ 3							 */
	long		mrwmipif;		/* ﾌｯｷｭｳ ｼﾞｮｳﾎｳ						 */
	char		mrwmipnm[6];	/* ﾌﾞﾂﾘ ﾎﾞﾘｭｰﾑ ｼｷﾍﾞﾂﾒｲ				 */
	char		mrwmiyb4[2];	/* ﾖﾋﾞ 4							 */
};
typedef	struct mrwmip MRWMIP;

/*********************************************************************/
/*	復旧情報の値											TD-00	 */
/*********************************************************************/
#define	MRWMRNRM	0L			/* 復旧正常					   TD00  */
#define	MRWMRSVR	-1L			/* 復旧先ﾎﾞﾘｭｰﾑ故障   		   TD90  */
#define	MRWMRMVR	-2L			/* 復旧元ﾎﾞﾘｭｰﾑ故障   		   TD90  */
#define	MRWMRMJR	-3L			/* 復旧元ｼﾞｬｰﾅﾙ故障   		   TD90  */
#define	MRWMRNDT	-4L			/* ﾘｽﾄｱする為のﾊﾞｯｸｱｯﾌﾟﾃﾞｰﾀが  TD90  */
								/* 存在しない				   TD00	 */
#define	MRWMRCED	-5L			/* 子ﾌﾟﾛｾｽの強制終了により 	   TD90  */
								/* ﾘｽﾄｱ出来なかった			   TD00  */
#define	MRWMRSTP	-6L			/* ﾌﾟﾛｾｽ中断の為処理が 		   TD90  */
								/* 出来なかった				   TD00  */
#define	MRWMRVER	-7L			/* 復旧中に故障				   TD22  */
#define	MRWMRERR	-1L			/* 復旧失敗				 	   TD00  */

/* Ｐアボートの見直しによる削除（５行）							TD49 */

/*********************************************************************/
/*	ｱﾎﾞｰﾄ情報設定ﾏｸﾛ										 		 */
/*********************************************************************/
#define	MRWSABT( CODE, DTL1, DTL2, DTL3 )									\
{	wcbp->mrwcedi1 = ( (short)0 == wcbp->mrwcemid ? DTL1 : wcbp->mrwcedi1 );\
	wcbp->mrwcedi2 = ( (short)0 == wcbp->mrwcemid ? DTL2 : wcbp->mrwcedi2 );\
	wcbp->mrwcedi3 = ( (short)0 == wcbp->mrwcemid ? DTL3 : wcbp->mrwcedi3 );\
	wcbp->mrwcemid = ( (short)0 == wcbp->mrwcemid ? CODE : wcbp->mrwcemid );\
}

/*********************************************************************/
/*	TVMT論理ﾎﾞﾘｭｰﾑ属性										 		 */
/*********************************************************************/
#define	MRWJNL	0x02					/* JNL収容ﾎﾞﾘｭｰﾑ			 */
#define	MRWRBI	0x01					/* RBI収容ﾎﾞﾘｭｰﾑ			 */

/*********************************************************************/
/*	RCVﾎﾞﾘｭｰﾑ情報											 		 */
/**********************************************************************/
#define	MRWWCMRBI	0x80000000			/* CM用RBIを収容			 */
#define	MRWWL0RBI	0x40000000			/* LM0用RBIを収容			 */
#define	MRWWL1RBI	0x20000000			/* LM1用RBIを収容			 */
#define	MRWWJNL1	0x10000000			/* 1面JNLを収容				 */	
#define	MRWWKJ1		0x08000000			/* 1面KJを収容				 */	
#define	MRWWECMRBI	0x80000000			/* CM用RBI故障				 */
#define	MRWWEL0RBI	0x40000000			/* LM0用RBI故障				 */
#define	MRWWEL1RBI	0x20000000			/* LM1用RBI故障				 */
#define	MRWWEJNL1	0x10000000			/* 1面JNL故障				 */	
#define	MRWWEKJ1	0x08000000			/* 1面KJ故障				 */	

/*********************************************************************/
/*	その他のＤＥＦＩＮＥ定義								 		 */
/*********************************************************************/
#define	MRWUMTRUMT	1L					/* ｱﾝﾏｳﾝﾄ+ﾘﾓｰﾄｱﾝﾏｳﾝﾄ	TD02 */
#define	MRWUMTONLY	2L					/* ｱﾝﾏｳﾝﾄのみ			TD02 */
#define	MRWRUMTONLY	3L					/* ﾘﾓｰﾄｱﾝﾏｳﾝﾄ			TD02 */
#define	MRWMSPM		1L					/* SPM情報変更／登録依頼TD22 */
#define	MRWMTSR		2L					/* 復旧状態遷移要求		TD22 */
#define	MRWMTSO		3L					/* 状態遷移要求			TD22 */
										/* 正系片肺				TD22 */
#define	MRWMTSV		4L					/* 状態遷移要求			TD22 */
										/* 副系片肺				TD22 */
#define	MRWCBFL		4096L				/* ﾐﾗｰvol復旧時ｺﾋﾟｰ		TD22 */
										/*			ﾊﾞｯﾌｧ域ｻｲｽﾞ		 */

/****************************************/
/*	ﾐﾗｰﾎﾞﾘｭｰﾑ状態取得処理				*/
/*		*)osioctlにて取得した			*/
/*		  構造体osf_mvinfoのstateの値	*/
/****************************************/
#define	MRWMRSMSK	0xFFFF0000			/* マスク用				TD22 */
#define	MRWMRSNML	0x00000000			/* 両肺状態				TD22 */
#define	MRWMRSM		0x80000000			/* 正系片肺状態			TD22 */
#define	MRWMRSMR	0x20000000			/* 正系→副系復旧状態	TD22 */
#define	MRWMRSMC	0x10000000			/* 正系→副系コピー状態	TD22 */
#define	MRWMRSMHR	0x01000000			/* 正系→副系引継復旧状態	 */
										/*						TD22 */
#define	MRWMRSS		0x00800000			/* 副系片肺状態			TD22 */
#define	MRWMRSSR	0x00200000			/* 副系→正系復旧状態	TD22 */
#define	MRWMRSSC	0x00100000			/* 副系→正系コピー状態	TD22 */
#define	MRWMRSSHR	0x00010000			/* 副系→正系引継復旧状態    */
										/*						TD22 */
#define	MRWMRSVU	0x00008000			/* 使用中（ＯＰＥＮ中）	TD22 */

/****************************************/
/*	ファイルオープンモード				*/
/****************************************/
#define	MRWOMOD		OSFACEXT	|		/* 拡張権(その他)		TD22 */\
					OSFACWRT	|		/* 書き込み権(その他)	TD22 */\
					OSFACRED	|		/* 読み込み権(その他)	TD22 */\
					OSFACDEL			/* 削除権(その他)		TD22 */
/****************************************/
/*	占有テーブル種別					*/
/****************************************/
#define	MRWTSST		0x01				/* TSST,TSRTの占有		TD49 */
#define	MRWTVMT		0x02				/* TVMTの占有			TD49 */
#define	MRWTFMT		0x03				/* TFMTの占有			TD49 */
