/*****************************NTC-SMP-RCV*****************************/
/*																	 */
/*   1 ﾌｧｲﾙﾒｲ														 */
/*      ｼｽﾃﾑ ﾘｶﾊﾞﾘ ﾃｲｷﾞ ﾌｧｲﾙ (mry.h)								 */
/*																	 */
/*   2 ｸﾌﾞﾝ															 */
/*		ｼｽﾃﾑ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*   3 ﾘﾚｷ															 */
/*      ｾｯｹｲ ｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*      ｻｸｾｲ ｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ										 */
/*      ﾍﾝｺｳ ｼｬ : ﾉｸﾞﾁ ﾏｽｵ				 '87/10/01 (L01)			 */
/*				  (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) ---STC395			 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	 '88/10/08 (L02)			 */
/*				  (ｼﾞｬｰﾅﾙ ﾘｰﾄﾞ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC1230		 */
/*		変更者 : 三ツ倉　秀人		 	'94/01/21					 */
/*				 (内部事情による変更)						TD-@1	 */
/*				 (ﾎｯﾄｽﾀﾝﾊﾞｲ変更に伴う変更)					TD-02	 */
/*				 (2重化ﾌｧｲﾙの削除)							TD-27	 */
/*				 (LMﾃｰﾌﾞﾙﾘｶﾊﾞﾘに伴う変更)					TD-39	 */
/*				 (勘定ﾌｧｲﾙ操作に伴う変更)					TD-42	 */
/*				 (SCSIﾘｾｯﾄ機能に伴う変更)					TD-61	 */
/*				 (BACKUP中JNL取得に伴う変更)				TD-67	 */
/*				 (SMP日付の導入による変更)					TD-92	 */
/*		変更者 : 杉岡　克也				'95/03/07 --- CT0899(ST2491) */
/*               (ﾐﾗ-ﾘﾝｸﾞｻﾎﾟ-ﾄに伴う変更)					TD22     */
/*																	 */
/*********************************************************************/
#include	"mrs.h"					/*							TD02 */

/* 内部事情による削除(1)行										TD@1 */
/* 2重化ﾌｧｲﾙの変更の為削除(9行)									TD27 */
/* SMP日付の導入による削除(1行)									TD92 */

/*********************************************************************/
/*    MRFFP (ﾌｯｷｭｳ ﾌｧｲﾙ ｶﾝﾘ ﾃｰﾌﾞﾙ)									 */
/*********************************************************************/
struct	mrffp{
	long	mrffent;				/* ｴﾝﾄﾘ ｽｳ						 */
	long	mrfffil;				/* ﾌｧｲﾙ ｷｼﾞｭﾂｼ					 */
};
typedef	struct mrffp MRFFP;

/*********************************************************************/
/*    MRYCB (ｼｽﾃﾑﾘｶﾊﾞﾘ ｷｮｳﾂｳ ﾃｰﾌﾞﾙ)									 */
/*********************************************************************/
struct mrycb{
	TRBTPSZ	*mryrbtp;				/* TRBT個別部(CM用)ｱﾄﾞﾚｽ	TD39 */
	TTCTPSZ	*mrytctp;				/* TTCT個別部ｱﾄﾞﾚｽ			TD@1 */
	MRJRBF	*mryjrbf;				/* JNL読込み域先頭ｱﾄﾞﾚｽ(L02)TD00 */
	long	mryprsq;				/* ｾﾞﾝｶｲ ｼﾞｬｰﾅﾙﾚｺｰﾄﾞ ﾂｳﾊﾞﾝ		 */
	char	mrydate[8];				/* 前回JNLﾚｺｰﾄﾞ取得日付		TD92 */
	long	mryeofs;				/* 最後尾JNLｵﾌｾｯﾄ			TD00 */
	long	mrykjeofs;				/* KJの最後尾ｵﾌｾｯﾄ			TD42 */
	char	mryjnls[2];				/* JNLｽﾃｰﾀｽ					TD67 */
	char	mrykjst[2];				/* KJｽﾃｰﾀｽ					TD67 */
	long	mryrofs;				/* RBIｲﾝﾃﾞｯｸｽ内のJNLｵﾌｾｯﾄ	TD67 */
	long	mryrfls;				/* RBIﾌｧｲﾙ記述子			TD27 */
	long	mryridl;				/* RBIｲﾝﾃﾞｯｸｽ ﾁｮｳ				 */
	char	mryrdate[8];			/* RBI取得日時				TD67 */
	char	mryjmc;					/* JNL面切替中ｽﾃｰﾀｽ			TD67 */
	char	mrypu1;					/* PU1開始区分	0 : PU1無し	TD27 */
									/*				1 : PU1有り	TD00 */
	char	mryjum;					/* JNL使用面				TD67 */
	char	mryrgm;					/* RBI取得面				TD27 */
	char	mrytype;				/* RCVﾀｲﾌﾟ(RBI種別)			TD39 */
	char	mryjnlnxt;				/* JNL跨ぎ復旧有無ﾌﾗｸﾞ		TD67 */
	short	mryfent;				/* TFMTｴﾝﾄﾘ数(復旧要ﾌｧｲﾙ有りの時)*/
									/*	0:復旧要ﾌｧｲﾙ無し		TD39 */
	MRRBIDX	*mryridp;				/* RBIｲﾝﾃﾞｯｸｽ ｶｸﾉｳ ﾘｮｳｲｷ ｱﾄﾞﾚｽ	 */
	MRFFP	*mryffpp;				/* MRFFP ｱﾄﾞﾚｽ					 */
	char	mrydwnst;				/* ｼｽﾃﾑﾀﾞｳﾝｽﾃ-ﾀｽ 'S' : SMPﾀﾞｳﾝ   */
									/*               'O' : TRADEﾀﾞｳﾝ */
									/* CT0899					TD22 */
	char	mryyob1[3];				/* 予備					CT0899	 */
};
typedef struct mrycb MRYCB;

/*********************************************************************/
/*	ＭＲＹＡＣＢ（先行リカバリ制御ブロック）の定義				TD00 */
/*********************************************************************/
struct mryacb{						/*							TD02 */
	TPCTPSZ	*mryapctp;				/*	先行RCV用TPCTの個別部	TD02 */
	MRYCB	mryaycb;				/*	SRCV制御域				TD02 */
	MRSCB	mryascb;				/*	SINT制御域				TD02 */
};									/*							TD02 */
typedef struct mryacb MRYACB;		/*							TD02 */

/*********************************************************************/
/*	ｼﾞｬｰﾅﾙ ﾃﾞｰﾀ ｴﾗｰ ﾉ define ﾁ										 */
/*********************************************************************/
#define		MRYIDERR	-1L			/* ﾃﾞｰﾀID ｴﾗｰ					 */
#define		MRYFMTERR	-2L			/* FMT個別部番号ｴﾗｰ(ﾃﾞｰﾀｴﾗｰ)TD00 */
#define		MRYLENERR	-3L			/* ﾃﾞｰﾀ ﾁｮｳ ｴﾗｰ					 */
#define		MRYDATERR	-4L			/* ﾃﾞｰﾀ ｴﾗｰ						 */
#define		MRYRECERR	-5L			/* ﾚｺｰﾄﾞ ｴﾗｰ				TD00 */

/*********************************************************************/
/*	ｺｳｼﾝ ｼﾞ ｲﾗｲ ｼｭﾍﾞﾂ 												 */
/*********************************************************************/
#define		MRYTBLU		1L			/* ﾃｰﾌﾞﾙ ｺｳｼﾝ 				 	 */
#define		MRYFILEU	2L			/* ﾌｧｲﾙ ｺｳｼﾝ 					 */
#define		MRYTBL0U	3L			/* ﾃｰﾌﾞﾙ ｺｳｼﾝ(PU0 LM)		TD39 */
#define		MRYTBL1U	4L			/* ﾃｰﾌﾞﾙ ｺｳｼﾝ(PU1 LM)		TD39 */

/*********************************************************************/
/*	ｶｲｼ ｼｭｳﾘｮｳ ﾒｯｾｰｼﾞ ｼｭﾍﾞﾂ         			 					 */
/*********************************************************************/
#define		MRYMSGSTA	'0'   		/* ｶｲｼ ﾒｯｾｰｼﾞ      				 */
#define		MRYMSGEND	'1'   		/* ｼｭｳﾘｮｳ ﾒｯｾｰｼﾞ				 */
#define		MRYMSGSTAL0	'2'   		/* SSRCVｶｲｼ ﾒｯｾｰｼﾞ(PU0)    	TD39 */
#define		MRYMSGENDL0	'3'   		/* SSRCVｼｭｳﾘｮｳ ﾒｯｾｰｼﾞ(PU0)	TD39 */
#define		MRYMSGSTAL1	'4'   		/* SSRCVｶｲｼ ﾒｯｾｰｼﾞ(PU1)    	TD39 */
#define		MRYMSGENDL1	'5'   		/* SSRCVｼｭｳﾘｮｳ ﾒｯｾｰｼﾞ(PU1)	TD39 */
#define		MRYMSGSTAA0	'6'   		/* ARCVｶｲｼ ﾒｯｾｰｼﾞ(PU0)     	TD02 */
#define		MRYMSGENDA0	'7'   		/* ARCVｼｭｳﾘｮｳ ﾒｯｾｰｼﾞ(PU0)	TD02 */
#define		MRYMSGSTAA1	'8'   		/* ARCVｶｲｼ ﾒｯｾｰｼﾞ(PU1)     	TD02 */
#define		MRYMSGENDA1	'9'   		/* ARCVｼｭｳﾘｮｳ ﾒｯｾｰｼﾞ(PU1)	TD02 */

/*********************************************************************/
/*	RBI取得面						 			 				TD00 */
/*********************************************************************/
#define		MRYRAM		0x00		/* A面		 				TD27 */
#define		MRYRBM		0x01		/* B面		 				TD27 */

/*********************************************************************/
/*	イベント番号				      			 				TD00 */
/*********************************************************************/
#define		MRYEVNO		3   		/* SSRCV/ARCVのイベント番号	TD39 */

/*********************************************************************/
/*	JNL/KJﾌｧｲﾙ名				      			 				TD00 */
/*********************************************************************/
#define		MRYJ1FILE	"mrjnlfj1"	/* 1面JNLﾌｧｲﾙ名    			TD67 */
#define		MRYJ2FILE	"mrjnlfj2"	/* 2面JNLﾌｧｲﾙ名    			TD67 */
#define		MRYK1FILE	"mrjnlfk1"	/* 1面KJﾌｧｲﾙ名    			TD42 */
#define		MRYK2FILE	"mrjnlfk2"	/* 2面KJﾌｧｲﾙ名    			TD42 */

/*********************************************************************/
/*	SCSIﾘｾｯﾄ処理用ｼｽﾃﾑｺｰﾙ定義		 			 				TD00 */
/*********************************************************************/
#define		MRYOSCONN	0L			/* osconn	    			TD61 */
#define		MRYOSREADD	1L			/* osreadd	    			TD61 */
#define		MRYOSWRITD	2L			/* oswritd	    			TD61 */
#define		MRYOSFLUSH	3L			/* osflush	    			TD61 */
