/****************************************************************************/
/* ¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä					±¿Å¾´ÉÍý¶ÈÌ³							*/
/* ¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä					£Ï£Ã£Ð¡Ê£Ó£Ã£Ð¡Ë						*/
/* ¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä														*/
/* ¡ã¥µ¡¼¥Ó¥¹¹àÌÜ£É£Ä¡ä														*/
/* ¡ã¥â¥¸¥å¡¼¥ëÌ¾¡ä															*/
/* ¡ã¥â¥¸¥å¡¼¥ë£É£Ä¡ä				£í£ó£á£â£ï£ò£ô¡¥£è						*/
/* ¡ã¥â¥¸¥å¡¼¥ëÄÌÈÖ¡ä														*/
/*--------------------------------------------------------------------------*/
/* ¡ãÅ¬ÍÑµ¡¼ï¡ä						£Á£Ã£Å									*/
/* ¡ãÅ¬ÍÑ£Ï£Ó¡ä						£Ô£Ò£Á£Ä£Å								*/
/* ¡ã³«È¯´Ä¶­¡ä						£Ó£Õ£Î¡¡£Ó£Ð£Á£Ò£Ã¡Ý£É£Ð£Ø				*/
/* ¡ãµ­½Ò¸À¸ì¡ä						£Ã¸À¸ì									*/
/* ¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä				¥Ø¥Ã¥À¥Õ¥¡¥¤¥ë							*/
/* ¡ãµ¡Ç½¶èÊ¬¡ä																*/
/* ¡ãÂÐ¾Ý¥Ç¡¼¥¿¡ä															*/
/* ¡ã¹©Äø¡¦³¬ÁØ¶èÊ¬¡ä														*/
/*--------------------------------------------------------------------------*/
/* ¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä				£Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à					*/
/* ¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä				£µ£·£²£¶£°£±£´£°£²£±£°£°				*/
/*--------------------------------------------------------------------------*/
/* ¡ã³«È¯Ã´Åö¼ÔÌ¾¡ä					±Ä¶ÈÅÀ¥·¥¹¥Æ¥àÃ´Åö						*/
/* ¡ãÅÅÏÃÈÖ¹æ¡ä						169-3573(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/* ¡ãÀß·×¼ÔÌ¾¡ä						¹â¶¶¡¡ÃÒÉ§								*/
/* ¡ãÀß·×Ç¯·îÆü¡ä					£±£¹£¹£´Ç¯¡¡£±·î£±£°Æü					*/
/* ¡ãÀß·×½¤Àµ¼ÔÌ¾¡ä															*/
/* ¡ãÀß·×½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*--------------------------------------------------------------------------*/
/* ¡ã¥½¡¼¥¹ºîÀ®¼ÔÌ¾¡ä				¹â¶¶¡¡ÃÒÉ§								*/
/* ¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				£±£¹£¹£´Ç¯¡¡£±·î£²£±Æü					*/
/* ¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				Com'App »³¸ý							*/
/* ¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä	£±£¹£¹£¶Ç¯£°£··î£°£´Æü		ST4453		*/
/*--------------------------------------------------------------------------*/
/* ¡ã¸«ÀÑ¥¹¥Æ¥Ã¥×¿ô¡ä						¥¹¥Æ¥Ã¥×						*/
/*--------------------------------------------------------------------------*/
/* ¡ãµ¡Ç½³µÍ×¡ä																*/
/*--------------------------------------------------------------------------*/
/* ¡ã¸Æ½Ð·Á¼°¡ä																*/
/* ¡ã°ú¿ô¡ä																	*/
/* ¡ãÊÖµÑÃÍ¡ä																*/
/*--------------------------------------------------------------------------*/
/* ¡ãÆþ½ÐÎÏ¥Ç¡¼¥¿¹½À®¡ä														*/
/* ¡ãÀ©¸Â»ö¹à¡ä																*/
/* ¡ã»ÈÍÑ³°Éô¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/* ¡ã¸Æ½Ð¸µ¥â¥¸¥å¡¼¥ë£É£Ä¡ä													*/
/****************************************************************************/
/*3456789*123456789*123456789*123456789*/

/****************************************************************************/
/*	¥¢¥Ü¡¼¥È¾ðÊó¡¡¡Ý¡¡¥â¥¸¥å¡¼¥ë£É£Ä										*/
/****************************************************************************/
#define	MSMCNTL		0x1102					/* ms_mcntl(apmain)				*/
#define	MSMCTCK		0x1103					/* ms_mctck						*/
#define	MSMCTET		0x1104					/* ms_mctet						*/
#define	MSMCTMK		0x1105					/* ms_mctmk						*/
#define	MSMCTES		0x1106					/* ms_mctes						*/
#define	MSMCTCV		0x1107					/* ms_mctcv						*/

#define	MSCMSND		0x1108					/* msc_msnd						*/
#define	MSCCLGA		0x1109					/* msc_clga						*/

#define	MSMRLAY		0x1110					/* ms_mrlay(apmain)				*/
#define	MSMRYCK		0x1111					/* ms_mryck						*/
#define	MSMRYCW		0x1112					/* ms_mrycw						*/
#define	MSMRYTC		0x1113					/* ms_mrytc						*/
#define	MSMRYSN		0x1114					/* ms_mrysn						*/
#define	MSMRYSW		0x1115					/* ms_mrysw						*/
#define	MSMSND2		0x1116					/* ms_msnd2						*/


/****************************************************************************/
/*	¥¢¥Ü¡¼¥È¾ðÊó¡¡¡Ý¡¡¾ÜºÙ¾ðÊó												*/
/****************************************************************************/
#define	LDCONN		0x10000000				/* osconn		NG				*/
#define	LDOPEN		0x11000000				/* osopen		NG				*/
#define	LDIOCTL		0x12000000				/* osioctl		NG				*/
#define	LDWRITE		0x13000000				/* oswrite		NG				*/
#define	LDCLOSE		0x14000000				/* osclose		NG				*/
#define	LDDCONN		0x15000000				/* osdconn		NG				*/
#define	LDSENMSP	0x16000000				/* ossenmsp		NG				*/
#define	LDRCVMSPR	0x17000000				/* osrcvmspr	NG				*/
#define	LDRCVMSR	0x18000000				/* osrcvmsr		NG				*/
#define	LDANYRL		0x19000000				/* osanyrl		NG				*/
#define	LDGTNRL		0x1A000000				/* osgtnrl		NG				*/
#define	LDMCCLOG	0x20000000				/* mc_clog  	NG				*/
#define	LDCEDTNG	0x21000000				/* md_cedt  	NG				*/
#define	LDCPUTNG	0x22000000				/* md_cput  	NG				*/
#define	LDCGETNG	0x23000000				/* md_cget  	NG				*/
#define	LDCCNVNG	0x24000000				/* md_ccnv  	NG				*/
#define	LDSTMS  	0x25000000				/* osstms   	NG		ST4453	*/
#define	LDMIKFNG	0x30000000				/* Ž¹Ž²Ž¶ŽÝ ŽÌŽØŽÜŽ¹ Ž²Ž¼ŽÞŽ®Ž³				*/
#define	LDNTCDNG	0x31000000				/* NTC ŽÀŽÞŽ²ŽËŽ®Ž³ ŽÅŽ¼				*/
#define	LDSNTDNG	0x32000000				/* Ž»ŽÌŽÞŽÈŽ¯ŽÄŽÜŽ°Ž¸ ŽÀŽÞŽ²ŽËŽ®Ž³ ŽÅŽ¼			*/
#define	LDTLNMNG	0x33000000				/* ŽÃŽ°ŽÌŽÞŽÙ ŽÒŽ²	NG					*/
#define	LDMRMBNG	0x34000000				/* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞÃæ·ÑŽÒŽ²ŽÙŽÎŽÞŽ¯Ž¸Ž½¼±ÊÌ»Ò	NG	*/
#define	LDSDMBNG	0x35000000				/* Á÷¿®ÀèŽÒŽ²ŽÙŽÎŽÞŽ¯Ž¸Ž½¼±ÊÌ»Ò	NG		*/
#define	LDIOKDNG	0x36000000				/* TPCT or TMKS IO¼ïÊÌ	NG		*/
#define	LDITADNG	0x37000000				/* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞÃæ·Ñ¾ðÊóŽÃŽ°ŽÌŽÞŽÙÄÉ²Ã	NG	*/
#define	PAMKCD1		0x40000000				/* MK1ŽºŽ°ŽÄŽÞ	NG					*/
#define	PAMKCD2		0x41000000				/* MK2ŽºŽ°ŽÄŽÞ	NG					*/
#define	PAIFCD		0x42000000				/* INTER-FACEŽºŽ°ŽÄŽÞ	NG			*/
#define	SCGETBF		0xD0000000				/* mo_gtbf	NG					*/
