/****************************************************************************/
/* ＜対象業務名＞					運転管理業務							*/
/* ＜対象業務ＩＤ＞					ＯＣＰ（ＳＣＰ）						*/
/* ＜サービス項目名＞														*/
/* ＜サービス項目ＩＤ＞														*/
/* ＜モジュール名＞															*/
/* ＜モジュールＩＤ＞				ｍｓｃｐ．ｈ							*/
/* ＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/* ＜適用機種＞						ＡＣＥ									*/
/* ＜適用ＯＳ＞						ＴＲＡＤＥ								*/
/* ＜開発環境＞						ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ				*/
/* ＜記述言語＞						Ｃ言語									*/
/* ＜モジュール形態＞				ヘッダファイル							*/
/* ＜機能区分＞																*/
/* ＜対象データ＞															*/
/* ＜工程・階層区分＞														*/
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞				ＡＣＥ−ＳＭＰシステム					*/
/* ＜開発システム番号＞				５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/* ＜開発担当者名＞					営業点システム担当						*/
/* ＜電話番号＞						169-3573(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞						高橋　智彦								*/
/* ＜設計年月日＞					１９９４年　１月１０日					*/
/* ＜設計修正者名＞															*/
/* ＜設計修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者名＞				高橋　智彦								*/
/* ＜ソース作成年月日＞				１９９４年　１月２１日					*/
/* ＜ソース修正者名＞				杉岡  克也								*/
/* ＜ソース修正年月日及び修正ＩＤ＞	１９９６年０４月１８日	ST4293			*/
/* ＜ソース修正者名＞				山本　有司								*/
/* ＜ソース修正年月日及び修正ＩＤ＞	１９９６年０６月１１日	ST4418			*/
/*									(インターフェースコード２の属性改善)	*/
/* ＜ソース修正者名＞				山本　智也								*/
/* ＜ソース修正年月日及び修正ＩＤ＞	１９９６年０８月２８日	ST4527			*/
/*									(ﾒｯｾｰｼﾞﾊﾞｯﾌｧをunsignedで扱う	)		*/
/* ＜ソース修正者名＞                サプライ　         					*/
/* ＜ソース修正年月日及び修正ＩＤ＞  2002.10.30  XXXXXXX	    			*/
/*   ( ｲﾝﾀﾌｪｽｰｽｺｰﾄﾞをshortからlong型の変更)		  							*/
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ数＞						ステップ						*/
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞																*/
/* ＜引数＞																	*/
/* ＜返却値＞																*/
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構成＞														*/
/* ＜制限事項＞																*/
/*		　当ヘッダの定義より先に"mcmia.h"の定義を行って下さい。				*/
/* ＜使用外部モジュールＩＤ＞												*/
/* ＜呼出モジュールＩＤ＞													*/
/****************************************************************************/
/*3456789*123456789*123456789*123456789*/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-005-10										 */
/*改造内容			:バイト反転対応									 */
/*改造日			:2002.11.08										 */
/*改造者			:supply taguchi									 */
/*********************************************************************/


/****************************************************************************/
/*	ＳＣＰ電文個別部フォーマット（自ノード内通信用）						*/
/****************************************************************************/
struct	msusrmia
{
	unsigned long	msmiifcd;			/* インタフェースコード	  PRC-005-10*/
	long	msmiuno1;					/* ｳｹﾂｹ ﾊﾞﾝｺﾞｳ 1               		*/
	long	msmiuno2;					/* ｳｹﾂｹ ﾊﾞﾝｺﾞｳ 2               		*/
	union								/* ＯＣＰ−ＳＣＰインタフェース		*/
	{
		long	msmimlid;				/* メイルボックスＩＤ(ＯＣＰ)		*/
		long	msmitcod;				/* 通知コード(ＳＣＰ)				*/
	}msif;
	short	msmimnno;					/* ﾊｯｺｳﾓﾄ ﾉｰﾄﾞ ﾊﾞﾝｺﾞｳ          */
	short	msmisnno;					/* ｿｳｼﾝｻｷ ﾉｰﾄﾞ ﾊﾞﾝｺﾞｳ          */
	char	msmimkei;					/* ﾊｯｺｳﾓﾄ ｹｲｸﾌﾞﾝ               */
	char	msmiskei;					/* ｿｳｼﾝｻｷ ｹｲｸﾌﾞﾝ               */
	short	msmismsg;					/* ﾖﾋﾞｴﾘｱ                      */
	char	msmimpcs[8];				/* ﾊｯｺｳﾓﾄ ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ        */
	char	msmispcs[8];				/* ｿｳｼﾝｻｷ ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ        */
	char	msmiurun;					/* urun ｷﾄﾞｳｼｭﾍﾞﾂ              */
	char	msmioptn;					/* ｼｭﾂﾘｮｸ ﾊﾟﾀｰﾝ                */
	char	msmimgot;					/* ﾒｯｾｰｼﾞ ｼｭﾂﾘｮｸ ｸﾌﾞﾝ          */
	char	msmiscod;					/* ｼｮﾘ ｼｭﾍﾞﾂ                   */
	long	msmiatgp;					/* ｿｳｼﾝｻｷ ｸﾞﾙｰﾌﾟ ﾊﾞﾝｺﾞｳ        */
	long	msmiatsg;					/* ｿｳｼﾝｻｷ ｻﾌﾞ ｸﾞﾙｰﾌﾟ ﾊﾞﾝｺﾞｳ    */
};
typedef	struct msusrmia	MSUSRMIA;

/*********************************************************************/
/*	PRC-005-10  修正 START 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
union msifcd12{
        long  msifcd_l;					/* ﾊﾝﾃﾝｺﾞｲﾝﾀﾌｪｰｽｺｰﾄﾞｦｶｸﾉｳ    */
        struct{
            short  msifcd1;
            short  msifcd2;
        }msifcd_s;
    };
typedef union msifcd12 MSIFCD12;
/*********************************************************************/
/*	PRC-005-10  修正 END 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
/****************************************************************************/
/*	ＳＣＰ電文個別部フォーマット（他ノード間通信用）						*/
/****************************************************************************/
struct	msusrmia2
{
	unsigned long	msmiifcd;			/* インタフェースコード				*/
	/*unsigned	short	msmiifcd1;*/	/* インタフェースコード１	ST4418	*/
	/*unsigned	short	msmiifcd2;*/	/* インタフェースコード２	ST4418	*/
	char	msmintc[12];				/* ﾖﾋﾞ                         */
	long	msmiuno1;					/* ｳｹﾂｹ ﾊﾞﾝｺﾞｳ 1               */
	long	msmiuno2;					/* ｳｹﾂｹ ﾊﾞﾝｺﾞｳ 2               */
	long	msmitcod;					/* ﾂｳﾁ ｺｰﾄﾞ                    */
	short	msmimnno;					/* ﾊｯｺｳﾓﾄ ﾉｰﾄﾞ ﾊﾞﾝｺﾞｳ          */
	short	msmisnno;					/* ｿｳｼﾝｻｷ ﾉｰﾄﾞ ﾊﾞﾝｺﾞｳ          */
	char	msmimkei;					/* ﾊｯｺｳﾓﾄ ｹｲｸﾌﾞﾝ               */
	char	msmiskei;					/* ｿｳｼﾝｻｷ ｹｲｸﾌﾞﾝ               */
	short	msmismsg;					/* ﾖﾋﾞｴﾘｱ                      */
	char	msmimpcs[8];				/* ﾊｯｺｳﾓﾄ ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ        */
	char	msmispcs[8];				/* ｿｳｼﾝｻｷ ﾌﾟﾛｾｽ ｼｷﾍﾞﾂﾒｲ        */
	char	msmiurun;					/* urun ｷﾄﾞｳｼｭﾍﾞﾂ              */
	char	msmioptn;					/* ｼｭﾂﾘｮｸ ﾊﾟﾀｰﾝ                */
	char	msmimgot;					/* ﾒｯｾｰｼﾞ ｼｭﾂﾘｮｸ ｸﾌﾞﾝ          */
	char	msmiscod;					/* ｼｮﾘ ｼｭﾍﾞﾂ                   */
	long	msmiatgp;					/* ｿｳｼﾝｻｷ ｸﾞﾙｰﾌﾟ ﾊﾞﾝｺﾞｳ        */
	long	msmiatsg;					/* ｿｳｼﾝｻｷ ｻﾌﾞ ｸﾞﾙｰﾌﾟ ﾊﾞﾝｺﾞｳ    */
};
typedef	struct msusrmia2	MSUSRMIA2;


/****************************************************************************/
/*	電文エリア長定義														*/
/****************************************************************************/
#define	MSCOMMSZ	sizeof(MCMIKYO)		/* ＭＩＡ共有域サイズ				*/
#define	MSUSRMSZ	sizeof(MSUSRMIA)	/* mia ﾘﾖｳｼｬ ｲｷ ｻｲｽﾞ          */
#define	MSUSRMSZ2	sizeof(MSUSRMIA2)	/* mia ﾘﾖｳｼｬ ｲｷ ｻｲｽﾞ          */
#define	MSMGBFSZ	1024				/* ﾒｯｾｰｼﾞ ｼﾞｭｼﾝ ﾊﾞｯﾌｧ ｻｲｽﾞ    */


/****************************************************************************/
/*	ＳＣＰ電文フォーマット（自ノード内通信用）								*/
/****************************************************************************/
struct	msmsgmia
{
	MCMIKYO		msmiakyo;				/* ｷｮｳﾖｳ ｲｷ                   */
	MSUSRMIA	msmiakob;				/* ﾘﾖｳｼｬ ｲｷ                   */
	unsigned char	msmsgbuf[MSMGBFSZ];	/* ﾒｯｾｰｼﾞ ｼﾞｭｼﾝ ﾊﾞｯﾌｧ         */
										/* unsignedでキャスト  ST4527 */
};
typedef	struct msmsgmia	MSMSGMIA;


/****************************************************************************/
/*	ＳＣＰ電文フォーマット（他ノード間通信用）								*/
/****************************************************************************/
struct	msmsgmia2
{
	MCMIKYO		msmiakyo;				/* ｷｮｳﾖｳ ｲｷ                   */
	MSUSRMIA2	msmiakob;				/* ﾘﾖｳｼｬ ｲｷ                   */
	unsigned char	msmsgbuf[MSMGBFSZ];	/* ﾒｯｾｰｼﾞ ｼﾞｭｼﾝ ﾊﾞｯﾌｧ         */
										/* unsignedでキャスト  ST4527 */
};
typedef	struct msmsgmia2	MSMSGMIA2;


/****************************************************************************/
/*	送信電文情報エリア														*/
/****************************************************************************/
struct	sendinfo
{
	long	mailid;
	long	dtsize;
	long	*dtadr;
};
typedef	struct sendinfo	SENDINFO;


/****************************************************************************/
/*	受付番号フォーマット													*/
/****************************************************************************/
union	ubform
{
	long	unumber;					/* 受付番号							*/
	struct
	{
		short	nodeno;					/* ノード番号						*/
		unsigned short	tsuban;			/* 通番								*/
	}uke;
};
typedef	union	ubform	UBFORM;


/****************************************************************************/
/*	ＩＣＰ受信電文情報退避エリア											*/
/****************************************************************************/
struct	msicpinf
{
	long	msipuno1;					/* ICP受付番号(旧仕様ｲﾝﾀﾌｪｰｽ -不要?)*/
	long	msipuno2;					/* ｕｒｕｎ受付番号					*/
	short	msipmnno;					/* 送信元ノード番号 (個別部)		*/
	char	msipmkei;					/* 送信元系区分 (個別部)			*/
	char	msipmpcs[8];				/* 送信元プロセス識別名 (個別部)	*/
	char	*msipnrp;					/* 次レコード先頭ポインタ			*/
};
typedef	struct msicpinf	MSICPINF;


/****************************************************************************/
/*	メッセージ中継受信電文情報退避エリア									*/
/****************************************************************************/
struct	msmrinf
{
	long	msmruno;					/* ｕｒｕｎ受付番号					*/
	short	msmrsnno;					/* ｕｒｕｎ送信先ノード番号			*/
	char	msmrskei;					/* ｕｒｕｎ送信先系区分				*/
	char	msmrspcs[8];				/* ｕｒｕｎ送信先プロセス識別名		*/
	char	msmrmpcs[8];				/* ｕｒｕｎ送信元プロセス識別名		*/
	char	*msmrnrp;					/* 次レコード先頭ポインタ			*/
};
typedef	struct msmrinf	MSMRINF;


/****************************************************************************/
/*	コード変換情報返却エリア												*/
/****************************************************************************/
struct	msccnvif
{
	short	edcrlen;					/* 変換後有効長 (文字長?)			*/
	short	edbtlen;					/* 変換後バイト長					*/
};
typedef	struct msccnvif	MSCCNVIF;


/****************************************************************************/
/*	ｃｌｏｇ送受信電文退避エリア											*/
/****************************************************************************/
struct	msclginf
{
	char	mscgmkcd[4];				/* ＭＫコード						*/
	char	*mscgdtad;					/* データ格納アドレス				*/
	short	mscgdtsz;					/* データ格納サイズ					*/
	char	mscgkfty;					/* 系間振り分けタイプ				*/
	char	mscgkfng;					/* 系間振り分け異常					*/
	char	mscgsnpn[8];				/* 発信元プロセス識別名(ＭＩＡ共通)	*/
	char	mscgrvpn[8];				/* 送信先プロセス識別名(ＭＩＡ共通)	*/
/****************************************************************************/
/*	PRC-005-10  修正 START 													*/
/*  エンディアン問題対応  バイト反転										*/
/****************************************************************************/
	unsigned	long	mscgifcd;		/* インタフェースコード				*/	/* PRC-005-10 */
/*	unsigned	short	mscgifcd1;	*/	/* インタフェースコード１	ST4418	*/	/* PRC-005-10 */
/*	unsigned	short	mscgifcd2;	*/	/* インタフェースコード２	ST4418	*/	/* PRC-005-10 */
/****************************************************************************/
/*	PRC-005-10  修正 END 													*/
/*  エンディアン問題対応  バイト反転										*/
/****************************************************************************/
	long	mscguno1;					/* 受付番号１						*/
	long	mscguno2;					/* 受付番号２						*/
	long	mscgtcod;					/* 通知コード						*/
	short	mscgmnno;					/* 発行元ノード番号					*/
	short	mscgsnno;					/* 送信先ノード番号					*/
	char	mscgmkei;					/* 送信元系区分						*/
	char	mscgskei;					/* 送信先系区分						*/
	short	mscgsmsg;					/* メッセージ種別					*/
	char	mscgmpcs[8];				/* 送信元プロセス識別名(ＭＩＡ固有)	*/
	char	mscgspcs[8];				/* 送信先プロセス識別名(ＭＩＡ固有)	*/
	char	mscgurun;					/* ｕｒｕｎ起動種別					*/
	char	mscgoptn;					/* メッセージ送信パターン			*/
	char	mscgmgot;					/* メッセージ編集区分				*/
	char	mscgscod;					/* 処理種別							*/
	long	mscgatgp;					/* 送信先グループ番号				*/
	long	mscgatsg;					/* 送信先サブグループ番号			*/
	char	mscgmsg[20];				/* メッセージ						*/
};
typedef	struct msclginf MSCLGINF;

struct	msclginf2
{
	char	mscgmkcd[4];				/* ＭＫコード						*/
	char	mscgsnpn[8];				/* 発信元プロセス識別名(ＭＩＡ共通)	*/
};
typedef	struct msclginf2 MSCLGINF2;
