/**********************************************************************/
/*                                                                    */
/*                 mscpsect.h                                         */
/*                                                                    */
/*             ŽºŽÍŽÞŽÂ  PSECT  ŽÌŽµŽ°ŽÏŽ¯ŽÄ                                    */
/*                                                                    */
/**********************************************************************/
#include <msrdno.h>                    /* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ Ž¶ŽÝŽØŽ´ŽØŽ± ŽÌŽ«Ž°ŽÏŽ¯ŽÄ  */

struct  mscpsect {
    MSRCVMIA    *rvmiaptr ;            /* Ž¼ŽÞŽ­Ž¼ŽÝ mia Ž±ŽÄŽÞŽÚŽ½             */
    MSSDMIA1    *snmiaptr ;            /* Ž¿Ž³Ž¼ŽÝ  mia Ž±ŽÄŽÞŽÚŽ½             */
    MSSDMIA2    *snmiapt2 ;            /* Ž¿Ž³Ž¼ŽÝ  mia Ž±ŽÄŽÞŽÚŽ½             */
    MSMIAUIP    *rusrptr  ;            /* Ž¼ŽÞŽ­Ž¼ŽÝ mia ŽØŽÖŽ³Ž¼Ž¬Ž²Ž· Ž±ŽÄŽÞŽÚŽ½     */
    MSTBLADD    tbad      ;            /* ŽÃŽ°ŽÌŽÞŽÙ  Ž±ŽÄŽÞŽÚŽ½ Ž¶Ž¸ŽÉŽ³  Ž´ŽØŽ±      */
    long        ret1100   ;            /* msfm1100 ŽÉ ŽÍŽÝŽ·Ž¬Ž¸ŽÁ           */
    long        msfd      ;            /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÌŽ§Ž²ŽÙ Ž¼Ž·ŽÍŽÞŽÂŽ¼          */
    long        rmiasz    ;            /* Ž¼ŽÞŽ­Ž¼ŽÝ mia Ž»Ž²Ž½ŽÞ              */
    long        msrqid    ;            /* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼                */
    MSRDNO      *rdnptr   ;            /* ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ Ž¶ŽÝŽØŽ´ŽØŽ± Ž±ŽÄŽÞŽÚŽ½   */
    char        msscpp[8] ;            /* scp ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ²           */
} ;
typedef struct mscpsect  MSCPSECT ;
/**********************************************************************/
