/****************************************************************************/
/* 著作権  ２００２															*/
/* 			株式会社ＮＴＴデータ											*/
/* 				金融ビジネス事業本部										*/
/*																			*/
/*																			*/
/* 収容物  ＬＡｌａ−ＳＭＰシステム  メッセージ制御(mof)マクロ				*/
/****************************************************************************/
/****************************************************************************/
/* メッセージ制御(mof)マクロ												*/
/* 																			*/
/* 作成者：supply Watanabe													*/
/* 作成日：2002/12/18														*/
/*																			*/
/* 新規内容	：次期では、以下のＴＲＡＤＥ関数を置き換える(PRC-027-01)		*/
/*																	 		*/
/*          ：　(1)	osioctl	→	osioctl1							 		*/
/*          ：　(2)	oswrite	→	oswrite1							 		*/
/* 																	 		*/
/****************************************************************************/
/****************************************************************************/
/*	System-Call Macro when compiled without "DLOFF"							*/
/****************************************************************************/
#ifndef	LOFF

#define	C_WRITE1(p1,p2,p3)			mc_lcif(oswrite1,CL_BSYS,CL_ASYS,3,MCEOSWRITE,p1,p2,p3)
#define	C_IOCTL1(p1,p2,p3,p4)		mc_lcif(osioctl1,CL_BSYS,CL_ASYS,4,MCEOSIOCTL,p1,p2,p3,p4)

#endif

/****************************************************************************/
/*	System-Call Macro when compiled with "DLOFF"							*/
/****************************************************************************/
#ifdef	LOFF

#define	C_WRITE1(p1,p2,p3)				oswrite1(p1,p2,p3)
#define	C_IOCTL1(p1,p2,p3,p4)			osioctl1(p1,p2,p3,p4)

#endif
