/**********************************************************************/
/*                                                                    */
/*                 msivent.h                                          */
/*                                                                    */
/*             Ž²ŽÍŽÞŽÝŽÄ Ž¶ŽÝŽØ Ž´ŽØŽ± ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                   */
/*                                                                    */
/**********************************************************************/

/**********************************************************************/
/*        Ž·Ž®Ž³ŽÂŽ³ŽÌŽÞ  ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                             */
/**********************************************************************/
struct  msivkyo {
    long        nextptr ;
    long        fromptr ;
} ;
typedef struct msivkyo MSIVKYO ;

/**********************************************************************/
/*        RM ŽºŽÍŽÞŽÂ  ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                             */
/**********************************************************************/
struct  msrosmg {
    MSIVKYO     msivy ;
    long        ivrqid ;
    char        rmivk[sizeof(MCMIKYO) + sizeof(MSMIAUIP)] ;
} ;
typedef struct msrosmg MSROSMG ;

/**********************************************************************/
/*        EM ŽºŽÍŽÞŽÂ  ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                             */
/**********************************************************************/
struct  msprend {
    MSIVKYO     msivy ;
    long        ivrqid ;
    char        emivk[sizeof(MSMIAUIP)] ;
} ;
typedef struct msprend MSPREND ;

/**********************************************************************/
/*        PE ŽºŽÍŽÞŽÂ  ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                             */
/**********************************************************************/
struct  mstimov {
    MSIVKYO     msivy ;
    long        ivrqid ;
    char        peivk[sizeof(MCMIKYO) + sizeof(MSMIAUIP)] ;
} ;
typedef struct mstimov MSTIMOV ;

/**********************************************************************/
/*        TC ŽºŽÍŽÞŽÂ  ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                                             */
/**********************************************************************/
struct  msrosiv {
    MSIVKYO     msivy ;
    long        ivrqid ;
    long        tckbfad;
} ;
typedef struct msrosiv MSROSIV ;


/**********************************************************************/
