/****************************************************************************/
/* ＜対象業務名＞					運転管理業務							*/
/* ＜対象業務ＩＤ＞					ＯＣＰ（ＳＣＰ）						*/
/* ＜サービス項目名＞				システムメッセージ中継					*/
/* ＜サービス項目ＩＤ＞														*/
/* ＜モジュール名＞															*/
/* ＜モジュールＩＤ＞				ｍｓｍｒｌａｙ．ｈ						*/
/* ＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/* ＜適用機種＞						ＡＣＥ									*/
/* ＜適用ＯＳ＞						ＴＲＡＤＥ								*/
/* ＜開発環境＞						ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ				*/
/* ＜記述言語＞						Ｃ言語									*/
/* ＜モジュール形態＞				ヘッダファイル							*/
/* ＜機能区分＞																*/
/* ＜対象データ＞															*/
/* ＜工程・階層区分＞														*/
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞				ＡＣＥ−ＳＭＰシステム					*/
/* ＜開発システム番号＞				５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/* ＜開発担当者名＞					営業点システム担当						*/
/* ＜電話番号＞						169-3573(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞						高橋　智彦								*/
/* ＜設計年月日＞					１９９４年　２月１７日					*/
/* ＜設計修正者名＞															*/
/* ＜設計修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者名＞				高橋　智彦								*/
/* ＜ソース作成年月日＞				１９９４年　４月２５日					*/
/* ＜ソース修正者名＞														*/
/* ＜ソース修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ数＞						ステップ						*/
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞																*/
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞																*/
/* ＜引数＞																	*/
/* ＜返却値＞																*/
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構成＞														*/
/* ＜制限事項＞																*/
/* ＜使用外部モジュールＩＤ＞												*/
/* ＜呼出モジュールＩＤ＞													*/
/****************************************************************************/
/*3456789*123456789*123456789*123456789*/


/****************************************************************************/
/*	受信電文種別															*/
/****************************************************************************/
#define	MSMDURUN	1L					/* ユーティリティ実行				*/
#define	MSMDUMRN	2L					/* 応答メッセージ					*/
#define	MSMDUWTO	3L					/* オペレータメッセージ				*/
#define	MSMDUWTR	4L					/* オペレータメッセージ・応答要		*/
#define	MSMDWTOP	5L					/* 非同期（システム）メッセージ		*/
#define MSMDUTCH	6L					/* ユーティリティ受付結果通知		*/
#define	MSMDSTCH	7L					/* ユーティリティ終了通知			*/
#define	MSMDPEND	8L					/* プロセス終了要求通知				*/
#define	MSMDIFER	9L					/* 電文設定内容エラー				*/


/****************************************************************************/
/*	送信電文モード															*/
/****************************************************************************/
#define	MSSDJIKEI	1L					/* 自系内送信電文					*/
#define	MSSDTAKEI	2L					/* 他系宛送信電文					*/
#define	MSSDTANOD	3L					/* 他ノード宛送信電文				*/
#define	MSSDERRRN	4L					/* 送信エラー電文					*/
#define	MSSDRTN		5L					/* エラー返却電文					*/
#define	MSSDNOP		6L					/* 送信不要電文						*/


/****************************************************************************/
/*	電文送受信管理情報テーブル処理モード									*/
/****************************************************************************/
#define	MSTBLADD	1L					/* テーブル情報追加					*/
#define	MSTBLSRH	2L					/* テーブル情報検索（送信情報設定）	*/
#define	MSTBLDEL	3L					/* テーブル情報削除					*/


/****************************************************************************/
/*	電文送受信管理情報テーブル処理結果										*/
/****************************************************************************/
#define	MSTLDTOK	0L					/* 情報テーブル処理正常				*/
#define	MSTLNTFD	1L					/* 情報テーブルデータ無				*/
