/**************************************/
/*                                    */
/*          mspncpy.h                 */
/*                                    */
/*     ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂŽÒŽ² ŽºŽËŽßŽ°             */
/*                                    */
/*                                    */
/**************************************/   
#define PNSZ    8

#define MSPNCOPY(iptr, optr)\
                ichptr = (char *)iptr ;\
                ochptr = (char *)optr ;\
                for (i=0; i<PNSZ; i++) {\
                   *ochptr++ = *ichptr++ ;\
                }

/***************************************/

