/**********************************************************************/
/*                                                                    */
/*                 mspsect.h                                          */
/*                                                                    */
/*             PSECT   ŽÃŽ²Ž·ŽÞ                                           */
/*                                                                    */
/**********************************************************************/
#include <psect.h>
#include <mscpsect.h>

extern  PSCPSECT  pscparea ;            /* Ž·Ž®Ž³ŽÂŽ³ PSECT Ž´ŽØŽ±            */
extern  MSCPSECT  mscpsect ;            /* ŽºŽÍŽÞŽÂ  PSECT Ž´ŽØŽ±            */
                                           
/**********************************************************************/
