/**********************************************************************/
/*                                                                    */
/*                 msrdno.h                                           */
/*                                                                    */
/*             ŽØŽ¸Ž´Ž½ŽÄ Ž¼Ž·ŽÍŽÞŽÂŽ¼ Ž¶ŽÝŽØŽ´ŽØŽ± ŽÌŽ«Ž°ŽÏŽ¯ŽÄ                             */
/*                                                                    */
/**********************************************************************/

struct  msrdno {
    short    mseds ;                   /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÍŽÝŽ¼Ž­Ž³ Ž¶Ž²Ž¼            */
    short    msede ;                   /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÍŽÝŽ¼Ž­Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³         */
    short    mspss ;                   /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¶Ž²Ž¼            */
    short    mspse ;                   /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž­Ž³ŽØŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³         */
    short    mstos ;                   /* ŽÀŽ²ŽÑ   ŽµŽ°ŽÊŽÞ   Ž¶Ž²Ž¼            */
    short    mstoe ;                   /* ŽÀŽ²ŽÑ   ŽµŽ°ŽÊŽÞ   Ž¼Ž­Ž³ŽØŽ®Ž³         */
    short    msmgs ;                   /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÂŽ³ŽÁ   Ž¶Ž²Ž¼            */
    short    msmge ;                   /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÂŽ³ŽÁ   Ž¼Ž­Ž³ŽØŽ®Ž³         */
} ;
typedef struct msrdno  MSRDNO ;
/**********************************************************************/
