/**********************************************************************/
/*                                                                    */
/*   MSUP.H                                                           */
/*                                                                    */
/**********************************************************************/
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ (ŽÍŽÝŽ·Ž¬Ž¸ ŽÁ)            */ 
/**************************************/
#define MSUPNORM 0L                     /* Ž¾Ž²Ž¼ŽÞŽ®Ž³ Ž¼Ž­Ž³ŽØŽ®Ž³              */
#define MSUPIVPM -1L                    /* ŽÊŽßŽ×ŽÒŽ°ŽÀ Ž´Ž×Ž°                 */
#define MSUPFAER -2L                    /* ŽÌŽ§Ž²ŽÙ Ž±Ž¸Ž¾Ž½ Ž´Ž×Ž°              */
#define MSUPCVER -3L                    /* ŽºŽ°ŽÄŽÞ ŽÍŽÝŽ¶ŽÝ Ž´Ž×Ž°              */ 
#define MSUPSDER -4L                    /* ŽÃŽÞŽ°ŽÀ Ž¿Ž³Ž¼ŽÝ Ž´Ž×Ž°              */
#define MSUPDTER -5L                    /* ŽÃŽÞŽ°ŽÀ Ž´Ž×Ž°                   */
#define MSUPFDER -6L                    /* ŽÌŽ§Ž²ŽÙ ŽÃŽÞŽØŽ°ŽÄ ŽÌŽÉŽ³             */
#define MSUPEOF  0L                     /* EOF Ž¹ŽÝŽ¼Ž­ŽÂ                  */
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ (osopen ŽÉ ŽÊŽßŽ×ŽÒŽ°ŽÀ)    */ 
/**************************************/
#define MSUPPOAC 0x0000007e             /* Ž±Ž¸Ž¾Ž½ ŽºŽ°ŽÄŽÞ                  */
#define MSUPPOAM 1L                     /* Ž±Ž¸Ž¾Ž½ ŽÎŽ³ (Ž½ŽÄŽØŽ°ŽÑ Ž±Ž¸Ž¾Ž½)       */
#define MSUPPORS -1L                    /* ŽÚŽºŽ°ŽÄŽÞ Ž»Ž²Ž½ŽÞ (1)             */
#define MSUPPOBS -1L                    /* ŽÌŽÞŽÛŽ¯Ž¸ Ž»Ž²Ž½ŽÞ (Ž¿Ž³Ž¾Ž² Ž¼ŽÞ ŽÆŽµŽÅŽ¼ŽÞ) */
#define MSUPPOLM 0L                     /* ŽÊŽ²ŽÀ ŽµŽ°ŽÌŽßŽÝ Ž¼Ž­Ž³ŽØŽ®Ž³ ŽÏŽÁ Ž¼ŽÞŽ¶ŽÝ   */
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ (md_ccnv ŽÉ ŽÊŽßŽ×ŽÒŽ°ŽÀ)   */ 
/**************************************/
#define MSUPPCSC 0x10                   /* Ž¼Ž®ŽØ ŽºŽ°ŽÄŽÞ (ŽºŽ°ŽÄŽÞ ŽÍŽÝŽ¶ŽÝ  Ž±ŽØ    */
                                        /*           ŽÃŽÞŽ°ŽÀ Ž¼ŽÝŽÁŽ®Ž³ ŽÅŽ¼    */
#define MSUPPCBC 0x40                   /* ŽÍŽÝŽ¶ŽÝ ŽÏŽ´ ŽºŽ°ŽÄŽÞid (uinix ŽºŽ°ŽÄŽÞ)*/
#define MSUPPCAC 0x20                   /* ŽÍŽÝŽ¶ŽÝ ŽºŽÞ ŽºŽ°ŽÄŽÞid (jis8 ŽºŽ°ŽÄŽÞ) */
#define MSUPPCPS 0x00                   /* ŽÊŽÞŽØŽÃŽ¨Ž° Ž¼ŽÃŽ² (ŽÆŽÝŽ²)           */
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ (ms_uwto ŽÉ ŽÊŽßŽ×ŽÒŽ°ŽÀ)   */ 
/**************************************/
#define MSUPPUMF 0x20                   /* ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ Ž¼Ž­ŽÂŽØŽ®Ž¸ Ž¸ŽÌŽÞŽÝ         */
                                        /* (ŽÒŽ¯Ž¾Ž°Ž¼ŽÞ ŽÍŽÝŽ¼Ž­Ž³ Ž½ŽÞŽÐ)         */
#define MSUPPUUN 0                      /* Ž³Ž¹ŽÂŽ¹ ŽÊŽÞŽÝŽºŽÞŽ³ (0)            */
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ ( ŽÚŽºŽ°ŽÄŽÞ Ž¾ŽÊŽßŽÚŽ°ŽÀ )     */ 
/**************************************/
#define MSUPRSNL '\n'                   /* NL(LF) 0x0a                */
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ ( ŽÊŽÞŽ¯ŽÌŽ§ Ž»Ž²Ž½ŽÞ )       */ 
/**************************************/
#define BFSZ     256                    /* ŽÊŽÞŽ¯ŽÌŽ§ Ž»Ž²Ž½ŽÞ                 */
/**************************************/
/*   Ž¼ŽÞŽ®Ž³Ž½Ž³ ŽÃŽ²Ž·ŽÞ ( Ž¿ŽÉŽÀ )              */ 
/**************************************/
#define MSUPNULL '\0'                   /* NULL 0x00                  */
/**************************************/
/*   PSECT ŽÌŽßŽÛŽ¾Ž½ Ž²Ž· ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²         */ 
/**************************************/
struct  psctmsup{
    char  psupkind;                     /* ŽÕŽ°ŽÃŽ¨ŽØŽÃŽ¨Ž° Ž¼Ž­ŽÍŽÞŽÂ             */
    char  psnrdyoh;                     /* Ž¼ŽÞ ŽÃŽÞŽ°ŽÀ ŽÖŽÐŽºŽÐ ŽÖŽ³ŽË           */
    char  pstaiumu;                     /* ŽÀŽ²ŽË ŽÃŽÞŽ°ŽÀ Ž³ŽÑ ŽËŽ®Ž³Ž¼           */
    char  pseofhyo;                     /* EOF Ž¹ŽÝŽ¼Ž­ŽÂ ŽËŽ®Ž³Ž¼ŽÞ            */
    long  psfildes;                     /* ŽÌŽ§Ž²ŽÙ Ž·Ž¼ŽÞŽ­ŽÂŽ¼                */
    short psjitusz;                     /* Ž¼ŽÞŽÂ ŽÖŽÐŽºŽÐ ŽÃŽÞŽ°ŽÀ ŽÁŽ®Ž³          */
    short psnndtos;                     /* Ž¼ŽÞ Ž¼ŽÞ ŽÃŽÞŽ°ŽÀ Ž¾ŽÝŽÄŽ³ Ž²ŽÁ         */
    long  psndatad;                     /* Ž¼ŽÞ ŽÃŽÞŽ°ŽÀ Ž¾ŽÝŽÄŽ³ Ž±ŽÄŽÞŽÚŽ½         */
    short psndatsz;                     /* Ž¼ŽÞ ŽÃŽÞŽ°ŽÀ Ž»Ž²Ž½ŽÞ               */
    char  pspsyob1[2];                  /* ŽÖŽËŽÞ1                       */
    short pstaidsz;                     /* ŽÀŽ²ŽË ŽÃŽÞŽ°ŽÀ Ž»Ž²Ž½ŽÞ              */
    char  psrdumuh;                     /* ŽÖŽÐŽºŽÐ ŽÃŽÞŽ°ŽÀ Ž³ŽÑ ŽËŽ®Ž³Ž¼ŽÞ         */
    char  pspsyob2;                     /* ŽÖŽËŽÞ2                       */
    char  psredbuf[BFSZ];               /* ŽÃŽÞŽ°ŽÀ ŽÖŽÐŽºŽÐ ŽÊŽÞŽ¯ŽÌŽ§            */
    char  pstaibuf[BFSZ];               /* ŽÀŽ²ŽË Ž´ŽØŽ±                    */
    char  pskumbuf[BFSZ];               /* ŽÃŽÞŽ°ŽÀ Ž¸ŽÐŽÀŽÃ ŽÊŽÞŽ¯ŽÌŽ§            */
    char  psccvbuf[BFSZ];               /* ŽºŽ°ŽÄŽÞ ŽÍŽÝŽ¶ŽÝ ŽºŽÞ ŽÃŽÞŽ°ŽÀ Ž¶Ž¸ŽÉŽ³ Ž²Ž·  */
};
typedef  struct  psctmsup  PSCTMSUP;
