/*********************************************************************/
/*   T.LOAD T.SAVE ŽÖŽ³ define                                         */
/*********************************************************************/
#define	MTZNML	0                       /* Ž¾Ž²Ž¼ŽÞŽÖŽ³                   */
#define MTZWERR  -1                     /* ŽØŽ®Ž³ŽÎŽ³ Ž²Ž¼ŽÞŽ®Ž³              */
#define	MTZERR	-10                     /* ŽÊŽßŽ×ŽÒ-ŽÀ Ž´Ž×-               */
#define	MTZIOE	-11                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ I/OŽ´Ž×-         */
#define	MTZBFE	-12                     /* ŽÊŽÞŽ¯ŽÌŽ§ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-           */
#define	MTZTME	-13                     /* ŽËŽ½ŽÞŽ¹Ž¼ŽÞŽºŽ¸ Ž¶Ž¸ŽÄŽ¸ Ž´Ž×-        */
#define	MTZNDF	-14                     /* ŽÌŽ§Ž²ŽÙ ŽÅŽ²ŽÖŽ³ ŽÌŽ²Ž¯ŽÁ 		    */
#define	MTZNDTE	-15                     /* ŽËŽÂŽÞŽ¹ Ž¼ŽÞŽºŽ¸ ŽÌŽ²Ž¯ŽÁ 		    */
#define	MTZNDTB	-16                     /* VCTŽºŽÍŽÞŽÂŽÌŽÞ ŽÌŽ²Ž¯ŽÁ 		    */
#define	MTZMXOV	-30                     /* ŽÊŽÞŽ¯ŽÌŽ§ŽÁŽ®Ž³ MAX ŽµŽ°ŽÊŽÞŽ°   	*/
#define	MTZMAXBF  0x7FF8				/* ŽÊŽÞŽ¯ŽÌŽ§ MAX ŽÁŽ®Ž³			 */
#define	MTZSERT2  1
#define	MTZSERS2  2
#define	MTZSERT1  3
#define	MTZSERS1  4
#define MTZWERTT -1
#define MTZWERTS -2
#define MTZWERST -3
#define MTZWERSS -4
/*********************************************************************/
/*   ŽÊŽßŽ×ŽÒ-ŽÀŽØŽ½ŽÄŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                              */
/*********************************************************************/
typedef	unsigned char	UCHAR;
struct mtpst {
	char *mtpmtdr1;                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ1ŽÉ ŽÏŽ³ŽÝŽÄŽÃŽÞŽÚŽ¸ŽÄŽØŽÒŽ²  */
	char *mtpfvol1;                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ1ŽÉ ŽÛŽÝŽØVOL ŽÒŽ²     */
	char *mtpfpas1;                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ1ŽÉ ŽÊŽßŽ½ŽÒŽ²         */
	char *mtpmtdr2;                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ2ŽÉ ŽÏŽ³ŽÝŽÄŽÃŽÞŽÚŽ¸ŽÄŽØŽÒŽ²  */
	char *mtpfvol2;                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ2ŽÉ ŽÛŽÝŽØVOL ŽÒŽ²     */
	char *mtpfpas2;                     /* ŽÃ-ŽÌŽÞŽÙŽÌŽ§Ž²ŽÙ2ŽÉ ŽÊŽßŽ½ŽÒŽ²         */
};
typedef	struct mtpst	MTPLST;
/*********************************************************************/
/*   RBIŽ¼Ž®ŽÄŽ¸Ž¼ŽÞŽ®Ž³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ                                             */
/*********************************************************************/
struct mtrbitbl {
	long mtrptr;                        /* ADTŽ¶Ž×ŽÉ Ž¿Ž³ŽÀŽ²Ž±ŽÄŽÞŽÚŽ½          */
	long mtrlen;                        /* ŽÃ-ŽÌŽÞŽÙŽÉ Ž»Ž²Ž½ŽÞ               */
};
typedef	struct mtrbitbl	MTRBITBL;
/*********************************************************************/
/*   Ž´Ž×-Žº-ŽÄŽÞ Ž¾ŽÂŽÃŽ² ŽÃ-ŽÌŽÞŽÙ                                              */
/*********************************************************************/
struct mterr {
	long mtefd1;                        /* ŽÌŽ§Ž²ŽÙ1ŽÉ ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼          */
	long mtecrd1;                       /* ŽÌŽ§Ž²ŽÙ1ŽÉ Ž´Ž×-Žº-ŽÄŽÞ            */
	long mtefd2;                        /* ŽÌŽ§Ž²ŽÙ2ŽÉ ŽÌŽ§Ž²ŽÙŽ·Ž¼ŽÞŽÂŽ¼          */
	long mtecrd2;                       /* ŽÌŽ§Ž²ŽÙ2ŽÉ Ž´Ž×-Žº-ŽÄŽÞ            */
};
typedef	struct mterr	MTERRT;
