#define  UCHAR	unsigned char
/*********************************************************************/
/*	 Ž¶Ž¸ŽÉŽ³ ŽÊ Ž×ŽÒŽÀ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ										 */
/*********************************************************************/
struct	mtparat  {
	long  mtprcnt;						/*	ŽÊ Ž×ŽÒŽÀ ŽÉ ŽºŽ½Ž³ 			 */
	char  *mtpradr[MTPARA]; 			/*	ŽÊ Ž×ŽÒŽÀ ŽºŽ³ŽÓŽ¸ ŽÉ Ž±ŽÄŽÞŽÚŽ½		 */
};
typedef  struct  mtparat  MTPARAT;
/*********************************************************************/
/*	 ŽÌŽµ-ŽÏŽÂŽÄ Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct	mtitem{
	short mtitmsz;						/*	1ŽºŽ³ŽÓŽ¸ ŽÉ Ž»Ž²Ž½ŽÞ			 */
	UCHAR mtitmfm;						/*	1ŽºŽ³ŽÓŽ¸ ŽÉ Ž¹Ž²Ž¼Ž·			 */
	UCHAR mtitdmy;						/*	ŽÀŽÞŽÐ- ŽØŽÕŽ³Ž²Ž·				 */
};
struct	mtfmttl  {
	long  mtitemc;						/*	ŽÊ Ž×ŽÒŽÀ ŽºŽ³ŽÓŽ¸ ŽÉ ŽºŽ½Ž³		 */
	long  mtfckct;						/*	ŽÌŽµ-ŽÏŽÂŽÄ ŽÁŽ´ŽÂŽ¸ Ž¶Ž³ŽÝŽÄ		 */
	struct	mtitem	mtitmst[MTITEM];
};
typedef  struct  mtfmttl  MTFMTTL;
/*********************************************************************/
/*	 ŽÃ-ŽÌŽÞŽÙ Ž¾Ž²Ž¾Ž² Ž¼ŽÞŽÖŽ³ŽÎŽ³ ŽÃ-ŽÌŽÞŽÙ										 */
/*********************************************************************/
struct	mttable  {
	long  mtmsgid;						/*	ŽÒŽÂŽ¾-Ž¼ŽÞ Ž·Ž¼ŽÞŽÕŽÂŽ¼			 */
	UCHAR mttname[MTTBID];				/*	ŽÃ-ŽÌŽÞŽÙ Ž¼Ž·ŽÍŽÞŽÂŽ¼			 */
	UCHAR mtpraid;						/*	ŽÊ Ž×ŽÒŽÀ Ž¼ŽÕŽÍŽÞŽÂ 			 */
	UCHAR mtctflg;						/*	Ž¹Ž²Ž¿ŽÞŽ¸ ŽÌŽ×Ž¸ŽÞ				 */
	UCHAR mtminer;						/*	Ž´Ž×- ŽÌŽ×Ž¸ŽÞ(1) 			 */
	UCHAR mterflg;						/*	Ž´Ž×- ŽÌŽ×Ž¸ŽÞ(2) 			 */
	short mtalitm;						/*	ŽºŽ³ŽÓŽ¸ Ž½Ž³ 				 */
	short mtckcnt;						/*	ŽÁŽ´ŽÂŽ¸ Ž½ŽÞŽÐ ŽºŽ³ŽÓŽ¸ Ž½Ž³		 */
	short mtstcnt;						/*	Ž¾ŽÂŽÄ Ž½ŽÞŽÐ Ž¶Ž³ŽÝŽÄ			 */
	short mtckcra;						/*	ŽÁŽ´ŽÂŽ¸ Ž½ŽÞŽÐ ŽÓŽ¼ŽÞŽ½Ž³			 */
	char  *mtvctad; 					/*	vct ŽÉ Ž±ŽÄŽÞŽÚŽ½ 			 */
	UCHAR mtcctfg;						/*	ŽÓŽ¼ŽÞŽ¹Ž²Ž¿ŽÞŽ¸ ŽÌŽ×Ž¸ŽÞ			 */
	UCHAR mtbctflg; 					/*	ŽÏŽ´ ŽÉ ŽÓŽ¼ŽÞŽ¹Ž²Ž¿ŽÞŽ¸ ŽÌŽ×Ž¸ŽÞ		 */
	UCHAR mtfmtfg;						/*	ŽÌŽµ-ŽÏŽÂŽÄ ŽÌŽ×Ž¸ŽÞ 			 */
	UCHAR mthexfg;						/*	hex ŽÌŽ×Ž¸ŽÞ				 */
	long  mtline;						/*	Ž×Ž²ŽÝ ŽÅŽÝŽÊŽÞŽ°				 */
	short mtcmtfg ;						/*	ŽºŽÒŽÝŽÄ ŽÌŽ×Ž¸ŽÞ				 */
	short mtcmtcnt ;					/*	ŽºŽÒŽÝŽÄ Ž¶Ž³ŽÝŽÄ				 */
};
typedef  struct  mttable  MTTABLE;
/*********************************************************************/
/*	 ŽÊŽÞŽÂŽÌŽ± Ž»Ž¸Ž¾Ž² ŽÃ-ŽÌŽÞŽÙ												 */
/*********************************************************************/
struct	mtbftbl  {
	long  mtpolid;						/*	ŽÌ -ŽÙ Ž¼Ž·ŽÍŽÞŽÂŽ¼ 			 */
	long  mtbfcnt;						/*	ŽÊŽÞŽÂŽÌŽ± ŽÉ ŽºŽ½Ž³ 			 */
	long  mtbufid[MTITEM];				/*	ŽÌ -ŽÙ Ž¼Ž·ŽÍŽÞŽÂŽ¼ 			 */
	char  *mtbufad[MTITEM]; 			/*	ŽÊŽÞŽ¯ŽÌŽ§ Ž±ŽÄŽÞŽÚŽ½ 			 */
};
typedef  struct  mtbftbl  MTBFTBL;
/*********************************************************************/
/*	 Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞŽÊŽßŽ×ŽÒ-ŽÀ ŽÃ-ŽÌŽÞŽÙ											 */
/*********************************************************************/
struct mtempr {
	union	{							/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÎŽßŽ²ŽÝŽÀ			 */
		short	*cngpms;
		long	*cngpml;
		char	*cngpmc;
	} cngprm;
	long cnglen;						/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ ŽÅŽ¶ŽÞŽ»			 */
};
struct mtempt {
	long cngn;							/* ŽÊŽßŽ×ŽÒ-ŽÀ ŽÉ Ž¶Ž½ŽÞ 			 */
	struct mtempr parmdt[MTMSPT];
};
typedef	struct mtempt	MTEMPT;
/*********************************************************************/
/*	 Ž´Ž×-ŽÒŽÂŽ¾-Ž¼ŽÞ ŽÃ-ŽÌŽÞŽÙ												 */
/*********************************************************************/
struct mtermsg {
	long errno; 						/* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞNO 			 */
	UCHAR errmg[MTMSG]; 				/* Ž´Ž×- ŽÒŽÂŽ¾-Ž¼ŽÞ				 */
	long permn; 						/* ŽÊŽßŽ×ŽÒ-ŽÀ Ž½Ž³				 */
	struct mlcftbl pardat[MTMSPT];
};
typedef	struct mtermsg	MTERMSG;
