/****************************************************************************/
/*  著作権  １９９７                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/*  収容物  ＡＣＥ−ＳＭＰソースプログラム									*/
/****************************************************************************/
/* ＜対象業務名＞                   ＡＣＥ−ＳＭＰ                          */
/* ＜対象業務ＩＤ＞                 運転管理業務							*/
/* ＜サービス項目名＞               ＳＭＰテーブル生成						*/
/* ＜サービス項目ＩＤ＞             ＴＢＬ									*/
/* ＜モジュール名＞                 テーブルファイル収容情報				*/
/* ＜モジュールＩＤ＞				２ａ３ｅ								*/
/* ＜モジュール通番＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜適用機種名＞                   ＡＣＥ                                  */
/* ＜適用ＯＳ＞                     ＴＲＡＤＥ                              */
/* ＜開発環境＞                     ＳＵＮ　ＳＰＡＲＣ                      */
/* ＜記述言語＞                     Ｃ言語                                  */
/* ＜モジュール形態＞               ヘッダファイル							*/
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞               ＡＣＥ−ＳＭＰシステム                  */
/* ＜開発システム番号＞             ５７２６０１４２１００                  */
/*--------------------------------------------------------------------------*/
/* ＜開発担当名＞                   営業店システム担当                      */
/* ＜電話番号＞                     169-3573(03-5702-3573)                  */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞                     ＫＳＰ（株）　山口　幸次				*/
/* ＜設計年月日＞					１９９７年１１月０５日			ST4970	*/
/* ＜設計修正者＞															*/
/* ＜設計修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者＞　　             ＫＳＰ（株）　山口　幸次				*/
/* ＜ソース作成年月日＞				１９９７年１１月０６日			ST4970	*/
/* ＜ソース修正者＞															*/
/* ＜ソース修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞                                                             */
/*	　テーブルファイル収容情報関連											*/
/*--------------------------------------------------------------------------*/
/* ＜制限事項＞                                                             */
/*     特になし                                                             */
/****************************************************************************/
#if MTTINFINC
#else
#define MTTINFINC 1
/****************************************************************************/

#if MTINC
#else
#include "mt.h"
#endif

#ifndef MCNMAL
#include <mc.h>
#endif
/*----------------------------------*/
/* テーブルファイル収容情報			*/
/*----------------------------------*/
#define MTTBLNUM	6					/* テーブルファイル最大数			*/

#define MTPU0IDX	0					/* PU0側情報先頭格納位置			*/
#define MTPU1IDX	4					/* PU1側情報先頭格納位置			*/

#define MTSKTFD		0					/* 検索種別　ファイルディスクリプタ	*/
#define MTSKMDR		1					/* 検索種別　マウントディレクトリ	*/
#define MTSKTFP		2					/* 検索種別　テーブルファイル		*/

										/*----------------------------------*/
typedef struct {						/* テーブルファイル収容情報			*/
	char	*volpath;					/* 特殊ファイルパス名				*/
	char	*mntpath;					/* マウント先ディレクトリパス名		*/
	char	*tblpath;					/* テーブルファイルパス名			*/
	char	*filename;					/* テーブルファイル名				*/
	long	bsdevid;					/* SCSIバスmajor|minor				*/
	long	uidevid;					/* 装置ｲﾝｸﾜｲｱﾘmajor|minor			*/
	long	urdevid;					/* 装置ﾘｾｯﾄmajor|minor				*/
	char	etype;						/* 装置種別							*/
	char	rsv[3];						/* 未使用							*/
} MTTFINF;

										/*----------------------------------*/
typedef struct{							/* リセット用パス名セット			*/
	char	bspath[32];					/* SCSIバスINQUERY|RESET			*/
	char	uipath[32];					/* 装置INQUERY						*/
	char	urpath[32];					/* 装置RESET						*/
	char	etype;						/* 装置種別							*/
} MTSPLST;

/*------------------------------------------------------*/
/* バスリセット・インクワイアリ用特殊ファイル装置ＩＤ	*/
/* PU(PU番号) CN(コントローラ番号) SI(SCSI ID)			*/
/* ただし、majorは装置番号を含まない					*/
/*------------------------------------------------------*/
#define	MTBSDEVID(PU, CN, SI) \
	( 0x002C0000L | ((((long)(PU)) << 24) & 0x01000000L) \
				  | ((((long)(CN)) << 12) & 0x0000F000L) \
				  |	((((long)(SI)) <<  8) & 0x00000700L) )

/*------------------------------------------------------*/
/* 装置インクワイアリ用特殊ファイル装置ＩＤ				*/
/* PU(PU番号) CN(コントローラ番号) SI(SCSI ID) LN(LUN)	*/
/* ただし、majorは装置番号を含まない					*/
/*------------------------------------------------------*/
#define MTUIDEVID(PU, CN, SI, LN) \
	( 0x002C0000L | ((((long)(PU)) << 24) & 0x01000000L) \
				  | ((((long)(CN)) << 12) & 0x0000F000L) \
				  | ((((long)(SI)) <<  8) & 0x00000700L) \
				  | ((((long)(LN)) <<  4) & 0x00000030L) )

/*------------------------------------------------------*/
/* 装置リセット用特殊ファイル装置ＩＤ					*/
/* MJ(major#) MN(minor#)								*/
/* ただし、majorは装置番号を含まない					*/
/*------------------------------------------------------*/
#define MTURDEVID(MJ, MN) \
	( ((((long)(MJ)) << 16) & 0x01FF0000L) | (((long)(MN)) & 0x0000FFFFL) )


#define MTMRSOK		"ST00"				/* SCSIリセット成功ＭＳＧ			*/
#define MTMRSNG		"ST01"				/* SCSIリセット失敗ＭＳＧ			*/
/*------------------------------------------------------*/
/* SCSIリセット成功ＭＳＧ出力							*/
/* P1(リセット対象特殊ファイルパス名					*/
/*------------------------------------------------------*/
#define MTSOKMSG(P1) {\
extern long mt_cwtm();\
char	msg[128];\
char	*path = (char *)(P1);\
	strcpy(msg, MTMRSOK);\
	strcat(msg, "\t");\
	strcat(msg, ((0 == path) || (path[0] == '\0'))? \
				"Unknown............." : path);\
	(void)mt_cwtm(msg);\
}

/*------------------------------------------------------*/
/* SCSIリセット失敗ＭＳＧ出力							*/
/* P1(リセット対象特殊ファイルパス名					*/
/* P2(システムコール種別) P3(システムコール返却値)		*/
/*------------------------------------------------------*/
#define MTSNGMSG(P1,P2,P3) {\
extern long mt_cwtm();\
char	msg[128];\
char	func[sizeof(long)*2+1];\
char	result[sizeof(long)*2+1];\
char	*path = (char *)(P1);\
long	id = (long)(P2);\
long	ret = (long)(P3);\
	func[8] = '\0';\
	result[8] = '\0';\
	strcpy(msg, MTMRSNG);\
	strcat(msg, "\t");\
	if ((0 == path) || (path[0] == '\0')){ \
		strcat(msg, "Unknown.............");\
	}\
	else{\
		strcat(msg, path);\
		strcat(msg, "\t");\
		(void)mc_hccn(&id, func, sizeof(long)*2);\
		strcat(msg, (func[0])? func : "********");\
		strcat(msg, "\t");\
		(void)mc_hccn(&ret, result, sizeof(long)*2);\
		strcat(msg, (result[0])? result : "********");\
	}\
	(void)mt_cwtm(msg);\
}

/*------------------------------*/
/* mt_srtn関数返却値			*/
/*------------------------------*/
#define MTSRTNETC	0					/* リセット不要						*/
#define MTSRTNBR	1					/* バスリセット要					*/
#define MTSRTNUR	2					/* 装置リセット要					*/
#define MTSRTNRE	3					/* 遅延リトライ要					*/
/****************************************************************************/
#endif
