/****************************************************************************/
/*	操作マクロ 1															*/
/*	処理：メッセージをキューの最後尾にエンキューする						*/
/*	引数： p1=管理部ポインタ, p2=個別部ポインタ								*/
/****************************************************************************/
#define	NCP_TENQ(p1, p2)	{									\
	((TMSQPSZ *)p2)->tmsqnxtad = (TMSQPSZ *)p1;					\
	((TMSQPSZ *)p2)->tmsqbefad = ((TMSQMNG *)p1)->tmsqbefad;	\
	((TMSQPSZ *)p2)->tmsqbefad->tmsqnxtad = p2;					\
	((TMSQMNG *)p1)->tmsqbefad = p2;							\
}

/****************************************************************************/
/*	操作マクロ 2															*/
/*	処理：キュー先頭のメッセージをデキューし、個別部ポインタを				*/
/*			ポインタをｐ２に設定する										*/
/*	引数： p1=管理部ポインタ, p2=個別部ポインタ								*/
/****************************************************************************/
#define	NCP_HDEQ(p1, p2)	{									\
	p2 = (void *)(((TMSQMNG *)p1)->tmsqnxtad);					\
	NCP_ADEQ(p2)												\
}

/****************************************************************************/
/*	操作マクロ 3															*/
/*	処理：任意のメッセージをデキューする									*/
/*	引数： p1=個別部ポインタ												*/
/****************************************************************************/
#define	NCP_ADEQ(p1)	{												\
	((TMSQPSZ *)p1)->tmsqnxtad->tmsqbefad = ((TMSQPSZ *)p1)->tmsqbefad;	\
	((TMSQPSZ *)p1)->tmsqbefad->tmsqnxtad = ((TMSQPSZ *)p1)->tmsqnxtad;	\
	((TMSQPSZ *)p1)->tmsqnxtad = (void *)0;								\
	((TMSQPSZ *)p1)->tmsqbefad = (void *)0;								\
}

/****************************************************************************/
/*	操作マクロ 4															*/
/*	処理：管理部を初期化する												*/
/*	引数： p1 = 管理部ポインタ												*/
/****************************************************************************/
#define	NCP_QINIT(p1)	{										\
	((TMSQMNG *)p1)->tmsqbefad = (TMSQPSZ *)p1;					\
	((TMSQMNG *)p1)->tmsqnxtad = (TMSQPSZ *)p1;					\
}

