/************************************************************************/
/*																		*/
/*	ＳＭＰＭＳＧ電文ヘッダ情報											*/
/*																		*/
/************************************************************************/
/****************************************/
/*	ＴＲＡＤＥヘッダ					*/
/****************************************/
typedef	struct {
	long	lMsgType;					/*	メッセージタイプ			*/
	char	*pcPlBuf;					/*	プールバッファアドレス		*/
	long	lDataSize;					/*	データサイズ				*/
}SMP_TRADEHED;
/****************************************/
/*	電文送信ヘッダ						*/
/****************************************/
typedef	struct {
	char	msg_idData[4];				/*	電文種別					*/
	long	msg_type;					/*	応答送信時メッセージタイプ	*/
	long	msg_rslt;					/*	完了コード					*/
}SMPMSGHED;

#define		TRD_MSG_TYP_06	0x06		/*	プロセス宛電文				*/
