/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		TBKT ﾃｲｷﾞ ﾌｧｲﾙ (tbkt.h)										 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾊﾞｯｸｱｯﾟ ｶﾝﾘ ﾃ-ﾌﾞﾙ											 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ｻｸｾｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ			'87/10/01	(L01)				 */
/*			 	 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｺｳﾓｸ ﾉ ｻｸｼﾞｮ) --- STC395			 */
/*      変更者 : 渡邊　基樹          93/11/12    TD-00               */
/*                (JNL・RBIの初期化に伴う変更)   TD-79               */
/*                (ﾊﾞｯｸｱｯﾌﾟ変更に伴う変更)   	 TD-46 CT0914 ST1752 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TBKT ｻﾌﾞｷｮｳﾂｳﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ										 */
/*********************************************************************/
struct	tbktsub{
	char	tbktsyb1[4];	/* ﾖﾋﾞ							   (L01) */
	short	tbktjbke;		/* 最新ﾊﾞｯｸｱｯﾌﾟｴﾝﾄﾘ番号(JNL)		TD79 */
	short	tbktfbke;		/* 最新ﾊﾞｯｸｱｯﾌﾟｴﾝﾄﾘ番号(一般ﾌｧｲﾙ)	TD79 */
};
typedef struct	tbktsub TBKTSUB;

/*********************************************************************/
/*	TBKT ｺﾍﾞﾂﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct	tbktpsz{
	char	tbktjbid[8];	/* ﾊﾞｯｸｱｯﾌﾟID(JNL)					TD79 */
	char	tbktfbid[8];	/* ﾊﾞｯｸｱｯﾌﾟID(一般ﾌｧｲﾙ)				TD79 */
	unsigned char tbktjbst; /* JNLﾊﾞｯｸｱｯﾌﾟｽﾃｰﾀｽ					TD79 */
							/*	0x00 -- ﾊﾞｯｸｱｯﾌﾟ ｼﾃｲﾅｲ (TBKTNOBKUP)  */
							/*  0x40 -- I/Oｴﾗｰ発生	   (TBKTIOERR)   */
							/*	0x80 -- ﾊﾞｯｸｱｯﾌﾟ ｽﾞﾐ	(TBKTBKUP)	 */
	unsigned char tbktkbst;	/* KJﾊﾞｯｸｱｯﾌﾟｽﾃ-ﾀｽ					TD79 */
							/*	0x00 -- ﾊﾞｯｸｱｯﾌﾟ ｼﾃｲﾅｲ (TBKTNOBKUP)  */
							/*  0x40 -- I/Oｴﾗｰ発生     (TBKTIOERR)   */
							/*	0x80 -- ﾊﾞｯｸｱｯﾌﾟ ｽﾞﾐ	(TBKTBKUP)	 */
	short	tbktyob1;		/* 予備1							TD79 */
	char	tbktjnam[12];	/* JNL ﾊﾞｯｸｱｯﾌﾟ ﾌｧｲﾙ名				TD79 */
	char	tbktknam[12];	/* KJ ﾊﾞｯｸｱｯﾌﾟ ﾌｧｲﾙ名				TD79 */
	short	tbktjvbe;		/* ﾊﾞｯｸｱｯﾌﾟVBTｴﾝﾄﾘ番号(JNL)			TD79 */
	short	tbktkvbe;		/* ﾊﾞｯｸｱｯﾌﾟVBTｴﾝﾄﾘ番号(KJ)			TD79 */	
	long	tbktjeof;		/* EOF ﾉ ﾎﾟｼﾞｼｮﾝ						 */
	long	tbktkeof;		/* ﾊﾞｯｸｱｯﾌﾟKJ EOF位置				TD79 */
	char	tbktters[8];	/* ﾊﾞｯｸｱｯﾌﾟ対象期間・自		TD46  CT0915 */
	char	tbkttere[8];	/* ﾊﾞｯｸｱｯﾌﾟ対象期間・至		TD46  CT0915 */
							/* 予備2,3,4 削除					TD79 */
};
typedef struct	tbktpsz TBKTPSZ;

/*********************************************************************/
/*	JNL&KJﾊﾞｯｸｱｯﾌﾟ ｽﾃ-ﾀｽ ( tbktjbst , tbktkbst ) ﾉ ﾃｲｷﾞ			     */
/*********************************************************************/
#define		TBKTNOBKUP		0x00
#define		TBKTIOERR		0x40
							/* I/Oｴﾗｰ発生						TD79 */
#define		TBKTBKUP		0x80
