/*********************************************************************/
/*  ŽÃŽ°ŽÌŽÞŽÙ Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                          */
/*********************************************************************/
 
struct  tcompat {
    char  tcomtbid[4];                  /* ŽÃ-ŽÌŽÞŽÙ Ž¼Ž·ŽÍŽÞŽÂŽ¼              */
    short tcommxno;                     /* Ž»Ž²ŽÀŽÞŽ² Ž´ŽÝŽÄŽØ Ž½Ž³             */
    short tcomefen;                     /* ŽÕŽ³ŽºŽ³ Ž´ŽÝŽÄŽØ Ž½Ž³              */
    short tcomprsl;                     /* 1 ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽµŽµŽ·Ž»           */
    unsigned	char  tcomsbps;         /* Ž»ŽÌŽÞ Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ ŽÉ ŽµŽµŽ·Ž» TC1965 */
    char  tcomstat;                     /* Ž½ŽÃ-ŽÀŽ½                     */
};      
typedef  struct  tcompat  TCOMPAT;
