
/*--------------------------------------------------------------------------*/
/*¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä					±¿Å¾´ÉÍý¶ÈÌ³							*/
/*¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä															*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä														*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜ£É£Ä¡ä														*/
/*¡ã¥â¥¸¥å¡¼¥ëÌ¾¡ä					£Ô£Ã£Ó£Ô¥Æ¡¼¥Ö¥ë						*/
/*¡ã¥â¥¸¥å¡¼¥ë£É£Ä¡ä														*/
/*¡ã¥â¥¸¥å¡¼¥ëÄÌÈÖ¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ãÅ¬ÍÑµ¡¼ï¡ä						£Á£Ã£Å									*/
/*¡ãÅ¬ÍÑ£Ï£Ó¡ä						£Ô£Ò£Á£Ä£Å								*/
/*¡ã³«È¯´Ä¶­¡ä						£Ó£Õ£Î¡¡£Ó£Ð£Á£Ò£Ã¡Ý£É£Ð£Ø				*/
/*¡ãµ­½Ò¸À¸ì¡ä						£Ã¸À¸ì									*/
/*¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä				¹½Â¤ÂÎ									*/
/*¡ãµ¡Ç½¶èÊ¬¡ä																*/
/*¡ãÂÐ¾Ý¥Ç¡¼¥¿¡ä															*/
/*¡ã¹©Äø¡¦³¬ÁØ¶èÊ¬¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä				£Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à					*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä				£µ£·£²£¶£°£±£´£°£²£±£°£°				*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯Ã´ÅöÌ¾¡ä					±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö						*/
/*¡ãÅÅÏÃÈÖ¹æ¡ä						169-3537(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/*¡ãÀß·×¼ÔÌ¾¡ä						£Ô£Ä£Ã¡¡ÀÖÄÍ¡¡°ì¸µ						*/
/*¡ãÀß·×Ç¯·îÆü¡ä					£±£¹£¹£³Ç¯£±£±·î¡¡£¸Æü					*/
/*¡ãÀß·×½¤Àµ¼ÔÌ¾¡ä															*/
/*¡ãÀß·×½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*--------------------------------------------------------------------------*/
/*¡ã¥½¡¼¥¹ºîÀ®¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡Á°Âô¡¡¹¸						*/
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				£±£¹£¹£³Ç¯£±£±·î£±£°Æü					*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡º£°æ¡¡¹°¹¬						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£µÇ¯  £±·î£²£µÆü	CT0809 ST1748   */
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡¿ù²¬  ¹îÌé						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£µÇ¯  £²·î£±£µÆü	CT0868 ST1749	*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡º£°æ¡¡¹°¹¬						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£µÇ¯  £¸·î¡¡£¹Æü	CT1107 ST3143	*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡»³ËÜ  Í­»Ê						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£¶Ç¯£°£²·î£²£²Æü	CT1211(ST4062)	*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				NTT-D¡¡ »³ËÜ¡¡ÃÒÌé						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£·Ç¯£°£¶·î£°£²Æü	SSCY0198		*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				NTT-D¡¡ ËÌÀ¾¡¡ÃÒÍÎ					M01	*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£·Ç¯£°£··î£°£·Æü	ST4896			*/
/*--------------------------------------------------------------------------*/
/*¡ã¸«ÀÑ¥¹¥Æ¥Ã¥×¡ä															*/
/*--------------------------------------------------------------------------*/
/*¡ãµ¡Ç½³µÍ×¡ä																*/
/*--------------------------------------------------------------------------*/
/*¡ã¸Æ½Ð·Á¼°¡ä																*/
/*¡ã²¾°ú¿ô¡ä																*/
/*¡ãÊÖµÑÃÍ¡ä																*/
/*--------------------------------------------------------------------------*/
/*¡ãÆþ½ÐÎÏ¥Ç¡¼¥¿¹½Â¤¡ä														*/
/*¡ãÀ©¸Â»ö¹à¡ä																*/
/*		£Ì£Í¥Æ¡¼¥Ö¥ë¤Ç¤¢¤ë¡£												*/
/*		£Ô£Ö£Ã£Ô¤Î¥¹¥Æ¡¼¥¿¥¹¤Ï°Ê²¼¤ÎÄÌ¤ê¤Ç¤¢¤ë¡£							*/
/*			­¡£Ó£Í£Ð¡¿£Á£Ð¤Î½êÂ°			£Ó£Í£Ð¥Æ¡¼¥Ö¥ë					*/
/*			­¢£Ò£Â£É¼èÆÀÉÔÍ×¡¿Í×			ÉÔÍ×							*/
/*			­£»²¾È¡¿¹¹¿·					¹¹¿·¥Æ¡¼¥Ö¥ë					*/
/*			­¤ÇÓÂ¾ÉÔÍ×¡¿Í×					ÇÓÂ¾Í×							*/
/*			­¥¸ÄÊÌÉôÇÓÂ¾¡¿Á´ÂÎÇÓÂ¾			Á´ÂÎÇÓÂ¾						*/
/*			­¦£Ê£Î£Ì¼èÆÀÃ±°Ì¸ÄÊÌÉô¡¿¹àÌÜ	¡Ê°ÕÌ£¤Ê¤·¡Ë					*/
/*¡ã»ÈÍÑ³°Éô¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*¡ã¸Æ½Ð¸µ¤Î¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:												 		*/
/*¥×¥í¥»¥¹Ì¾		:£Á£Ð¥×¥í¥»¥¹									 		*/
/*²þÂ¤ÈÖ¹æ			:PRC-031-01										 		*/
/*²þÂ¤ÆâÍÆ			:¹àÌÜÌ¾¾Î¤òÌÜÅª¤Ë±è¤Ã¤¿Ì¾¾Î¤Ë½¤Àµ     			 		*/
/*²þÂ¤Æü			:2002.11.07										 		*/
/*²þÂ¤¼Ô			:supply Taguchi									 		*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:												 		*/
/*¥×¥í¥»¥¹Ì¾		:mob											 		*/
/*²þÂ¤ÈÖ¹æ			:PRC-057-01										 		*/
/*²þÂ¤ÆâÍÆ			:mobÆâÉô»ÅÍÍÊÑ¹¹ÂÐ±þ			     			 		*/
/*²þÂ¤Æü			:2003.3.31										 		*/
/*²þÂ¤¼Ô			:supply Kajiwara								 		*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:												 		*/
/*¥×¥í¥»¥¹Ì¾		:rcv											 		*/
/*²þÂ¤ÈÖ¹æ			:PRC-058-01										 		*/
/*²þÂ¤ÆâÍÆ			:rcvÆâÉô»ÅÍÍÊÑ¹¹ÂÐ±þ			     			 		*/
/*²þÂ¤Æü			:2003.4.04										 		*/
/*²þÂ¤¼Ô			:supply 										 		*/
/****************************************************************************/
/****************************************************************************/
/*	£Ô£Ã£Ó£Ô¸ÄÊÌÉô															*/
/****************************************************************************/
struct  tcstpsz {
	char  tcststat[4];                  /* ¥·¥¹¥Æ¥à¥¹¥Æ¡¼¥¿¥¹				*/
	long  tcstedwt;                     /* ½ªÎ»ÂÔ¤Á»þ´Ö						*/
	long  tcstmfwt;                     /* »ñ¸»ÀêÍ­ºÇÂçÂÔ¤Á»þ´Ö				*/
	long  tcstmrbi;                     /* £Ò£Â£É¼èÆÀ´Ö³Ö»þ´Ö				*/
	long  tcstdktm;                     /* ¶¯À©¥Ç¥£¥¹¥¯½ñ¤­¹þ¤ß¥¿¥¤¥Þ		*/
    long  tcstmrlb;						/* ¥Ü¥ê¥å¡¼¥à¥³¥Ô¡¼¥Ð¥Ã¥Õ¥¡¥µ¥¤¥º	*/
    char  tcstutyd[16];					/* £Ô£Ò£Á£Ä£Å¡¿£Õ£Î£É£Ø¥³¥Þ¥ó¥É³ÊÇ¼	*/
										/*	¥Í¥Ã¥È¥ï¡¼¥¯¥Ç¥£¥ì¥¯¥È¥êÌ¾		*/
    short tcstmrec;						/* ¥Ü¥ê¥å¡¼¥àÊÄºÉ´°Î»ÂÔ¤Á²ó¿ô		*/
    char  tcstfptp;						/* ¥Õ¥¡¥¤¥ëÅ¾Á÷¥Ñ¥¹À©¸æ¥¿¥¤¥×		*/
    char  tcstcid;                      /* ³°ÉôÃ¼»ÒÈÖ¹æ						*/
    long  tcsttktm;						/* £ô£á£ë£å£ï£õ£ô¥¤¥ó¥¿¥Ð¥ë¥¿¥¤¥ÞÃÍ	*/
	long  tcstcewt;                     /* £í£ï¡²£å£ø£ã£í¼Â¹ÔÂÔ¤Á»þ´Ö		*/
	long  tcstcpwt;                     /* £í£ï¡²£ã£ò£ð£ò¼Â¹ÔÂÔ¤Á»þ´Ö		*/
	char  tcstlvl;                      /* ¥á¥Ã¥»¡¼¥¸¥ì¥Ù¥ë					*/
	char  tcstansr;                     /* £Å£Î£Ñ¥·¡¼¥±¥ó¥¹±þÅú¥·¡¼¥±¥ó¥¹	*/
    short tcstifsz;                     /* £É¥Õ¥ì¡¼¥àÄ¹¡Ê£Î£Ã£Ð¡Ë			*/
	long  tcstevnt;                     /* ¸Î¾ã´ÉÍý¥¤¥Ù¥ó¥ÈÈÖ¹æ				*/
	char  tcsterrp[8];                  /* ¸Î¾ã´ÉÍý¥×¥í¥»¥¹¼±ÊÌÌ¾			*/
    char  tcstmrra[8];					/* ¥Ü¥ê¥å¡¼¥à²óÉüÄÌÃÎÀè				*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstzerm[8];                  /* Á´¶ä¶¨¥¨¥é¡¼¥á¥Ã¥»¡¼¥¸¾ðÊóÄÌÃÎÀè	*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstdaap[8];                  /* ÂåÉ½£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾			*/
    char  tcstsmpa[8];                  /* £Ó£Í£Ð¥Õ¥¡¥¤¥ë£²½Å¸Î¾ãÈ¯À¸¡¿²óÉü	*/
										/*	ÄÌÃÎÀè£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾		*/
    char  tcstsyoa[8];                  /* Í½È÷·Ï¥À¥¦¥óÈ¯À¸¡¿²óÉüÄÌÃÎÀè		*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstntca[8];                  /* £Î£Ô£Ã´Ö²óÀþ¸Î¾ãÈ¯À¸¡¿²óÉüÄÌÃÎÀè	*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstmria[8];					/* ¥Ü¥ê¥å¡¼¥àÉüµì¾ðÊóÄÌÃÎÀè			*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstzena[8];                  /* Á´¶ä¶¨²óÀþ¸Î¾ãÈ¯À¸¡¿²óÉüÄÌÃÎÀè	*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstgyoa[8];                  /* ¶ÈÌ³¥Õ¥¡¥¤¥ë¸Î¾ãÈ¯À¸¡¿²óÉüÄÌÃÎÀè	*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstresa[8];                  /* ¥ê¥¹¥È¥¢³«»Ï¡¿½ªÎ»ÄÌÃÎÀè			*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tcstdcpp[8];                  /* ·Ï´ÖÄÌ¿®À©¸æ¥×¥í¥»¥¹¼±ÊÌÌ¾		*/
    char  tcstncpp[8];                  /* £Î£Ô£Ã´ÖÄÌ¿®À©¸æ¥×¥í¥»¥¹¼±ÊÌÌ¾	*/
    char  tcstzcpp[8];                  /* Á´¶ä¶¨Áê¼êµ¯Æ°¥×¥í¥»¥¹¼±ÊÌÌ¾		*/
    char  tcsticpp[8];                  /* £É¡¿£Ï¥Á¥ã¥Í¥ë´ÉÍý¥×¥í¥»¥¹¼±ÊÌÌ¾	*/
    char  tcstzcpq[8];                  /* Á´¶ä¶¨ÅöÊýµ¯Æ°¥×¥í¥»¥¹¼±ÊÌÌ¾		*/
    long  tcstmrwt;                     /* ½é´ü£Ò£Â£É¼èÆÀ»þ´Ö				*/
	long  tcstjsiz;                     /* £Ê£Î£ÌÊÔ½¸°è³ÈÄ¥¥µ¥¤¥º			*/
    long  tcstfnat;                     /* ¥·¥¹¥Æ¥àºî¶È°è²áÉé²Ù»þ¥¿¥¤¥ÞÃÍ	*/
    short tcstfnar;                     /* ¥·¥¹¥Æ¥àºî¶È°è²áÉé²Ù»þ¥ê¥È¥é¥¤²ó¿ô*/
    short tcstslfn;                     /* ¼«¥Î¡¼¥ÉÈÖ¹æ						*/
    long  tcstopnt;						/* ¥â¥Ç¥à¡¿£Ä£Ó£Õ¸Î¾ã»þ				*/
										/*	¥ê¥È¥é¥¤¥¿¥¤¥ÞÃÍ				*/
    char  tcstrnui;                     /* ¥ê¥«¥Ð¥êÍ×¡¿ÉÔÍ×¾ðÊó				*/
	char  tcstmrjb;                     /* £Ê£Î£Ì¥Ð¥Ã¥¯¥¢¥Ã¥×¥â¡¼¥É			*/
	char  tcst2err;                     /* £²½Å¸Î¾ã»þ¤Î½èÃÖ					*/
    char  tcstsnui;                     /* ¼«Æ°ºÆ³«Í×¡¿ÉÔÍ×¾ðÊó				*/
    char  tcstlnui;                     /* ¥í¥°¼èÆÀÍ×¡¿ÉÔÍ×¾ðÊó				*/
    char  tcstinsg;                     /* ²óÀþ·Ï¥Æ¡¼¥Ö¥ëºîÀ®ÊýË¡			*/
    char  tcstbnui;                     /* ¥Ð¥Ã¥¯¥¢¥Ã¥×Í×¡¿ÉÔÍ×¾ðÊó			*/
/*  ¸÷¥Ç¥£¥¹¥¯´Ö¤Î¥³¥Ô¡¼ÇÑ»ß¤ËÈ¼¤¦ºï½ü(1¹Ô)									*/
	char  tcstkjus;						/* £Ë£Ê»ÈÍÑ¾ðÊó	   		 	 CT0809 */
    char  tcstascp[8];					/* Áê¼ê·Ï¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    short tcstmisz;                     /* ºÇÂç£Í£É£Á¥µ¥¤¥º					*/
    short tcstrbsg;                     /* £í£ä¡²£ã£ç£å£ôÍÑ¼õ¿®¥Ð¥Ã¥Õ¥¡ºÇÂç	*/
										/*	¥µ¥¤¥º							*/
    short tcstrbsi;                     /* £í£ä¡²£é£ò£å£äÍÑ¼õ¿®¥Ð¥Ã¥Õ¥¡ºÇÂç	*/
										/*	¥µ¥¤¥º							*/
    short tcstabtn;                     /* Æ±°ì¥×¥í¥»¥¹¥¢¥Ü¡¼¥È²ó¿ôµöÍÆÃÍ	*/
    char  tcstlpmg;                     /* ²óÉü¥á¥Ã¥»¡¼¥¸½ÐÎÏÍ­Ìµ			*/
    char  tcstmrvm;                     /* £Ö£Ò£Ã£ÖÉüµì¥â¡¼¥É				*/
    short tcstedsu;                     /* Æ±°ì°¸ÀèÊÔ½¸²ÄÇ½¿ô				*/
    long  tcstkyot;                     /* ¶¯À©ÊÄºÉ±þÅú´Æ»ë¥¿¥¤¥ÞÃÍ			*/
    long  tcstkait;                     /* ²óÀþ²óÉü´Æ»ë¥¿¥¤¥ÞÃÍ				*/
    char  tcstscpp[8];                  /* ¥á¥Ã¥»¡¼¥¸Ãæ·Ñ¥×¥í¥»¥¹¼±ÊÌÌ¾		*/
    long  tcstnlt1;                     /* ²óÀþ¥ª¡¼¥×¥ó¥ê¥È¥é¥¤¥¿¥¤¥Þ¡§£Ì£Ô£±*/
    long  tcstnlt2;                     /* ¥â¡¼¥É¥»¥Ã¥È¥ê¥È¥é¥¤¥¿¥¤¥Þ¡§£Ì£Ô£²*/
    long  tcstnt1n;                     /* ±þÅú´Æ»ë¥¿¥¤¥Þ	¡§£Ô£±			*/
    long  tcstnt2n;                     /* ¥Ó¥¸¡¼´Æ»ë¥¿¥¤¥Þ	¡§£Ô£²			*/
    long  tcstnt3n;                     /* £Ò£ÆÂÔ´Æ»ë¥¿¥¤¥Þ	¡§£Ô£³			*/
    long  tcstnt5n;                     /* £Ó£ÆÂÔ´Æ»ë¥¿¥¤¥Þ	¡§£Ô£µ			*/
    long  tcstnft1;                     /* £Ä£Õ±þÅú³ÎÇ§¥¿¥¤¥Þ¡§£Æ£Ô£±		*/
    long  tcstnft2;                     /* ¥Î¡¼¥É¿ÇÃÇ³ÎÇ§¥¿¥¤¥Þ¡§£Æ£Ô£²		*/
    long  tcstnft3;                     /* ¥Î¡¼¥É¿ÇÃÇ¥ê¥È¥é¥¤¥¿¥¤¥Þ¡§£Æ£Ô£³	*/
    long  tcstnft4;                     /* ¥Ñ¥¹ÀÜÂ³³ÎÇ§¥¿¥¤¥Þ¡§£Æ£Ô£´		*/
    long  tcstnft5;                     /* ¥Ñ¥¹ÀÜÂ³¥ê¥È¥é¥¤¥¿¥¤¥Þ¡§£Æ£Ô£µ	*/
    long  tcstnft6;                     /* ¥Ñ¥¹ÀÚÃÇ³ÎÇ§¥¿¥¤¥Þ¡§£Æ£Ô£¶		*/
    long  tcstnft7;                     /* £Ô¥Ñ¥¹Ê§½Ð¥ê¥È¥é¥¤¥¿¥¤¥Þ¡§£Æ£Ô£·	*/
    long  tcstnct1;                     /* ·Ï´Ö±þÅú³ÎÇ§¥¿¥¤¥Þ¡§£Ã£Ô£±		*/
    long  tcstsbin;						/* ¥µ¥Ö£Í£Ó½é´ü²½´°Î»ÂÔ¤Á»þ´Ö		*/
    long  tcstsbtr;						/* ¥µ¥Ö£Í£Ó½ªÎ»ÂÔ¤Á»þ´Ö				*/
    long  tcstrcov;						/* ²óÀþ¾ã³²²óÉü¸¡½Ð¥¿¥¤¥ÞÃÍ			*/
    long  tcstrunt;						/* ²óÀþ¾ã³²²óÉü¸¡½Ð¥¿¥¤¥ÞÃÍ¤ÎÃ±°Ì	*/
    long  tcsthctm;                     /* £Í£É£Â¥¤¥ó¥¿¡¼¥Ð¥ë¥¿¥¤¥Þ	 		*/
    long  tcstcntm;                     /* ŽÌŽßŽÛŽ¾Ž½Ž·Ž¬ŽÝŽ¾ŽÙÂÔ¤Á»þ´Ö¡¡¡¡SSCY0198	*/
    short tcstnn1n;						/* £Ä£Ô¥Ñ¥±¥Ã¥ÈÌµ±þÅú				*/
										/*	¥ê¥È¥é¥¤²ó¿ô¡§£Î£±				*/
    short tcstnn2n;						/* £Ä£Ô¥Ñ¥±¥Ã¥È¥Ó¥¸¡¼				*/
										/*	¥ê¥È¥é¥¤²ó¿ô¡§£Î£²				*/
    short tcstnn3n;						/* £Ò£ÆÂÔÌµ±þÅú¥ê¥È¥é¥¤²ó¿ô¡§£Î£³	*/
    short tcstrt4w;                     /* £´£×Æþ½ÐÎÏ½èÍý°Û¾ï»þ¤Î¥ê¥È¥é¥¤²ó¿ô*/
    short tcstexrs;						/* ½ÐÎÏ¥Ñ¥¿¡¼¥óÊÑ¹¹É½¼¨¡Ê£Ô£Ò£Á£Ä£Å¡Ë*/
    short tcstexsm;						/* ½ÐÎÏ¥Ñ¥¿¡¼¥óÊÑ¹¹É½¼¨¡Ê£Ó£Í£Ð¡Ë	*/
	long  tcstwivl;						/* Í½È÷·Ï´Æ»ë´Ö³Ö		PRC-057-01	*/
	char  tcsttrcv;						/* ¥Æ¡¼¥Ö¥ë¥ê¥«¥Ð¥êÍ×¡¿ÉÔÍ×			*/
    									/* 						PRC-058-01	*/
	char  tcstyob21;					/* Í½È÷¡Êshort->char¤ËÊÑ¹¹¡Ë		*/
										/* 						PRC-058-01	*/
    short tcstyob22;                    /* Í½È÷								*/
    short tcstyob23;                    /* Í½È÷								*/
    short tcstyob24;                    /* Í½È÷								*/
    short tcstnwsn;                     /* ¥¦¥¤¥ó¥É¥¦¥µ¥¤¥º					*/
    char  tcstutyp;						/* £Ô£Ò£Á£Ä£Å¡¿£Õ£Î£É£Ø¥³¥Þ¥ó¥É		*/
										/*	³ÊÇ¼£Ð£ÕÈÖ¹æ					*/
	char  tcstmsgh;						/* ¥á¥Ã¥»¡¼¥¸½ÐÎÏÉ½¼¨				*/
	long  tcstmfrw;                     /* £Æ£É£ÐÈó´°Î»¥¢¥¯¥»¥¹¥ê¥¶¥ë¥ÈÂÔ»þ´Ö*/
	char  tcstmfeq;                     /* £Æ£É£ÐÇÓÂ¾¥Á¥§¥Ã¥¯Í×¡¿ÉÔÍ×		*/
	char  tcststnd;						/* ¥Î¡¼¥ÉÈÖ¹æÉÕÍ¿É½¼¨				*/
	short tcstkmsg;                     /* ºÇÂç·Ï´Ö¥á¥Ã¥»¡¼¥¸Ä¹				*/
	long  tcstlopt;                     /* ¥ª¥Ú¥ì¡¼¥¿¤È¤Î²ñÏÃ»þ±þÅúÂÔ¤Á»þ´Ö	*/
    long  tcstmrbt;                     /* ¥Ð¥Ã¥¯¥¢¥Ã¥×ÍÑ£Ö£Ò£Ã£Ö´Æ»ë¥¿¥¤¥Þ	*/
	long  tcstjrsz;						/* Ž¼ŽÞŽ¬Ž°ŽÅŽÙ°ì³çÆÉ¤ß¹þ¤ßÄ¹		CT1211	*/
	short tcsttrcf;                    	/* ¥È¥ì¡¼¥¹½ÐÎÏÍ×¡¿ÉÔÍ×	PRC-031-01	*/
	short tcstyob34;                    /* Í½È÷								*/
	char  tcstmran[8];					/* £Á£Ã£Ã¡ô£¶ÀêÍ­¡¿²òÊüÄÌÃÎÀè		*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
	short tcstmrat;                     /* £Á£Ã£Ã»ÈÍÑµö²Ä±þÅú´Æ»ë¥¿¥¤¥Þ		*/
    char  tcstmrpu;						/* ½é´ü²½ÁõÃÖ³ÊÇ¼£Ð£ÕÈÖ¹æ			*/
	/************************************************************************/
	/*	TDCÄÉ²Ã																*/
	/************************************************************************/
	char  tcstjnui;                   	/* ¥¸¥ã¡¼¥Ê¥ë½é´ü²½Í×¡¿ÉÔÍ×¾ðÊó		*/
	/************************************************************************/
	long  tcstyob36;                    /* Í½È÷								*/
    long  tcstyob37;                    /* Í½È÷								*/
	short tcsttend;						/* ÀßÃÖÅ¹ÂåÉ½¥Î¡¼¥ÉÈÖ¹æ				*/
	char  tcstmrby;                     /* ¥Ð¥Ã¥¯¥¢¥Ã¥×»þÂÐ£Ö£Ò£Ã£ÖÍ¥ÀèÅÙ	*/
	char  tcstbunh;						/* £Á£ÐÊ¬»¶É½¼¨						*/
	long  tcstmrev;                     /* ¥Ü¥ê¥å¡¼¥àÊÄºÉ´°Î»ÂÔ¤Á»þ´Ö		*/
	char  tcstzcpn[8];                  /* Á´¶ä¶¨±¿ÍÑ´ÉÍý¥×¥í¥»¥¹¼±ÊÌÌ¾		*/
	long  tcst1siz;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§1Ž»Ž²Ž½ŽÞ		M01	*/
	long  tcst2siz;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§2Ž»Ž²Ž½ŽÞ		M01	*/
	long  tcst3siz;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§3Ž»Ž²Ž½ŽÞ		M01	*/
	long  tcst4siz;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§4Ž»Ž²Ž½ŽÞ		M01	*/
	long  tcst1unt;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§1¸Ä¿ô		M01	*/
	long  tcst2unt;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§2¸Ä¿ô		M01	*/
	long  tcst3unt;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§3¸Ä¿ô		M01	*/
	long  tcst4unt;						/* LICPŽÃŽÞŽ°ŽÀÍÑŽÌŽßŽ°ŽÙŽÊŽÞŽ¯ŽÌŽ§4¸Ä¿ô		M01	*/
	char  tcstpsno;						/* LICPµ¯Æ°»þÀßÄêÍÑÏÀÍýŽÊŽßŽ½¿ô	M01 */
    char  tcstyob38[31];				/* Í½È÷								*/
/****************************************************************************/
/*	¤³¤³¤è¤ê£Ô£Ä£ÃÄÉ²ÃÊ¬													*/
/****************************************************************************/
	long  tcstlytm;						/* ¸ÉÎ©¾õÂÖ²óÉüÂÔ¤Á¥¿¥¤¥Þ¡ÊÉÃ¡Ë		*/
	long  tcstbftm;						/* ¥Ð¥Ã¥Õ¥¡³ÎÊÝ¥ê¥È¥é¥¤´Ö³Ö»þ´Ö¡ÊÉÃ¡Ë*/
	long  tcstevno;						/* ŽÎŽ¯ŽÄŽ½ŽÀŽÝŽÊŽÞŽ²Í½È÷·ÏŽ»Ž½ŽÍŽßŽÝŽÄŽÞ²ò½üŽ²ŽÍŽÞŽÝŽÄÈÖ¹æ*/
	unsigned  char  tcstmtcl;			/* ¥á¥ó¥Æ¥Ê¥ó¥¹¥«¡¼¥Í¥ëÍ×¡¿ÉÔÍ×¾ðÊó	*/
	char  tcstprch;						/* Á°²óÁö¹Ô¥×¥í¥°¥é¥à¥â¡¼¥É			*/
										/*	¥Á¥§¥Ã¥¯Í×¡¿ÉÔÍ×				*/
	char  tcstrber;						/* £Ò£Â£É¥Õ¥¡¥¤¥ë¸Î¾ã»þ½èÃÖ			*/
	char  tcstkjer;						/* £Ë£Ê£²½Å¸Î¾ã»þ½èÃÖ				*/
	char  tcstsrcv;						/* £Ó£Ò£Ã£Ö¼ºÇÔ»þ½èÃÖ				*/
	char  tcstcnui;						/* £²½Å¸Î¾ã»þ½é´ü²½Í×¡¿ÉÔÍ×¾ðÊó	    */
    char  tcstityp;						/* £Ö£Ò£Ã£ÖÅÅÊ¸¾ðÊó¼ïÊÌ	TD90 CT1107 */
	char  tcstamdt;						/* ¥Þ¥·¥óÆüÉÕ¡¿£Á£ÐÆüÉÕÁªÂò¾ðÊó		*/
										/* ¥Þ¥·¥óÆüÉÕ¡¡¡§¡¡¡Ç£Í¡Ç			*/
										/* £Á£ÐÆüÉÕ¡¡¡¡¡§¡¡¡Ç£Á¡Ç			*/
	char  tcstvekd[8];					/* ¥¨¥é¡¼¼ïÊÌÄÌÃÎÅÅÊ¸Á÷¿®Àè			*/
										/*	£Á£Ð¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
	short tcstrtry;						/* ¥Õ¥¡¥¤¥ë¥¢¥¯¥»¥¹¥ê¥È¥é¥¤²ò¿ô		*/
	short tcstdely;						/* ¥ê¥»¥Ã¥È»þ±äÄ¹»þ´Ö				*/
    char  tcstmclp[8];                  /* ¥á¥Ã¥»¡¼¥¸À©¸æ¥×¥í¥»¥¹¼±ÊÌÌ¾	TD18*/
	long  tcstmhwt;						/* ³èÀþÁÞÈ´»þ´Ö                 TD90*/
	long  tcstjnle;						/* ¥¸¥ã¡¼¥Ê¥ë¥Ë¥¢¥¨¥ó¥ÉÄÌÃÎŽ»Ž²Ž½ŽÞ TD65*/
	long  tcstconn;						/* mc_conn¥ê¥È¥é¥¤´Ö³Ö				*/
	char  tcstmrsp[8];					/* ŽÐŽ×-ÏÀÍýŽÎŽÞŽØŽÕ-ŽÑÉüµì²ÄÇ½ÅÅÊ¸ÄÌÃÎÀèAP*/
										/* ŽÌŽßŽÛŽ¾Ž½¼±ÊÌÌ¾				CT0868  */
};
typedef  struct  tcstpsz  TCSTPSZ;

/****************************************************************************/
/*  £²½Å¸Î¾ã»þ½é´ü²½Í×¡¿ÉÔÍ×¾ðÊó(tcstcnui)									*/
/****************************************************************************/
#define  TCSTJINT  0x80					/* JNL½é´ü²½Í×                      */
#define  TCSTRINT  0x40					/* RBI½é´ü²½Í×                      */
/****************************************************************************/
/*	£Ó£Ò£Ã£Ö¼ºÇÔ»þ½é´üÎ©¤Á¾å¤²Í×¡¿ÉÔÍ×(tcstsrcv)							*/
/****************************************************************************/
#define	 TCSTINEC  '0'					/* ½é´üÎ©¤Á¾å¤²Í×					*/
#define  TCSTIUEC  '1'					/* ½é´üÎ©¤Á¾å¤²ÉÔÍ×					*/
/****************************************************************************/
/*	¥ê¥«¥Ð¥êÍ×¡¿ÉÔÍ×¾ðÊó(tcstrnui)											*/
/****************************************************************************/
#define  TCSTRNEC  '0'                  /* ¥ê¥«¥Ð¥êÍ×						*/
#define  TCSTRUEC  '1'                  /* ¥ê¥«¥Ð¥êÉÔÍ×						*/
/****************************************************************************/
/*	£²½Å¸Î¾ã»þ¤Î½èÃÖ(tcst2err)												*/
/****************************************************************************/
#define  TCST2DWN  '0'                  /* ¥·¥¹¥Æ¥à¥À¥¦¥ó¤¹¤ë				*/
#define  TCST2NDW  '1'                  /* ¥·¥¹¥Æ¥à¥À¥¦¥ó¤·¤Ê¤¤				*/
/****************************************************************************/
/*	¼«Æ°ºÆ³«Í×¡¿ÉÔÍ×¾ðÊó(tcstsnui)											*/
/****************************************************************************/
#define  TCSTSNEC  '0'                  /* ¼«Æ°ºÆ³«»ÏÍ×						*/
#define  TCSTSUEC  '1'                  /* ¼«Æ°ºÆ³«»ÏÉÔÍ×					*/
#define  TCSTSOEC  '2'					/* ¾ò·ïÉÕ¤­¼«Æ°ºÆ³«»ÏÍ×				*/
/****************************************************************************/
/*	¥í¥°¼èÆÀÍ×¡¿ÉÔÍ×¾ðÊó(tcstlnui)											*/
/****************************************************************************/
#define  TCSTLNEC  '0'                  /* ¥í¥°¼èÆÀÍ×						*/
#define  TCSTLUEC  '1'                  /* ¥í¥°¼èÆÀÉÔÍ×						*/
/****************************************************************************/
/****************************************************************************/
#define  TCSTMNEC  '0'                  /* ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽßJNL ŽÏŽ³ŽÝŽÄŽÖŽ³        		*/
#define  TCSTMUEC  '1'                  /* ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽßJNL ŽÏŽ³ŽÝŽÄŽÌŽÖŽ³       		*/
/****************************************************************************/
/*	¥Ð¥Ã¥¯¥¢¥Ã¥×Í×¡¿ÉÔÍ×¾ðÊó(tcstbnui)										*/
/****************************************************************************/
#define  TCSTBNEC  '0'                  /* ¥Ð¥Ã¥¯¥¢¥Ã¥×Í×					*/
#define  TCSTBUEC  '1'                  /* ¥Ð¥Ã¥¯¥¢¥Ã¥×ÉÔÍ×					*/
/****************************************************************************/
/*	¥Ð¥Ã¥¯¥¢¥Ã¥×»þÂÐ£Ö£Ò£Ã£ÖÍ¥ÀèÅÙ(tcstmrby)								*/
/****************************************************************************/
#define  TCSTBKVR  '1'                  /* ¥Ð¥Ã¥¯¥¢¥Ã¥×Í¥Àè					*/
#define  TCSTVRBK  '0'                  /* £Ö£Ò£Ã£ÖÍ¥Àè						*/
/****************************************************************************/
/*	¥Ü¥ê¥å¡¼¥à¥³¥Ô¡¼Èæ³Ó¸¡ººÍÑ¥Õ¥é¥°(tcstmrbv)								*/
/****************************************************************************/
/*  ¸÷¥Ç¥£¥¹¥¯´Ö¤Î¥³¥Ô¡¼ÇÑ»ß¤ËÈ¼¤¦ºï½ü(2¹Ô)									*/
/****************************************************************************/
/*	£Ê£Î£Ì¥Ð¥Ã¥¯¥¢¥Ã¥×¥â¡¼¥É(tcstmrjb)										*/
/****************************************************************************/
#define  TCSTJBKS  'S'                  /* ÊÒ·Ï£Ê£Î£Ì¤Î¤ß¥Ð¥Ã¥¯¥¢¥Ã¥×		*/
#define  TCSTJBKD  'D'                  /* Î¾·Ï£Ê£Î£Ì¤ò¥Ð¥Ã¥¯¥¢¥Ã¥×			*/
/****************************************************************************/
/*	£Ö£Ò£Ã£ÖÉüµì¥â¡¼¥É(tcstmrvm)											*/
/****************************************************************************/
#define  TCSTVMRJ  '0'                  /* ¥ê¥¹¥È¥¢¡¦£Æ£ÊÉüµìÏ¢Â³			*/
#define  TCSTVMOL  '1'                  /* ¥ê¥¹¥È¥¢¡¦£Æ£ÊÉüµìÃ±ÆÈ			*/
/****************************************************************************/
/*	¥á¥ó¥Æ¥Ê¥ó¥¹¥«¡¼¥Í¥ëÍ×¡¿ÉÔÍ×¾ðÊó										*/
/****************************************************************************/
#define	 TCSTMKNE  '1'					/*	¥á¥ó¥Æ¥Ê¥ó¥¹¥«¡¼¥Í¥ëÍ×			*/
#define	 TCSTMKNN  '0'					/*	¥á¥ó¥Æ¥Ê¥ó¥¹¥«¡¼¥Í¥ëÉÔÍ×		*/
/****************************************************************************/
/*	Á°²óÁö¹Ô¥×¥í¥°¥é¥à¥â¡¼¥É¥Á¥§¥Ã¥¯Í×¡¿ÉÔÍ×¾ðÊó							*/
/****************************************************************************/
#define  TCSTPRNE  '1'					/*	¥Á¥§¥Ã¥¯Í×						*/
#define	 TCSTPRNN  '0'					/*	¥Á¥§¥Ã¥¯ÉÔÍ×					*/
/****************************************************************************/
/*	£Ò£Â£É¥Õ¥¡¥¤¥ë¸Î¾ã»þ½èÃÖ												*/
/****************************************************************************/
#define  TCSTRDWN  '0'					/*	¥·¥¹¥Æ¥à¥À¥¦¥ó¤¹¤ë				*/
#define	 TCSTRNDW  '1'					/*	¥·¥¹¥Æ¥à¥À¥¦¥ó¤·¤Ê¤¤			*/
/****************************************************************************/
/*	£Ë£Ê»ÈÍÑ¾ðÊó(tcstkjus)													*/
/****************************************************************************/
#define	 TCSTKJUSE	0x01				/*  £Ë£Ê¤ò»ÈÍÑ¤¹¤ë		TD42 CT0809	*/
/****************************************************************************/
/*	£Ö£Ò£Ã£ÖÅÅÊ¸¾ðÊó¼ïÊÌ(tcstityp)											*/
/****************************************************************************/
#define	 TCSTPVIF	0x00				/*  ÏÀÍýŽÎŽÞŽØŽ­Ž°ŽÑ¾ðÊó¤Ê¤·TD90 CT1107	*/
#define	 TCSTVMIF	0x01				/*  ÏÀÍýŽÎŽÞŽØŽ­Ž°ŽÑ¾ðÊó¤¢¤êTD90 CT1107	*/
/****************************************************************************/
/*	¥Æ¡¼¥Ö¥ë¥ê¥«¥Ð¥êÍ×¡¿ÉÔÍ×¾ðÊó(tcsttrcv)						PRC-058-01	*/
/****************************************************************************/
#define	 TCSTTRNE  'Y'					/* ¥Æ¡¼¥Ö¥ë¥ê¥«¥Ð¥êÍ×				*/
#define	 TCSTTRNN  'N'					/* ¥Æ¡¼¥Ö¥ë¥ê¥«¥Ð¥êÉÔÍ×				*/
