/*********************************************************************/
/*	TERT Ž»ŽÌŽÞ Ž·Ž®Ž³ŽÂŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²										 */
/*********************************************************************/
/*-------------------------------------------------------------------*/
/* ¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				 ±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÉô¡¡µÜÏÆ		  	 */
/* ¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£¹Ç¯£°£³·î£³£±Æü SPCY0146 */
/*			     640MOÁõÃÖ¤Ø¤ÎÂÐ±þ									 */
/*-------------------------------------------------------------------*/
struct	tertsub	{
	long	tertacnt;					/* ŽÌŽßŽÛŽ¾Ž½ Ž±ŽÎŽÞŽ°ŽÄ Ž¶Ž³ŽÝŽÀ			 */
};
typedef	struct	tertsub TERTSUB;
/*********************************************************************/
/*	TERT ŽºŽÍŽÞŽÂ ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	tertpsz	{
	long	tertercd;					/* I/O Ž´Ž×Ž° ŽºŽ°ŽÄŽÞ				 */

	char	tertodk;					/* ACCŽ´Ž×Ž° Ž¼Ž­ŽÍŽÞŽÂ 		TD00 */
										/* .... ...1  ŽÊŽÞŽ²ŽÀŽ² Ž´Ž×Ž°		 */
										/* .... ..1.  Ž¿Ž³ŽÁ Ž´Ž×Ž°		 */
										/* .... .1..  Ž¼ŽÖŽ³ ŽÌŽ¶ Ž´Ž×Ž°	 */
										/* .... 1...  Ž¿ŽÉŽÀ Ž´Ž×Ž°		 */
										/* 1111 ....  ŽØŽ»ŽÞŽ°ŽÌŽÞ		 */
	char	tertdk;						/* Ž¼ŽÞŽ· ŽÃŽÞŽ¨Ž½Ž¸ Ž´Ž×Ž° Ž¼Ž­ŽÍŽÞŽÂ 		 */
										/* tertodk ŽÄ ŽµŽÅŽ¼ŽÞ 			 */
	char	tertfd;						/* ŽÌŽÛŽ¯ŽËŽßŽ° ŽÃŽÞŽ¨Ž½Ž¸ Ž´Ž×Ž° Ž¼Ž­ŽÍŽÞŽÂ 	 */
										/* tertodk ŽÄ ŽµŽÅŽ¼ŽÞ 			 */
	char	tertmt;						/* Ž¼ŽÞŽ· ŽÃŽ°ŽÌŽß Ž´Ž×Ž° Ž¼Ž­ŽÍŽÞŽÂ 		 */
										/* tertodk ŽÄ ŽµŽÅŽ¼ŽÞ 			 */
	char	tert3od;					/* 3.5ODŽ´Ž×Ž°¼ïÊÌ			TDN1 */
	char	tert5od;					/* 5ODŽ´Ž×Ž°¼ïÊÌ			TDN1 */
	char	tert5md;					/* 5MDŽ´Ž×Ž°¼ïÊÌ			TDN1 */
	char	tert6mo;					/* 640MMOŽ´Ž×Ž°¼ïÊÌ	SPCY0146 */
};
typedef	struct	tertpsz	TERTPSZ;

#define	TERTMDERR	0x01				/* ŽÊŽÞŽ²ŽÀŽ² Ž´Ž×Ž°  (Media error)	 */
#define	TERTDRERR	0x02				/* Ž¿Ž³ŽÁ Ž´Ž×Ž°	  (Drive error)	 */
#define	TERTNRERR	0x04				/* Ž¼ŽÖŽ³ ŽÌŽ¶ Ž´Ž×Ž° (Not ready  )	 */
#define	TERTOTERR	0x08				/* Ž¿ŽÉŽÀ Ž´Ž×Ž°	  (Other error)	 */
