/**********************************************************************/
/*                                                                    */
/*         TFAE ŽÃ-ŽÌŽÞŽÙ ŽÌŽ«-ŽÏŽ¯ŽÄ       tfae.h         (63.02.01)          */
/*                                                                    */
/**********************************************************************/

struct mdfaeko {
       char    tfaepuno;                 /* PU ŽÊŽÞŽÝŽºŽÞŽ³                 */
       char    tfae2add;                 /* 2Ž¼ŽÞŽ·Ž®Ž¸ Ž±ŽÄŽÞŽÚŽ½              */
       short   tfaeyob0;                 /* ŽÖ ŽËŽÞ                      */
       char    tfaeresv[8];              /* ŽÖ ŽËŽÞ                      */   
};
typedef struct mdfaeko TFAEPSZ;


