								/* 動的テーブル削除の為削除(7行) TD60*/
/*********************************************************************/
/*	TFMT ｺﾍﾞﾂ ﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct	tfmtpsz	{
								/* 動的テーブル削除の為削除(2行) TD60*/
	unsigned char	tfmtattr;	/* ﾌｱｲﾙ ｿﾞｸｾｲ						 */
								/*   1... ....  ﾘｶﾊﾞﾘ ﾖｳ.ﾌﾖｳ ｼﾞｮｳﾎｳ  */
								/*			'1'  ﾘｶﾊﾞﾘ ﾀｲｼｮｳ		 */
								/*						TFMTRCV		 */
								/*			'0'  ﾘｶﾊﾞﾘ ﾀｲｼｮｳ ﾃﾞﾅｲ    */
								/*   .1.. ....  ｼﾞｬｰﾅﾙ ｼｭﾄｸ ﾀﾝｲ		 */
								/*			'1'  ｼﾞｬｰﾅﾙｼｭﾄｸ ｺｳﾓｸﾀﾝｲ  */
								/*						TFMTJNL		 */
								/*			'0'  ｼﾞｬｰﾅﾙｼｭﾄｸ ﾚｺｰﾄﾞﾀﾝｲ */
								/*   ..1. ....  ﾌｧｲﾙ ｼﾞｮｳﾎｳ			 */
								/*			'1'  2ｼﾞｭｳｶ ﾌｧｲﾙ		 */
								/*						TFMTDUPF	 */
								/*			'0'  ﾋ 2ｼﾞｭｳｶ ﾌｧｲﾙ		 */
								/*   ...1 ....  FIPｶﾝﾘﾀｲｼｮｳﾌｧｲﾙｼﾞｮｳﾎｳ*/
								/*			'1'  FIPｶﾝﾘﾀｲｼｮｳｶﾞｲﾌｧｲﾙ  */
								/*						TFMTNFIP	 */
								/*			'0'  FIPｶﾝﾘﾀｲｼｮｳﾌｧｲﾙ	 */
								/*   .... 1...  ﾖﾋﾞ					 */
								/*   .... .111  ﾌｧｲﾙ ﾀｲﾌﾟ			 */
								/*						TFMTFTYPE	 */
								/*			'000'  ｽﾄﾘｰﾑ ｱｸｾｽ    (E) */
								/*						TFMTETYPE	 */
								/*			'001'  ｼﾞｭﾝ ﾚｺｰﾄﾞ    (A) */
								/*						TFMTATYPE	 */
								/*			'010'  ﾁｮｸｾﾂ ﾚｺｰﾄﾞ   (B) */
								/*						TFMTBTYPE 	 */
								/*			'011'  ﾗﾝﾀﾞﾏｲｽﾞ ﾎｳｼｷ (C) */
								/*						TFMTCTYPE	 */
								/*			'100'  ｷｰｹﾝｻｸ ﾎｳｼｷ   (D) */
								/*						TFMTDTYPE	 */
	unsigned char	tfmtstat;	/* ﾌｱｲﾙ ｽﾃ-ﾀｽ						 */
								/*   1... ....  ﾎﾞﾘｭｰﾑ ｼﾞｮｳﾎｳ		 */
								/*			'1'  ｼｮｳｶﾞｲ ﾁｭｳ			 */
								/*						TFMTVERR	 */
								/*			'0'  ｼｮｳｶﾞｲ ﾁｭｳ ﾃﾞﾅｲ	 */
								/*   .1.. ....  ﾌｧｲﾙ ｼﾞｮｳﾎｳ			 */
								/*			'1'  ｿｳｾｲ ｽﾞﾐ			 */
								/*						TFMTCRT		 */
								/*			'0'  ﾐ ｿｳｾｲ				 */
								/*   ..1. ....  ﾌｧｲﾙ ｼﾞｮｳﾎｳ			 */
								/*			'1'  ﾌｧｲﾙ ﾍｲｿｸﾁｭｳ		 */
								/*						TFMTFERR	 */
								/*			'0'  ﾌｧｲﾙ ﾍｲｿｸﾁｭｳ ﾃﾞﾅｲ	 */
								/*	 .... 1...	ﾌｧｲﾙ ｶｸﾁｮｳ			 */
								/*			'1'	ﾌｧｲﾙ ｶｸﾁｮｳ ﾁｭｳ		 */
								/*						TFMTEXTN	 */
								/*			'0'	ﾌｧｲﾙ ｶｸﾁｮｳ ﾁｭｳ ﾃﾞﾅｲ	 */
								/*   ...1 .111  ﾖﾋﾞ					 */
	short	tfmtoth1;			/* ﾖﾋﾞ								 */
	char	tfmtname[16];		/* ﾛﾝﾘ ﾌｱｲﾙ ﾒｲ						 */
	short	tfmtvmtp;			/* ｶｸﾉｳ ﾎﾞﾘﾕ-ﾑ VMT ｴﾝﾄﾘ NO			 */
	short	tfmtsgtp;			/* ｼﾖｿﾞｸ ｸﾞﾙ-ﾌﾟ SGT ｴﾝﾄﾘ NO			 */
	short	tfmtfmtp;			/* ﾄﾞｳｲﾂ ｸﾞﾙ-ﾌﾟ ｼﾞ FMT ｴﾝﾄﾘNO		 */
	short	tfmtdupp;			/* ﾆｼﾞﾕｳｶ ﾌｱｲﾙ ｱｲﾃ FMT ｴﾝﾄﾘNO 未使用 */
	long	tfmtinsp;			/* ﾌｱｲﾙ ｼﾖｷ ﾖｳﾘﾖｳ					 */
	long	tfmtexsp;			/* ﾌｱｲﾙ ｶｸﾁﾖｳ ﾖｳﾘﾖｳ					 */
	short	tfmtexno;			/* ﾌｱｲﾙ ｶｸﾁﾖｳ ｶｲｽｳ					 */
	short	tfmtnear;			/* ﾆｱ ｴﾝﾄﾞ ﾂｳﾁ ﾜﾘｱｲ					 */
	short	tfmtblks;			/* ﾌﾞﾛﾂｸ ﾁﾖｳ						 */
	short	tfmtrecs;			/* ﾚｺ-ﾄﾞ ﾁﾖｳ						 */
	short	tfmtkmtp;			/* KMT ｴﾝﾄﾘ NO						 */
	short	tfmtkeyn;			/* ｷ- ｽｳ							 */
	long	tfmteof;			/* EOF ｼﾞﾖｳﾎｳ						 */
	long	tfmtercd;			/* ｴﾗ- ｼﾞﾖｳﾎｳ						 */
	char	tfmtctim[8];		/* 創成時刻						TD30 */
};
typedef	struct	tfmtpsz	TFMTPSZ;

/*********************************************************************/
/*	ﾃ-ﾌﾞﾙ ﾅｲ ｺ-ﾄﾞ ﾃｲｷﾞ												 */
/*********************************************************************/
#define		TFMTRCV		0x80	/* FMTﾌｧｲﾙｿﾞｸｾｲ ﾘｶﾊﾞﾘﾀｲｼｮｳﾌｧｲﾙ       */
#define		TFMTJNL		0x40	/* FMTﾌｧｲﾙｿﾞｸｾｲ ｼﾞｬｰﾅﾙｼｭﾄｸﾀﾝｲｺｳﾓｸ    */
#define		TFMTDUPF	0x20	/* FMTﾌｧｲﾙｿﾞｸｾｲ 2ｼﾞｭｳｶ ﾌｧｲﾙ          */
#define		TFMTNFIP	0x10	/* FMTﾌｧｲﾙｿﾞｸｾｲ FIPｶﾝﾘﾀｲｼｮｳｶﾞｲﾌｧｲﾙ   */
#define		TFMTFTYPE	0x07	/* FMTﾌｱｲﾙｿﾞｸｾｲ ﾌｱｲﾙﾀｲﾌﾟ             */
#define		TFMTETYPE	0x00	/* FMTﾌｱｲﾙｿﾞｸｾｲ ｽﾄﾘｰﾑ ｱｸｾｽ    (E)    */
#define		TFMTATYPE	0x01	/* FMTﾌｱｲﾙｿﾞｸｾｲ ｼﾞｭﾝ ﾚｺｰﾄﾞ    (A)    */
#define		TFMTBTYPE	0x02	/* FMTﾌｱｲﾙｿﾞｸｾｲ ﾁｮｸｾﾂ ﾚｺｰﾄﾞ   (B)    */
#define		TFMTCTYPE	0x03	/* FMTﾌｱｲﾙｿﾞｸｾｲ ﾗﾝﾀﾞﾏｲｽﾞ ﾎｳｼｷ (C)    */
#define		TFMTDTYPE	0x04	/* FMTﾌｱｲﾙｿﾞｸｾｲ ｷｰｹﾝｻｸ ﾎｳｼｷ   (D)    */

#define		TFMTVERR	0x80	/* FMTﾌｧｲﾙｽﾃｰﾀｽ ｼｮｳｶﾞｲﾁｭｳ            */
#define		TFMTCRT		0x40	/* FMTﾌｧｲﾙｽﾃｰﾀｽ ｿｳｾｲｽﾞﾐ              */
#define		TFMTFERR	0x20	/* FMTﾌｧｲﾙｽﾃｰﾀｽ ﾍｲｿｸﾁｭｳ              */
#define		TFMTEXTN	0x08	/* FMTﾌｧｲﾙｽﾃｰﾀｽ ﾌｧｲﾙ ｶｸﾁｮｳ ﾁｭｳ		 */
