/*********************************************************************/
/*	TGMT ŽºŽÍŽÞŽÂ ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	tgmtpsz	{
	char	tgmtcode[4];				/* Ž¸ŽÞŽÙ-ŽÌŽß Žº-ŽÄŽÞ				 */
	short	tgmtsgtp;					/* Ž¸ŽÞŽÙ-ŽÌŽß ŽÅŽ² Ž¾ŽÝŽÄŽ³ SGT Ž´ŽÝŽÄŽØ NO*/
	short	tgmtsgtn;					/* Ž¸ŽÞŽÙ-ŽÌŽß ŽÅŽ² SGT Ž´ŽÝŽÄŽØ Ž½Ž³     */
	char	tgmtname[16];				/* Ž¸ŽÞŽÙ-ŽÌŽß ŽÃŽÞŽ²ŽÚŽ¸ŽÄŽØ ŽÒŽ²         */
};
typedef	struct	tgmtpsz	TGMTPSZ;
