/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		TJCT ﾃｲｷﾞ ﾌｧｲﾙ (tjct.h)										 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ｼﾞｬ-ﾅﾙ ｾｲｷﾞｮ ﾃ-ﾌﾞﾙ											 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ｻｸｾｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ﾍﾝｺｳｼｬ : 渡邊　基樹           93/11/12                 TD-00 */
/*                (SMPﾌｱｲﾙのﾐﾗ-化に伴う変更)                   TD-53 */
/*				  (JNLｱｸｾｽ時間短縮に伴う変更)				   TD-41 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TJCT ｺﾍﾞﾂﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct	tjctpsz{
										/* SMPﾌｱｲﾙのﾐﾗ-化に伴う削除  */
										/* (2行)                TD53 */
    short   tjctfmte[2];                /* JNL用FMTｴﾝﾄﾘ番号		TD41 */
    short   tjctfmtk[2];                /* KJ用FMTｴﾝﾄﾘ番号		TD41 */
										/* SMPﾌｱｲﾙのﾐﾗ-化に伴う削除  */
										/* (2行)                TD53 */
	char	tjctyob2[2];				/* 予備2                TD53 */
	char	tjctyob1[2];				/*  ﾖﾋﾞ 1					 */
										/* 不要な項目の削除(2行)TD00 */
    long    tjctyob3;                   /* 予備3                TD00 */
	long    tjctyob4;                   /* 予備4                TD00 */

};
typedef struct	tjctpsz TJCTPSZ;

										/* SMPﾌｱｲﾙのﾐﾗ-化に伴う削除  */
										/* (2行)                TD53 */

