/*********************************************************************/
/*	TKMT ŽºŽÍŽÞŽÂ ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	tkmtpsz	{
	short	tkmtofst;					/* Ž·- ŽÉ ŽÚŽº-ŽÄŽÞ ŽÅŽ² ŽµŽÌŽ¾ŽÂŽÄ		 */
	char	tkmtattr;					/* Ž·- Ž¿ŽÞŽ¸Ž¾Ž²					 */
										/*   'C' : ŽÓŽ¼ŽÞ Ž¹Ž²Ž¼Ž·			 */
										/*   'S' : 2ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÂŽ· Ž½Ž³ŽÁ */
										/*   'U' : 2ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÅŽ¼ Ž½Ž³ŽÁ */
										/*   'L' : 4ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÂŽ· Ž½Ž³ŽÁ */
										/*   'V' : 4ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÅŽ¼ Ž½Ž³ŽÁ */
										/*   'P' : ŽÊŽßŽ¯Ž¸ Ž¹Ž²Ž¼Ž·		 */
	char	tkmtoth1;					/* ŽÖŽËŽÞ						 */
	short	tkmtleng;					/* Ž·- ŽÁŽÖŽ³					 */
	short	tkmtoth2;					/* ŽÖŽËŽÞ						 */
};
typedef	struct	tkmtpsz	TKMTPSZ;

/*********************************************************************/
/*	ŽÃŽ°ŽÌŽÞŽÙŽÅŽ² ŽºŽ°ŽÄŽÞ ŽÃŽ²Ž·ŽÞ												 */
/*********************************************************************/
#define	TKMTCTYPE	'C'					/*   'C' : ŽÓŽ¼ŽÞ Ž¹Ž²Ž¼Ž·			 */
#define	TKMTSTYPE	'S'					/*   'S' : 2ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÂŽ· Ž½Ž³ŽÁ */
#define	TKMTUTYPE	'U'					/*   'U' : 2ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÅŽ¼ Ž½Ž³ŽÁ */
#define	TKMTLTYPE	'L'					/*   'L' : 4ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÂŽ· Ž½Ž³ŽÁ */
#define	TKMTVTYPE	'V'					/*   'V' : 4ŽÊŽÞŽ²ŽÄŽÉ ŽÌŽºŽÞŽ³ŽÅŽ¼ Ž½Ž³ŽÁ */
#define	TKMTPTYPE	'P'					/*   'P' : ŽÊŽßŽ¯Ž¸ Ž¹Ž²Ž¼Ž· 		 */
