/****************************************************************************/
/*  著作権  １９９６                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/****************************************************************************/
/**********************************************************************/
/*                                                                    */
/*        TLHU ﾃｰﾌﾞﾙ ﾌｫｰﾏｯﾄ     tlhu.h      (1996.6.11)               */
/*                                                                    */
/**********************************************************************/

struct tlhupsz {
		unsigned short 	tlhuifrm;		/*Iﾌﾚｰﾑ最大長			        */
		unsigned char 	tlhuwrmx;		/*送信多重度					*/
		unsigned char 	tlhurdmx;		/*受信多重度					*/
		unsigned long 	tlhuyob1[2];	/*予備							*/
};
typedef struct  tlhupsz TLHUPSZ;
