/**********************************************************************/
/*                                                                    */
/*       TMLT ŽÃ-ŽÌŽÞŽÙ ŽÌŽ«-ŽÏŽ¯ŽÄ       tmlt.h        (63.02.01)             */
/*                                                                    */
/**********************************************************************/

struct mdmltko {
       char    tmltpuno;                       /* PU ŽÊŽÞŽÝŽºŽÞŽ³           */
       char    tmltyob0[3];                    /* ŽÖŽËŽÞ                 */
       char    tmltresv[8];                    /* ŽÖŽËŽÞ                 */
};
typedef struct mdmltko TMLTPSZ;



