/**********************************************************************/
/**                                                                  **/
/**     TPBE < ŽÍŽÞŽ°Ž¼Ž¯Ž¸ Ž¾Ž²Ž·ŽÞŽ® ŽÃŽ¼ŽÞŽ­ŽÝ  TLPH Ž¶Ž¸ŽÁŽ®Ž³Ž²Ž· Header File          **/
/**                                                                  **/
/**     File Name : tpbe.h                                           **/
/**                                                                  **/
/**********************************************************************/
/**/
/**********************************************************************/
/**     TPBE Ž»ŽÌŽÞŽ·Ž®Ž³ŽÂŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                    **/
/**********************************************************************/
/**/
struct  tpbesub {
        short tpbeinen;                     /* Ž²ŽÆŽ¼Ž¬ŽÙ ŽÍŽÝŽºŽ³ ŽºŽÍŽÞŽÂŽÌŽÞ Ž¾ŽÝŽÄŽ³ */
        short tpbersv0;                     /* ŽÖŽËŽÞ 0                 **/
};
typedef struct tpbesub TPBESUB;
/**/
/**********************************************************************/
/**     TPBE ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                        **/
/**********************************************************************/
/**/
struct  tpbepsz {
        char  tpbeschr;                     /* Ž¿Ž³Ž¼ŽÝŽÖŽ³  Ž·Ž¬Ž×Ž¸ŽÀ Ž½Ž³      **/
        char  tpbessqs[11];                 /* Ž¿Ž³Ž¼ŽÝŽÖŽ³  ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½   **/
        char  tpberchr;                     /* Ž¼ŽÞŽ­Ž¼ŽÝŽÖŽ³ Ž·Ž¬Ž×Ž¸ŽÀ Ž½Ž³      **/
        char  tpbersqs[11];                 /* Ž¼ŽÞŽ­Ž¼ŽÝŽÖŽ³ ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½   **/
};
typedef struct tpbepsz TPBEPSZ;


