/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		TPBT ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (tpbt.h)										 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß ŽÌŽÞŽÂŽØ ŽÎŽÞŽØŽ­-ŽÑ Ž¶ŽÝŽØ ŽÃ-ŽÌŽÞŽÙ								 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž²Ž¼Ž¬ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ»											 */
/*		Ž»Ž¸Ž¾Ž²Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ											 */
/*		ŽÍŽÝŽºŽ³Ž¼Ž¬ : ÅÏî´¡¡´ð¼ù          93/11/12  TD-00                 */
/*                (SCSIŽØŽ¾ŽÂŽÄµ¡Ç½¤ÎÊÑ¹¹¤ËÈ¼¤¦ÊÑ¹¹)   TD-61             */
/*				 ÀÖÄÍ¡¡°ì¸µ			 95/04/11	CT1039(ST2764)		 */
/*		ÊÑ¹¹¼Ô : º£°æ¡¡¹°¹¬				 95/12/26  TD-N1			 */	
/*                (ŽÏŽÆŽ­Ž±ŽÙ·¿¸÷ŽÃŽÞŽ¨Ž½Ž¸ÄÉ²Ã¤ËÈ¼¤¦ÊÑ¹¹)					 */
/* ¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£·Ç¯  £··î£²£´Æü	SSCY0199 */
/*			   ¡Ê¥Ð¥Ã¥¯¥¢¥Ã¥×¤Î£³¡¥£µ¥¤¥ó¥Á£Í£ÏÂÐ±þ¡Ë				 */
/* ¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£¹Ç¯  £³·î£³£±Æü	SPCY0146 */
/*			   ¡Ê¥Ð¥Ã¥¯¥¢¥Ã¥×¤Î£¶£´£°£Í¡¡£Í£ÏÂÐ±þ¡Ë					 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TPBT ŽºŽÍŽÞŽÂ ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	tpbtpsz {
	char	tpbttype;					/* Ž¿Ž³ŽÁ Ž¼ŽÕŽÍŽÞŽÂ				 */
	char	tpbturae;					/* Î¢ÌÌPBTŽ´ŽÝŽÄŽØÈÖ¹æ	    TD@1 */
	char	tpbtyob2;					/* ŽÖŽËŽÞ						 */
	char	tpbtpuno;					/* PU ŽÊŽÞŽÝŽºŽÞŽ³ 				 */
	short	tpbtvbte;					/* ŽÌŽÞŽÂŽØ VOL Ž¾ŽÝŽÄŽ³ VBT Ž´ŽÝŽÄŽØ	 */
	char	tpbtacci;					/* ACC Ž¼ŽÞŽ®Ž³ŽÎŽ³				 */
	char	tpbtyob4;					/* ŽÖŽËŽÞ						 */
	char	tpbtvnam[8];				/* ŽÌŽÞŽÂŽØ ŽÎŽÞŽØŽÕ-ŽÑ Ž¼Ž·ŽÍŽÞŽÂ ŽÒŽ²		 */
	char	tpbtfnam[32];				/* Ž¿Ž³ŽÁ ŽÄŽ¸Ž¼ŽÕ ŽÌŽ±Ž²ŽÙ ŽÒŽ²			 */
	char	tpbttyno[8];				/* Ž¶ŽÀŽÊŽÞŽÝ 					 */
	short	tpbtsurp;					/* £Ó£Õ£Ò¥¨¥ó¥È¥êÈÖ¹æ   TD61 */
	short	tpbtsura;					/* SUR¥¨¥ó¥È¥êÈÖ¹æ(ACC)	 	 */
										/*		CT1039				 */
	char	tpbtyob6[8];				/* ŽÖŽËŽÞ						 */
	long	tpbtyob7;					/* ŽÖŽËŽÞ						 */
	char	tpbtyob8[4];				/* ŽÖŽËŽÞ						 */
	char	tpbtndir[16];				/* ŽÈŽ¯ŽÄŽÜ-Ž¸ ŽÃŽÞŽ¨ŽÚŽ¸ŽÄŽØ ŽÒŽ²		 */
	char	tpbtdivi[64];				/* ŽÎŽÞŽØŽ­Ž°ŽÑ ŽÌŽÞŽÝŽ¶ŽÂ Ž¼ŽÞŽ®Ž³ŽÎŽ³		 */
	char	tpbtyob9[16];				/* Í½È÷                 TD@1 */
};
typedef	struct	tpbtpsz	TPBTPSZ;

/*********************************************************************/
/*	Ž¿Ž³ŽÁ Ž¼Ž®ŽÍŽÞŽÂ ( tpbttype ) ŽÉ ŽÃŽ²Ž·ŽÞ									 */
/*********************************************************************/
#define		TPBTDISK	'D'				/* ¸ÇÄêŽÃŽÞŽ¨Ž½Ž¸			TD61 */
#define		TPBTODISK	'5'				/* ¸÷ŽÃŽÞŽ¨Ž½Ž¸(5Ž²ŽÝŽÁ)		TD61 */
#define		TPBTMDISK	'3'				/* ¸÷ŽÃŽÞŽ¨Ž½Ž¸(3.5Ž²ŽÝŽÁ)	SSCY0199 */
#define		TPBTNDISK	'N'				/* ŽÏŽÆŽ­Ž±ŽÙ·¿¸÷ŽÃŽÞŽ¨Ž½Ž¸(MD)	TDN1 */
#define		TPBT6MODISK	'6'				/* 640M MOŽÃŽÞŽ¨Ž½Ž¸(MC)	SPCY0146 */

/*********************************************************************/
/*	ACC Ž¼ŽÞŽ®Ž³ŽÎŽ³ ( tpbtacci ) ŽÉ ŽÃŽ²Ž·ŽÞ									 */
/*********************************************************************/
#define		TPBTACC		0x01			/* ACC ŽÂŽ· ŽÃŽÞŽ¨Ž½Ž¸				 */
#define		TPBTNOACC	0x00			/* ACC ŽÅŽ¼ ŽÃŽÞŽ¨Ž½Ž¸				 */
