/*--------------------------------------------------------------------------*/
/*¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä					±¿Å¾´ÉÍý¶ÈÌ³							*/
/*¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä															*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä														*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜ£É£Ä¡ä														*/
/*¡ã¥â¥¸¥å¡¼¥ëÌ¾¡ä					£Ô£Ð£Ã£Ô¥Æ¡¼¥Ö¥ë						*/
/*¡ã¥â¥¸¥å¡¼¥ë£É£Ä¡ä														*/
/*¡ã¥â¥¸¥å¡¼¥ëÄÌÈÖ¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ãÅ¬ÍÑµ¡¼ï¡ä						£Á£Ã£Å									*/
/*¡ãÅ¬ÍÑ£Ï£Ó¡ä						£Ô£Ò£Á£Ä£Å								*/
/*¡ã³«È¯´Ä¶­¡ä						£Ó£Õ£Î¡¡£Ó£Ð£Á£Ò£Ã¡Ý£É£Ð£Ø				*/
/*¡ãµ­½Ò¸À¸ì¡ä						£Ã¸À¸ì									*/
/*¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä				¹½Â¤ÂÎ									*/
/*¡ãµ¡Ç½¶èÊ¬¡ä																*/
/*¡ãÂÐ¾Ý¥Ç¡¼¥¿¡ä															*/
/*¡ã¹©Äø¡¦³¬ÁØ¶èÊ¬¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä				£Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à					*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä				£µ£·£²£¶£°£±£´£°£²£±£°£°				*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯Ã´ÅöÌ¾¡ä					±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö						*/
/*¡ãÅÅÏÃÈÖ¹æ¡ä						169-3537(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/*¡ãÀß·×¼ÔÌ¾¡ä						£Ô£Ä£Ã¡¡ÀÖÄÍ¡¡°ì¸µ						*/
/*¡ãÀß·×Ç¯·îÆü¡ä					£±£¹£¹£³Ç¯£±£±·î¡¡£¸Æü					*/
/*¡ãÀß·×½¤Àµ¼ÔÌ¾¡ä															*/
/*¡ãÀß·×½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*--------------------------------------------------------------------------*/
/*¡ã¥½¡¼¥¹ºîÀ®¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡Á°Âô¡¡¹¸						*/
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				£±£¹£¹£³Ç¯£±£±·î£±£°Æü					*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡ÀÖÄÍ¡¡°ì¸µ						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*									'94/05/10					ST0079		*/
/*									'94/12/13					ST1223		*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä				£Î£Ô£Ô¡Ý£Ä¡¡µÜÏÆ¡¡¿­					*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  '95/03/13					SM01		*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä                Com'App ¹â¶¶							*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä  £±£¹£¹£·Ç¯  £¶·î£±£±Æü		SSCY0197 	*/
/*	¡Ê¥×¥í¥»¥¹¥­¥ã¥ó¥»¥ëÄÉ²Ã¤Ë¤è¤ë  ¥­¥ã¥ó¥»¥ëÉÔ²Ä¥Õ¥é¥°ÄÉ²Ã¡Ë				*/
/*--------------------------------------------------------------------------*/
/*¡ã¸«ÀÑ¥¹¥Æ¥Ã¥×¡ä															*/
/*--------------------------------------------------------------------------*/
/*¡ãµ¡Ç½³µÍ×¡ä																*/
/*--------------------------------------------------------------------------*/
/*¡ã¸Æ½Ð·Á¼°¡ä																*/
/*¡ã²¾°ú¿ô¡ä																*/
/*¡ãÊÖµÑÃÍ¡ä																*/
/*--------------------------------------------------------------------------*/
/*¡ãÆþ½ÐÎÏ¥Ç¡¼¥¿¹½Â¤¡ä														*/
/*¡ãÀ©¸Â»ö¹à¡ä																*/
/*		£Ã£Í¥Æ¡¼¥Ö¥ë¤Ç¤¢¤ë¡£												*/
/*		£Ô£Ö£Ã£Ô¤Î¥¹¥Æ¡¼¥¿¥¹¤Ï°Ê²¼¤ÎÄÌ¤ê¤Ç¤¢¤ë¡£							*/
/*			­¡£Ó£Í£Ð¡¿£Á£Ð¤Î½êÂ°			£Ó£Í£Ð¥Æ¡¼¥Ö¥ë					*/
/*			­¢£Ò£Â£É¼èÆÀÉÔÍ×¡¿Í×			ÉÔÍ×							*/
/*			­£»²¾È¡¿¹¹¿·					¹¹¿·¥Æ¡¼¥Ö¥ë					*/
/*			­¤ÇÓÂ¾ÉÔÍ×¡¿Í×					ÇÓÂ¾ÉÔÍ×						*/
/*			­¥¸ÄÊÌÉôÇÓÂ¾¡¿Á´ÂÎÇÓÂ¾			¡Ê°ÕÌ£¤Ê¤·¡Ë					*/
/*			­¦£Ê£Î£Ì¼èÆÀÃ±°Ì¸ÄÊÌÉô¡¿¹àÌÜ	¡Ê°ÕÌ£¤Ê¤·¡Ë					*/
/*¡ã»ÈÍÑ³°Éô¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*¡ã¸Æ½Ð¸µ¤Î¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:														*/
/*¥×¥í¥»¥¹Ì¾		:£Á£Ð¥×¥í¥»¥¹											*/
/*²þÂ¤ÈÖ¹æ			:PRC-025-01												*/
/*²þÂ¤ÆâÍÆ			:¥¹¥ï¥Ã¥×¥¢¥¦¥È¶Ø»ß»ÅÍÍÊÑ¹¹ÂÐ±þ     					*/
/*²þÂ¤Æü			:2002.10.21												*/
/*²þÂ¤¼Ô			:supply Taguchi											*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:												 		*/
/*¥×¥í¥»¥¹Ì¾		:£Á£Ð¥×¥í¥»¥¹									 		*/
/*²þÂ¤ÈÖ¹æ			:PRC-031-01										 		*/
/*²þÂ¤ÆâÍÆ			:¹àÌÜÌ¾¾Î¤òÌÜÅª¤Ë±è¤Ã¤¿Ì¾¾Î¤Ë½¤Àµ     			 		*/
/*²þÂ¤Æü			:2002.11.07										 		*/
/*²þÂ¤¼Ô			:supply Taguchi									 		*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:												 		*/
/*¥×¥í¥»¥¹Ì¾		:£Á£Ð¥×¥í¥»¥¹									 		*/
/*²þÂ¤ÈÖ¹æ			:PRC-014-01										 		*/
/*²þÂ¤ÆâÍÆ			:£á£ð£í£á£é£îÀè¹Ô½èÍý¥Õ¥é¥°ÄÉ²Ã     			 		*/
/*²þÂ¤Æü			:2003.01.07										 		*/
/*²þÂ¤¼Ô			:supply Taguchi									 		*/
/****************************************************************************/
/****************************************************************************/
/*¥×¥í¥¸¥§¥¯¥ÈÌ¾	:														*/
/*¥×¥í¥»¥¹Ì¾		:¥Þ¥¹¥¿¥¹¥±¥¸¥å¡¼¥é										*/
/*²þÂ¤ÈÖ¹æ			:PRC-040-14												*/
/*²þÂ¤ÆâÍÆ			:½ªÎ»·Àµ¡¥×¥í¥»¥¹¼ïÊÌ									*/
/*²þÂ¤Æü			:2003.02.14												*/
/*²þÂ¤¼Ô			:supply K.Fujii											*/
/****************************************************************************/
/****************************************************************************/
/*»ÅÍÍÊÑ¹¹ÈÖ¹æ		:SSLA0029												*/
/*½¤ÀµÆâÍÆ			:¥¹¥ï¥Ã¥×¼ïÊÌ¤ÎÄÉ²Ã										*/
/*½¤ÀµÆü			:2003.06.02												*/
/*½¤Àµ¼Ô			:supply Sugawara										*/
/****************************************************************************/
/****************************************************************************/
/*	£Ô£Ð£Ã£Ô¥µ¥Ö¶¦ÄÌÉô														*/
/****************************************************************************/
struct  tpctsub {
    long  tpctopn;                      /* ¥ª¥ó¥é¥¤¥ó¥×¥í¥»¥¹¿ô				*/
    long  tpctenp;                      /* µ¯Æ°¥×¥í¥»¥¹¿ô					*/
    long  tpctsm;                       /* ¥»¥Þ¥Õ¥©¼±ÊÌ»Ò					*/
    char  tpctdry[32];                  /* ¥Ç¥£¥ì¥¯¥È¥êÌ¾					*/
    short tpctreio;                     /* ÂåÉ½Ã¼Ëö¥×¥í¥»¥¹ÈÖ¹æ				*/
    char  tpctsyob[2];                  /* Í½È÷								*/
	long  tpctofp0;						/* £Ð£õ£°¥ª¥Õ¥é¥¤¥ó¥×¥í¥»¥¹¸ÄÊÌÉô¿ô	*/
};
typedef  struct  tpctsub TPCTSUB;
/****************************************************************************/
/*	£Ô£Ð£Ã£Ô¸ÄÊÌÉô															*/
/****************************************************************************/
struct  tpctpsz {
    long  tpctpid;                      /* ¥×¥í¥»¥¹¼±ÊÌ»Ò					*/
    char  tpctpnm[8];                   /* ¥×¥í¥»¥¹¼±ÊÌÌ¾					*/
    long  tpctprn;                      /* ¥×¥í¥»¥¹¥é¥ó¥¯					*/
    long  tpctuid;                      /* ¥æ¡¼¥¶¼±ÊÌ»Ò						*/
    long  tpctfno;                      /* ¥Õ¥¡¥¤¥ëµ­½Ò»ÒºÇÂç¸Ä¿ô			*/
    long  tpctatr;                      /* ¥×¥í¥»¥¹Â°À­						*/
    long  tpctacc;                      /* ¥×¥í¥»¥¹¥¢¥¯¥»¥¹¸¢				*/
    long  tpctpri;                      /* µ¯Æ°»þ¥×¥í¥»¥¹Í¥ÀèÅÙ				*/
    long  tpcthpr;                      /* ÊÑ¹¹¾å¸Â¥×¥í¥»¥¹Í¥ÀèÅÙ			*/
    long  tpctcls;                      /* ÏÀÍý¶õ´Ö¤Î¥µ¥¤¥º					*/
	short tpcttabo;						/* ¥¿¥¤¥à¥¹¥é¥¤¥¹ÃÍ			TD96	*/
    short tpctrno;                      /* ¥ê¥¯¥¨¥¹¥È¼±ÊÌ»ÒºÇÂç¸Ä¿ô			*/
    char  tpctpfn[16];                  /* ¥×¥í¥°¥é¥à¥Õ¥¡¥¤¥ëÌ¾				*/
    long  tpctpmb;                      /* ¥×¥í¥»¥¹´ÖÄÌ¿®¥á¥¤¥ë¥Ü¥Ã¥¯¥¹¼±ÊÌ»Ò*/
    long  tpctnmb;                      /* Í½È÷¡Ê¥á¥¤¥ë¥Ü¥Ã¥¯¥¹¼±ÊÌ»Ò¡Ë		*/
    long  tpctsmi;                      /* ¥»¥Þ¥Õ¥©¼±ÊÌ»Ò					*/
    char  tpctkcl;                      /* µ¯Æ°¸µ¥Ö¥í¥Ã¥¯ÈÖ¹æ				*/
    char  tpctheis;						/* ÊÄºÉ°ÍÍêÍ×¡¿ÉÔÍ×					*/
    char  tpcthinf;						/* ÊÄºÉ´°Î»¾ðÊó						*/
    char  tpctflg;     	                /* ¥×¥í¥»¥¹»Ø¼¨¥Õ¥é¥°				*/
    char  tpctonm[8];                   /* µ¯Æ°¸µ¥×¥í¥»¥¹¼±ÊÌÌ¾				*/
    char  tpctsts;                      /* ¥×¥í¥»¥¹¾õÂÖ						*/
    char  tpctpuno;                     /* £Ð£ÕÈÖ¹æ							*/
    char  tpcthotf;                     /* ¥Û¥Ã¥È¥¹¥¿¥ó¥Ð¥¤·ÏÀÚÂØ¤¨»þ		*/
										/*	·ÏÀÚÂØÄÌÃÎÍ×¡¿ÉÔÍ×¾ðÊó			*/
    char  tpctmflg;                     /* ¥á¥Ã¥»¡¼¥¸°ú·ÑÍ×¡¿ÉÔÍ×¾ðÊó ST1223*/
    char  tpcttyp[4];                   /* ¥×¥í¥°¥é¥à¼ïÊÌ					*/
    long  tpctpkn;                      /* ¥×¥í¥°¥é¥à¸ÄÊÌÈÖ¹æ				*/
    char  tpctgrn[2];                   /* ¥°¥ë¡¼¥×Ì¾						*/
    char  tpctsgn[2];                   /* ¥µ¥Ö¥°¥ë¡¼¥×Ì¾					*/
    long  tpctecd;                      /* ½ªÎ»¥³¡¼¥É						*/
    long  tpctdtl;                      /* ¾ÜºÙ¾ðÊó							*/
	long  tpctadd;						/* ¥×¥í¥»¥¹½ªÎ»»þ¤ÎÉÕ²Ã¾ðÊó			*/
    char  tpctabt;                      /* ¥¢¥Ü¡¼¥È»þ¤Î½èÍý					*/
    char  tpctpst;                      /* ¥×¥í¥»¥¹³«»Ï¶èÊ¬					*/
    short tpctjnl;                      /* £Ê£Î£Ì½é´ü³ÍÆÀ¥Ð¥Ã¥Õ¥¡¥µ¥¤¥º		*/
    long  tpctsno;                      /* ¥×¥í¥»¥¹µ¯Æ°°ÍÍêÄÌÈÖ				*/
    short tpctatsu;						/* Æ±»þÊÔ½¸²ÄÇ½°¸Àè¿ô				*/
    char  tpctotyp[2];					/* ¥×¥í¥°¥é¥à¼ïÊÌ¡Ê£Ð£Ó£Å£Ã£ÔÀßÄê¡Ë	*/
	short tpctant;						/* £Ô£Á£Â£Å¥ê¥¹¥ÈÀèÆ¬¸ÄÊÌÉôÈÖ¹æ		*/
    short tpctpatn;						/* £Ô£Ð£Á£Ô¥¨¥ó¥È¥êÈÖ¹æ				*/
    long  tpctwlg;						/* ¾ã³²²òÀÏ¥¨¥ê¥¢¤Î¥µ¥¤¥º			*/
    char  tpctdsts[2];					/* £Ä£Ã£Ð»ÈÍÑ¤Î¿§Ê¬¤±				*/
    short tpctabtn;						/* ¥¢¥Ü¡¼¥ÈÈ¯À¸²ó¿ô					*/
    long  tpctcmx;						/* °ìÈÌ¥Õ¥¡¥¤¥ë¤ÎºÇÂç¥³¥Í¥¯¥È¿ô		*/
	long  tpctexmo;						/* µ¯Æ°¸µ´Ø¿ô¼±ÊÌ					*/
	long  tpctntcn;						/* µ¯Æ°¸µ£Á£Ã£Å¥Î¡¼¥ÉÈÖ¹æ			*/
	short tpctabtm;						/* Æ±°ì¥×¥í¥»¥¹¥¢¥Ü¡¼¥È²ó¿ôµöÍÆÃÍ	*/
	char  tpctsus;						/* ¥µ¥¹¥Ú¥ó¥Éµ¯Æ°Í×¡¿ÉÔÍ×			*/
	char  tpctins;						/* £É£Î£É£Ô¡²£ÓÈ¯¹ÔÃæ¥Õ¥é¥°			*/
	char  tpctdwnf;						/* ¥·¥¹¥Æ¥à¥À¥¦¥ó²óÈò¥Õ¥é¥°			*/
	char  tpctncaf;						/* ¥­¥ã¥ó¥»¥ëÉÔ²Ä¥Õ¥é¥°		SSCY0197*/
	char  tpctswf;						/* ¥¹¥ï¥Ã¥×¥¢¥¦¥È¶Ø»ß¥Õ¥é¥° PRC-025 */
	char  tpctpap;						/* apmainÀè¹Ô½èÍý¥Õ¥é¥°     PRC-014 */
/*	char  tpctrsv3[1];					   Í½È÷				ST0079	SSCY0197*/
	long  tpctdtl2;						/* ¾ÜºÙ¾ðÊó£²						*/
	long  tpctdtl3;						/* ¾ÜºÙ¾ðÊó£³						*/
	unsigned char  tpctoflg;			/* µ¯Æ°Í×£Ó£Í£Ð¥×¥í¥»¥¹¥Õ¥é¥°		*/
	char  tpctrsv4[2];					/* Í½È÷£´					ST0079	*/
	char  tpctetyp;						/* ½ªÎ»·Àµ¡¥×¥í¥»¥¹¼ïÊÌ				*/
										/* 						 PRC-040-14 */
	char  tpctonpa[32];					/* µ¯Æ°¥Ñ¥é¥á¥¿						*/
	long  tpctonod;						/* ¼«£Á£Ã£Å¥Î¡¼¥ÉÈÖ¹æ				*/
	long  tpctwlgs;						/* ¾ã³²²òÀÏ¥¨¥ê¥¢(SMPÍÑ)¤Î¥µ¥¤¥ºTD93*/
	long  tpctapi;						/* £Á£ÐÍÑ¥í¥°¾ðÊó				TD93*/
	unsigned short tpctplsz;			/* £Ð¥È¥ì¡¼¥¹ÎÎ°è¥µ¥¤¥º 		TD93*/
	char  tpctplst;						/* £Ð¥È¥ì¡¼¥¹¾ðÊó¼èÆÀ¥¹¥Æ¡¼¥¿¥¹ TD93*/
	char  tpcttrcn;						/* ¥È¥ì¡¼¥¹¥Õ¥¡¥¤¥ëÌ¾Ï¢ÈÖ¼èÆÀÍÑ		*/
										/* 						 PRC-031-01 */
	long  tpctplab;						/* £Ð¥È¥ì¡¼¥¹¥¢¥Ü¡¼¥ÈÍ×ÈÝ		TD93*/
	char  tpctsrsf;						/* SCP¥³¥Þ¥ó¥É¼Â¹Ô·ë²ÌÁ÷¿®ÅÅÊ¸¥Õ¥é¥°*/
										/*								TD18*/
	char  tpctdyrc;						/* £Ä£Ù£Ò£Å£ÃÂÐ¾Ý¥Õ¥é¥°			SM01*/
	short tpctecmt;						/* £Ô£Ã£Í£Ô¥¨¥ó¥È¥êÈÖ¹æ			TD12*/
};                   
typedef  struct  tpctpsz  TPCTPSZ;
  
/****************************************************************************/
/*	¥×¥í¥»¥¹¾õÂÖ(tpctsts)													*/
/****************************************************************************/
#define  TPCTNON  '0'                   /* Ì¤½èÍý							*/
#define  TPCTREQ  '1'                   /* µ¯Æ°Í×µá							*/
#define  TPCTING  '2'                   /* µ¯Æ°Ãæ							*/
#define  TPCTSUS  '3'                   /* °ì»þÄä»ßÃæ						*/
#define  TPCTEND  '4'                   /* ½ªÎ»Í×µáÃæ						*/
#define  TPCTCED  '5'                   /* ¶¯À©½ªÎ»Í×µáÃæ					*/
/****************************************************************************/
/*	ÊÄºÉ°ÍÍêÍ×¡¿ÉÔÍ×¾ðÊó(tpctheis)											*/
/****************************************************************************/
#define  TPCTHNEC 0x00					/* ÊÄºÉ°ÍÍêÍ×						*/
#define  TPCTHUEC 0x01					/* ÊÄºÉ°ÍÍêÉÔÍ×						*/
/****************************************************************************/
/*	ÊÄºÉ´°Î»¾ðÊó(tpcthinf)													*/
/****************************************************************************/
#define  TPCTHFIN 0x00					/* ÊÄºÉ´°Î»							*/
#define  TPCTHUNF 0x01					/* ÊÄºÉÌ¤´°Î»						*/
/****************************************************************************/
/*	¥Û¥Ã¥È¥¹¥¿¥ó¥Ð¥¤·ÏÀÚÂØ¤¨»þ ·ÏÀÚÂØÄÌÃÎÍ×¡¿ÉÔÍ×¾ðÊó(tpcthotf)				*/
/****************************************************************************/
#define  TPCTHOTN 0x00					/* ¥Û¥Ã¥È¥¹¥¿¥ó¥Ð¥¤ÄÌÃÎÍ×			*/
#define  TPCTHOTU 0x01					/* ¥Û¥Ã¥È¥¹¥¿¥ó¥Ð¥¤ÄÌÃÎÉÔÍ×			*/
/****************************************************************************/
/*	¥×¥í¥»¥¹»Ø¼¨¥Õ¥é¥°(tpctflg)												*/
/****************************************************************************/
#define  TPCTFLAG 0x01					/* »Ø¼¨¥Õ¥é¥°(oscrepr)				*/
/****************************************************************************/
/*	µ¯Æ°Í×£Ó£Í£Ð¥×¥í¥»¥¹¥Õ¥é¥°(tpctoflg)									*/
/****************************************************************************/
#define	 TPCTDRNE 0x01					/* µ¯Æ°Í×							*/
/****************************************************************************/
/*  ½ªÎ»·Àµ¡¥×¥í¥»¥¹¼ïÊÌ(tpctetyp)                                          */
/****************************************************************************/
#define  TPCTUSUP 0x00					/* ÄÌ¾ï¥×¥í¥»¥¹						*/
#define  TPCTSPCP 0x01					/* ÆÃÄê¥×¥í¥»¥¹						*/
#define  TPCTNOEP 0x02					/* ½ªÎ»·Àµ¡ÉÔÍ×¥×¥í¥»¥¹				*/
/****************************************************************************/
/*	µ¯Æ°¸µ´Ø¿ô¼±ÊÌ»Ò(tpctexmo)												*/
/****************************************************************************/
#define	 TPCTNCMD 0L					/*	¥³¥Þ¥ó¥É°Ê³°					*/
#define	 TPCTESCP 1L					/*	£Ó£Ã£Ð¥³¥Þ¥ó¥É					*/
#define	 TPCTEOCP 2L					/*	£Ï£Ã£Ð¥³¥Þ¥ó¥É					*/
/****************************************************************************/
/*	¥µ¥¹¥Ú¥ó¥Éµ¯Æ°Í×¡¿ÉÔÍ×(tpctsus)											*/
/****************************************************************************/
#define	 TPCTHING '0'					/*	ÉÔÍ×							*/
#define	 TPCTHSUS '1'					/*	Í×								*/
/****************************************************************************/
/*	¥á¥Ã¥»¡¼¥¸°ú·ÑÍ×¡¿ÉÔÍ×¡Êtpctmflg¡Ë										*/
/****************************************************************************/
#define	 TPCTMKNE	'1'					/*	Í×						ST1223	*/
#define	 TPCTMKNN	'0'					/*	ÉÔÍ×					ST1223	*/
/****************************************************************************/
/*	¥­¥ã¥ó¥»¥ëÉÔ²Ä¥Õ¥é¥°¡Êtpctncaf¡Ë								SSCY0197*/
/****************************************************************************/
#define	 TPCTCOFF	0x00				/*	¥­¥ã¥ó¥»¥ëÉÔ²ÄBIT OFF	SSCY0197*/
#define	 TPCTNCAN	0x70				/*	¥­¥ã¥ó¥»¥ëÉÔ²ÄBIT ON	SSCY0197*/
#define	 TPCTJNL	0x10				/*	£Ê£Î£Ì¥Õ¥¡¥¤¥ëÀêÍ­		SSCY0197*/
#define	 TPCTTDT	0x20				/*	£Ô£Ä£ÔÀêÍ­				SSCY0197*/
#define	 TPCTFEX	0x40				/*  ¥Õ¥¡¥¤¥ë³ÈÄ¥Ãæ			SSCY0197*/
/****************************************************************************/
/*	¥¹¥ï¥Ã¥×¥¢¥¦¥È¶Ø»ß¥Õ¥é¥°¡Êtpctswf¡Ë										*/
/****************************************************************************/
#define  TPCTSWNN  '0'					/* ¥¹¥ï¥Ã¥×¤¢¤ê			    SSLA0029*/
#define  TPCTSWNE  '1'					/* ¥¹¥ï¥Ã¥×¤Ê¤·				SSLA0029*/
#define  TPCTSWNU  '2'					/* ³ÎÊÝÃæ¥á¥â¥ê¥¹¥ï¥Ã¥×¤Ê¤·	SSLA0029*/
/****************************************************************************/
/*	apmainÀè¹Ô½èÍý¥Õ¥é¥°¡Êtpctpap¡Ë											*/
/****************************************************************************/
#define  TPCTPAPC  '1'                  /* ¸Æ¤Ó½Ð¤·¤¢¤ê             PRC-014 */
#define  TPCTPAPN  '0'                  /* ¸Æ¤Ó½Ð¤·¤Ê¤·             PRC-014 */
