/********************************************************************/
/**                                                                **/
/**     TPHE < DT-4831 TLPH Ž¶Ž¸ŽÁŽ®Ž³Ž²Ž· > Header FILE                  **/
/**                                                                **/
/**     File Name  :  tphe.h                                       **/
/**                                                                **/
/********************************************************************/
/**/
/********************************************************************/
/**     TPHE Ž»ŽÌŽÞŽ·Ž®Ž³ŽÂŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                  **/
/********************************************************************/
/**/
struct  tphesub {
        short tpheinen;            	       /* Ž²ŽÆŽ¼Ž¬ŽÙ ŽÍŽÝŽºŽ³ ŽºŽÍŽÞŽÂŽÌŽÞŽ¾ŽÝŽÄŽ³ */
        short tphersv0;                    /* ŽÖŽËŽÞ 0                 */
};
typedef struct tphesub TPHESUB;
/**/
/********************************************************************/
/**     TPHE ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                      **/
/********************************************************************/
/**/
struct  tphepsz {
        char  tpheschr;                    /* Ž¿Ž³Ž¼ŽÝŽÖŽ³  Ž·ŽÔŽ×Ž¸ŽÀ Ž½Ž³      */
        char  tphessqs[7];                 /* Ž¿Ž³Ž¼ŽÝŽÖŽ³  ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½   */
        char  tpherchr;                    /* Ž¼ŽÞŽÕŽ¼ŽÝŽÖŽ³ Ž·ŽÔŽ×Ž¸ŽÀ Ž½Ž³      */
        char  tphersqs[7];                 /* Ž¼ŽÞŽÕŽ¼ŽÝŽÖŽ³ ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½   */
};
typedef struct tphepsz TPHEPSZ;
