/*********************************************************************/
/**                                                                 **/
/**     TPTE < DT-1234 TLPH Ž¶Ž¸ŽÁŽ®Ž³Ž²Ž· > Header File                   **/
/**                                                                 **/
/**     File Name : tpte.h                                          **/
/**                                                                 **/
/*********************************************************************/
/**/ 
/********************************************************************/
/**     TPTE Ž»ŽÌŽÞŽ·Ž®Ž³ŽÂŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                  **/
/********************************************************************/
/**/
struct  tptesub {
        short tpteinen;          /* Ž²ŽÆŽ¼Ž¬ŽÙ ŽÍŽÝŽºŽ³ ŽºŽÍŽÞŽÂŽÌŽÞ Ž¾ŽÝŽÄŽ³ Ž´ŽÝŽÄŽØ No  */
        short tptersv0;          /* ŽÖŽËŽÞ 0                           */
};
typedef struct tptesub TPTESUB;
/**/
/*********************************************************************/
/**     TPTE ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                       **/
/*********************************************************************/
/**/
struct tptepsz {
    char  tpteschr;           /* Ž¿Ž³Ž¼ŽÝ ŽÖŽ³ ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½ ŽÕŽ³ŽºŽ³ Ž·Ž¬Ž×Ž¸ŽÀŽ° Ž½Ž³  */
    char  tptessqs[7];        /* Ž¿Ž³Ž¼ŽÝ ŽÖŽ³ ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½                 */
    char  tpterchr;           /* Ž¼ŽÞŽ­Ž¼ŽÝ ŽÖŽ³ ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½ ŽÕŽ³ŽºŽ³ Ž·Ž¬Ž×Ž¸ŽÀŽ° Ž½Ž³ */
    char  tptersqs[7];        /* Ž¼ŽÞŽ­Ž¼ŽÝ ŽÖŽ³ ŽÃŽÞŽÝŽ¿Ž³ Ž¼Ž°Ž¹ŽÝŽ½                */
};
/**/
typedef struct tptepsz TPTEPSZ;
