/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		TPVT ﾃｲｷﾞ ﾌｧｲﾙ (tpvt.h)										 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾌﾞﾂﾘ ﾎﾞﾘｭ-ﾑ ｶﾝﾘ ﾃ-ﾌﾞﾙ										 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ｽｽﾞｷ ｶｽﾞﾏｻ											 */
/*		ｻｸｾｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ (L01)									 */
/*				 (ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ ｼｮﾘ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC911		 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ 				'89/04/17 (L02)				 */
/*				 (SCSI ﾊﾞｽ ﾘｾｯﾄ ｼｮﾘ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- TC2466		 */
/*      変更者 : 渡邊　基樹              93/11/12  TD-00             */
/*                (他TC動作監視に伴う変更)         TD-01             */
/*                (ﾎﾂﾄｽﾀﾝﾊﾞｲ変更に伴う変更)        TD-02             */
/*                (SCSIﾘｾﾂﾄ機能の変更に伴う変更)   TD-61             */
/*                (ﾎﾞﾘﾕ-ﾑ閉塞単位変更に伴う変更)   TD-90             */
/*				 赤塚　一元				 95/04/11  CT1039(ST2764)	 */
/*		変更者 : 杉岡  克也				 95/11/??	ST3684			 */
/*		変更者 : 今井　弘幸				 95/12/26  TD-N1			 */	
/*                (ﾏﾆｭｱﾙ型光ﾃﾞｨｽｸ追加に伴う変更)					 */
/*																	 */
/*		変更者 : 今井　弘幸				 95/02/15  ST3754			 */	
/*                (ST3684閉塞ｽﾃｰﾀｽの削除)					 		 */
/*		変更者 : 宮脇　伸				 99/03/31  SPCY0146			 */	
/*                (640M MO追加に伴う変更)							 */
/*********************************************************************/

/*********************************************************************/
/*	TPVT ｺﾍﾞﾂ ﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct	tpvtpsz {
	char	tpvttype;					/* ｿｳﾁ ｼﾕﾍﾞﾂ				 */
	unsigned char tpvtvsta;				/* ﾎﾞﾘﾕ-ﾑ ｽﾃ-ﾀｽ				 */
	char	tpvtyob3;					/* 予備３	ST3684	ST3754	 */
	char	tpvtpuno;					/* PU ﾊﾞﾝｺﾞｳ				 */
	short	tpvtvmte;					/* ﾌﾞﾂﾘ VOL ｾﾝﾄｳ VMT ｴﾝﾄﾘ	 */
	char	tpvtacci;					/* ACC ｼﾞｮｳﾎｳ				 */
                                        /* ﾎﾞﾘﾕ-ﾑ閉塞単位の変更に伴う*/
										/* 削除(1行)            TD90 */
	char	tpvtyob1;					/* 予備１				TD@1 */
	char	tpvtvnam[8];				/* ﾌﾞﾂﾘ ﾎﾞﾘﾕ-ﾑ ｼｷﾍﾞﾂ ﾒｲ		 */
	char	tpvtfnam[32];				/* ｿｳﾁ ﾄｸｼﾕ ﾌｱｲﾙ ﾒｲ			 */
	char	tpvttyno[8];				/* ｶﾀﾊﾞﾝ 					 */
                                        /* ﾎﾞﾘﾕ-ﾑ閉塞単位の変更に伴う*/
										/* 削除(4行)            TD90 */
										/* SCSIﾘｾﾂﾄ機能の変更に伴う  */
										/* 削除(2行)            TD61 */
	short	tpvtsura;					/* SURエントリ番号(ACC) 	 */
										/*			CT1039			 */
    short   tpvtsurp;                   /* ＳＵＲエントリ番号   TD61 */
    short   tpvtsurp2;                  /* ＳＵＲエントリ番号２		 */
										/*			CT1039			 */
	short	tpvtyob2;					/* 予備						 */
	char	tpvtndb1[16];				/* ﾈﾂﾄﾜ-ｸﾃﾞｲﾚｸﾄﾘ名(他系1)    */
										/*                      TD02 */
	char	tpvtndir[16];				/* ﾈｯﾄﾜ-ｸ ﾃﾞｨﾚｸﾄﾘ ﾒｲ		 */
	char	tpvtdivi[64];				/* ﾎﾞﾘｭｰﾑ ﾌﾞﾝｶﾂ ｼﾞｮｳﾎｳ		 */
	char    tpvtndb2[16];               /* ﾈﾂﾄﾜ-ｸﾃﾞｲﾚｸﾄﾘ名(他系2)    */
										/*                      TD02 */
};
typedef	struct	tpvtpsz	TPVTPSZ;

/*********************************************************************/
/*	ｿｳﾁ ｼｮﾍﾞﾂ ( tpvttype ) ﾉ ﾃｲｷﾞ									 */
/*********************************************************************/
#define		TPVTDISK	'D'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ｺﾃｲ ﾃﾞｨｽｸ	 */
#define		TPVTMDISK	'3'				/* 3.5ｲﾝﾁ光ﾃﾞｨｽｸ		TD61 */
#define		TPVTODISK	'5'				/* 5ｲﾝﾁ光ﾃﾞｨｽｸ			TD61 */
#define		TPVTMT		'M'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ｼﾞｷ ﾃｰﾌﾟ		 */
#define		TPVTFDISK	'F'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ﾌﾛｯﾋﾟｰ ﾃﾞｨｽｸ  */
#define		TPVTNDISK	'N'				/* ﾏﾆｭｱﾙ型光ﾃﾞｨｽｸ(MD)	TDN1 */ 
#define		TPVT6MODISK	'6'				/* 640M MOﾃﾞｨｽｸ(MC)	SPCY0146 */ 

/*********************************************************************/
/*	ﾎﾞﾘｭ-ﾑ ｽﾃ-ﾀｽ ( tpvtvsta ) ﾉ ﾃｲｷﾞ								 */
/*********************************************************************/
#define		TPVTVERR	0x80			/* ﾎﾞﾘｭｰﾑｽﾃｰﾀｽ ｼｮｳｶﾞｲﾁｭｳ	 */
#define		TPVTVRCV	0x40			/* ﾎﾞﾘｭｰﾑｽﾃｰﾀｽ ﾘｶﾊﾞﾘ ﾁｭｳ	 */
#define		TPVTVVJG	0x10			/* ﾎﾞﾘｭｰﾑｽﾃｰﾀｽ VJ ｼｭﾄｸ ｽﾞﾐ 	 */

/* 削除（２行）												ST3754	 */

/*********************************************************************/
/*	ACC ｼﾞｮｳﾎｳ ( tpvtacci ) ﾉ ﾃｲｷﾞ									 */
/*********************************************************************/
#define		TPVTACC		0x01			/* ACC ﾂｷ ﾃﾞｨｽｸ				 */
#define		TPVTNOACC	0x00			/* ACC ﾅｼ ﾃﾞｨｽｸ				 */

/*********************************************************************/
/*	ｸﾛｽｺ-ﾙ ﾎﾞﾘｭ-ﾑ ｼﾞｮｳﾎｳ ( tpvtcros ) ﾉ ﾃｲｷﾞ削除(2行)           TD90 */
/*********************************************************************/

/*********************************************************************/
/*	ﾍｲｿｸ ｽﾃ-ﾀｽ ( tpvtheis ) ﾉ ﾃｲｷﾞ削除(2行)                     TD90 */
/*********************************************************************/

/*********************************************************************/
/*	ﾀｲﾑ ｱｳﾄ ﾊｯｾｲ ﾋｮｳｼﾞ ( tpvttout ) ﾉ ﾃｲｷﾞ削除(1行)             TD61 */
/*********************************************************************/
