/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		TRBT ﾃｲｷﾞ ﾌｧｲﾙ (trbt.h)										 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		RBI ｾｲｷﾞｮ ﾃ-ﾌﾞﾙ												 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ﾍﾝｺｳｼｬ : 渡邊　基樹          93/11/12       TD-00            */
/*                (LMﾃ-ﾌﾞﾙﾘｶﾊﾞﾘ機能導入に伴う変更)  TD-39            */
/*                (SMPﾌｱｲﾙのﾐﾗ-化に伴う変更)        TD-53            */
/*                (ﾊﾞｯｸｱｯﾌﾟ中ｼﾞｬｰﾅﾙ取得による変更)  TD-67            */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TRBT ｺﾍﾞﾂ ﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct	trbtpsz {
                                        /* SMPﾌｱｲﾙのﾐﾗ-化に伴う削除  */
										/* (2行)                TD53 */
	short   trbtfmte;                   /* FMTｴﾝﾄﾘ番号          TD39 */
                                        /* SMPﾌｱｲﾙのﾐﾗ-化に伴う削除  */
										/* (2行)                TD53 */
	char	trbtrsno;                   /* RBI定周期開始ｼﾞｬｰﾅﾙ通番   */
										/*                      TD67 */
    char    trbtyob2;                   /* 予備2                TD53 */
    char    trbtyob3[2];                /* 予備3                TD53 */
	char	trbtyob1[2];				/*  ﾖﾋﾞ 1					 */
                                        /* 不要な項目の削除(2行)TD00 */
    long    trbtyob4;                   /* 予備4                TD00 */
	long    trbtyob5;                   /* 予備5                TD00 */
	long	trbtbadr;					/* B ﾒﾝ ｾﾝﾄｳ ｱﾄﾞﾚｽ			 */
	long	trbtcntr;					/* ｼｭﾄｸ ｶｳﾝﾀ				 */
};
typedef	struct	trbtpsz	TRBTPSZ;

/*********************************************************************/
/*	RBI ｴﾗ- ｽﾃ-ﾀｽ ( trbtsta1 , trbtsta2 ) ﾉ ﾃｲｷﾞ					 */
/*********************************************************************/
                                        /* SMPﾌｱｲﾙのﾐﾗ-化に伴う削除  */
										/* (2行)                TD53 */

