/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		TRCT ﾃｲｷﾞ ﾌｧｲﾙ (trct.h)										 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾘｶﾊﾞﾘ ｾｲｷﾞｮ ﾃ-ﾌﾞﾙ											 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ｻｸｾｲｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ											 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ			'87/10/01	(L01)				 */
/*			 	 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｺｳﾓｸ ﾉ ｻｸｼﾞｮ) --- STC395			 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ 			'88/02/09	(L02)				 */
/*			 	 (ﾘｶﾊﾞﾘ ﾌｧｲﾙ ｿｳｾｲ･ｶｲﾌｸ ｼｮﾘ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ)            	 */
/*      変更者 : 渡邊　基樹          93/11/12    TD-00               */
/*                (SMP日付の導入に伴う変更)      TD-92               */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TRCT ｺﾍﾞﾂﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct trctpsz{
	char	trctdate[4];				/* ｳﾝﾖｳ ﾋﾂﾞｹ				 */
	char	trctcrtd[4];				/* ﾘｶﾊﾞﾘ ﾌｧｲﾙ ｿｳｾｲ ﾋﾂﾞｹ (L02)*/
										/* 予備の削除(2行)      TD00 */
										/* SMP日付 TSSTに移動 		 */
};
typedef struct	trctpsz TRCTPSZ;

