/**********************************************************************/
/*                                                                    */
/*        TRFE ŽÃŽ°ŽÌŽÞŽÙ ŽÌŽ«Ž°ŽÏŽ¯ŽÄ     trfe.h  			                  */
/*                                   							      */
/*        95.5.25 T.Yamamoto                                          */
/*                                   							      */
/**********************************************************************/
#define MAXNUM 7

struct  trfepsz {
        long    trfeercd[MAXNUM];        /* £Ò£Ã£Ö¥Õ¥¡¥¤¥ë¸Î¾ã¸¶°ø	 */
};
typedef struct  trfepsz TRFEPSZ;       	/* TRFE¸ÄÊÌÉô  		 */
