/****************************************************************************/
/*　著作権　１９９６                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/*  収容物　                                                                */
/****************************************************************************/
/*　ファイル名：ts5w.h                                                      */
/*  機能      ：ＨＣＰ-Ｓ[V5]　ＬＷＳ定義テーブル                          	*/
/*  作成日　　：１９９６年０８月０５日                                      */
/*  変更日    ：                                                            */
/****************************************************************************/
#if TS5W_INCLUDE
#else
#define TS5W_INCLUDE 1
										/*----------------------------------*/
										/* 個別部							*/
										/*----------------------------------*/
typedef struct {
	char	ts5wlwno[3];				/* LWS番号							*/
	char	ts5wrsv1;					/* 予備								*/
	short	ts5wlgno;					/* 使用LUｸﾞﾙｰﾌﾟ番号					*/
	short	ts5wrsv2;					/* 予備								*/
} TS5WPSZ;
#endif
