/****************************************************************************/
/*  著作権  １９９７                                                        */
/*            ＮＴＴデータ通信株式会社                                      */
/*              金融システム事業本部                                        */
/*  収容物  ＡＣＥ−ＳＭＰソースプログラム									*/
/****************************************************************************/
/* ＜開発システム名＞				ＡＣＥ−ＳＭＰシステム					*/
/* ＜開発システム環境＞				ＰＰ６４００２Ｔ２１１０				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					営業店システム担当						*/
/*＜電話番号＞						134-6886(03-3740-6886)					*/
/*--------------------------------------------------------------------------*/
/*＜流用元対象業務名＞				ＨＣＰ−Ｓ［Ｖ５］						*/
/*＜流用元ファイル名＞				ts5l.h									*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						営業店システム部　開発担当(ﾒｰｶｰ:KSP)	*/
/*＜設計年月日＞					１９９９年０３月１９日					*/
/*＜設計修正者＞															*/
/*＜設計修正年月日及び修正ＩＤ＞											*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者＞					営業店システム部　開発担当(ﾒｰｶｰ:KSP)	*/
/*＜ソース作成年月日＞				１９９９年０４月０１日					*/
/*＜ソース修正者＞					山口(KSP)								*/
/*＜ソース修正年月日及び修正ＩＤ＞	２００２年０２月０５日		SPCY0156	*/
/****************************************************************************/
/*																			*/
/*        TS6L ﾃｰﾌﾞﾙ ﾌｫｰﾏｯﾄ     ts6l.h      (1999.04.01)					*/
/*																			*/
/****************************************************************************/
#if TS6L_INCLUDE
#else
#define TS6L_INCLUDE 1
/*--------------------------------*/
/* サブ共通部                     */
/*--------------------------------*/
struct ts6lsub {
				long	ts6lwait;       /* 送信系切断待ちタイマ値           */
				long	ts6lrspt;       /* 未解決応答監視タイマ値           */
				long	ts6lldas;		/* LWS非活性化時応答ｾﾝｽｺｰﾄﾞ			*/
				long	ts6llkss;		/* LWS強制終了時応答ｾﾝｽｺｰﾄﾞ			*/
				long	ts6lrtos;		/* 未解決応答監視ﾀｲﾑｱｳﾄ時応答ｾﾝｽｺｰﾄﾞ*/
				long	ts6lnors;		/* readなし時応答ｾﾝｽｺｰﾄﾞ			*/
				char	ts6lclop;		/* ﾊﾟｽｸﾛｰｽﾞｵﾌﾟｼｮﾝ		SPCY0156	*/
				char    ts6lyobi[11];   /* 予備                             */
};

typedef struct ts6lsub TS6LSUB;         /* FIP ﾖｳ                           */

/*--------------------------------*/
/* 個別部                         */
/*--------------------------------*/
struct ts6lpsz {
				long	ts6lkbst;		/* 個別部ステータス					*/
				short   ts6lluno;		/* ＬＵ番号							*/
				short   ts6llugn;		/* ＬＵグループ番号					*/
				short	ts6lfahe;		/* TFAHｴﾝﾄﾘ番号						*/
				short	ts6lyob2;		/* 予備								*/
	unsigned	long	ts6lrcvs;		/* 最大受信RU長上限値				*/
	unsigned 	char	ts6lrcvp;		/* 受信WS上限値						*/
	unsigned 	char	ts6llufg;		/* LWS振り分けﾌﾗｸﾞ(0:する 1:しない)	*/
	unsigned 	char	ts6lyob3[2];	/* 予備								*/
	unsigned 	long	ts6lsnds;		/* 最大送信RU長下限値				*/
	unsigned 	short	ts6lwrmx;		/* LUﾗｲﾄ多重限度					*/
	unsigned 	short	ts6lyob4;		/* 予備								*/
				char    ts6lyob5[12];   /* 予備                             */
};

typedef struct ts6lpsz TS6LPSZ;


#define  TS6LSBSZ   (sizeof(TS6LSUB))   /* TS6Lｻﾌﾞ共通部ｻｲｽﾞ                */
#define  TS6LKOSZ   (sizeof(TS6LPSZ))   /* TS6L個別部ｻｲｽﾞ                   */

#endif
