/*********************************************************************/
/*	TSGT ŽºŽÍŽÞŽÂ ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	tsgtpsz	{
	char	tsgtcode[4];				/* Ž»ŽÌŽÞŽ¸ŽÞŽÙ-ŽÌŽß Žº-ŽÄŽÞ (ŽÊŽßŽ¯Ž¸Ž¹Ž²Ž¼Ž·) */
	short	tsgtfmtp;					/* Ž»ŽÌŽÞŽ¸ŽÞŽÙ-ŽÌŽß ŽÅŽ² Ž¾ŽÝŽÄŽ³ FMT E NO*/
	short	tsgtfmtn;					/* Ž»ŽÌŽÞŽ¸ŽÞŽÙ-ŽÌŽß ŽÅŽ² FMT Ž´ŽÝŽÄŽØ Ž½Ž³  */
	short	tsgtgmtp;					/* Ž¶ŽÞŽ²ŽÄŽ³ GMT Ž´ŽÝŽÄŽØ NO         */
	short	tsgtsgtp;					/* Ž¸ŽÞŽÙ-ŽÌŽß ŽÅŽ² Ž¼ŽÞ SGT Ž´ŽÝŽÄŽØ NO  */
	char	tsgtname[16];				/* Ž»ŽÌŽÞŽ¸ŽÞŽÙ-ŽÌŽß ŽÃŽÞŽ²ŽÚŽ¸ŽÄŽØ ŽÒŽ²      */
	short	tsgtwfno;					/* Ž»ŽÌŽÞŽ¸ŽÞŽÙŽ°ŽÌŽß ŽÅŽ² ŽÜŽ°Ž¸ŽÌŽ§Ž²ŽÙ Ž½Ž³	 */
	short	tsgtoth1;					/* ŽØŽ»ŽÞŽ°ŽÌŽÞ					 */
};
typedef	struct	tsgtpsz	TSGTPSZ;
