/*--------------------------------------------------------------------------*/
/*¡ãÂÐ¾Ý¶ÈÌ³Ì¾¡ä					±¿Å¾´ÉÍý¶ÈÌ³							*/
/*¡ãÂÐ¾Ý¶ÈÌ³£É£Ä¡ä															*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜÌ¾¡ä														*/
/*¡ã¥µ¡¼¥Ó¥¹¹àÌÜ£É£Ä¡ä														*/
/*¡ã¥â¥¸¥å¡¼¥ëÌ¾¡ä					£Ô£Ó£Ó£Ô¥Æ¡¼¥Ö¥ë						*/
/*¡ã¥â¥¸¥å¡¼¥ë£É£Ä¡ä														*/
/*¡ã¥â¥¸¥å¡¼¥ëÄÌÈÖ¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ãÅ¬ÍÑµ¡¼ï¡ä						£Á£Ã£Å									*/
/*¡ãÅ¬ÍÑ£Ï£Ó¡ä						£Ô£Ò£Á£Ä£Å								*/
/*¡ã³«È¯´Ä¶­¡ä						£Ó£Õ£Î¡¡£Ó£Ð£Á£Ò£Ã¡Ý£É£Ð£Ø				*/
/*¡ãµ­½Ò¸À¸ì¡ä						£Ã¸À¸ì									*/
/*¡ã¥â¥¸¥å¡¼¥ë·ÁÂÖ¡ä				¹½Â¤ÂÎ									*/
/*¡ãµ¡Ç½¶èÊ¬¡ä																*/
/*¡ãÂÐ¾Ý¥Ç¡¼¥¿¡ä															*/
/*¡ã¹©Äø¡¦³¬ÁØ¶èÊ¬¡ä														*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÌ¾¡ä				£Á£Ã£Å¡Ý£Ó£Í£Ð¥·¥¹¥Æ¥à					*/
/*¡ã³«È¯¥·¥¹¥Æ¥àÈÖ¹æ¡ä				£µ£·£²£¶£°£±£´£°£²£±£°£°				*/
/*--------------------------------------------------------------------------*/
/*¡ã³«È¯Ã´ÅöÌ¾¡ä					±Ä¶ÈÅ¹¥·¥¹¥Æ¥àÃ´Åö						*/
/*¡ãÅÅÏÃÈÖ¹æ¡ä						169-3537(03-5702-3573)					*/
/*--------------------------------------------------------------------------*/
/*¡ãÀß·×¼ÔÌ¾¡ä						£Ô£Ä£Ã¡¡ÀÖÄÍ¡¡°ì¸µ						*/
/*¡ãÀß·×Ç¯·îÆü¡ä					£±£¹£¹£³Ç¯£±£±·î¡¡£¸Æü					*/
/*¡ãÀß·×½¤Àµ¼ÔÌ¾¡ä															*/
/*¡ãÀß·×½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä											*/
/*--------------------------------------------------------------------------*/
/*¡ã¥½¡¼¥¹ºîÀ®¼ÔÌ¾¡ä				£Ô£Ä£Ã¡¡Á°Âô¡¡¹¸						*/
/*¡ã¥½¡¼¥¹ºîÀ®Ç¯·îÆü¡ä				£±£¹£¹£³Ç¯£±£±·î£±£°Æü					*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä			    £Ô£Ä£Ã  ¿ù²¬  ¹îÌé						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä	£±£¹£¹£µÇ¯¡¡£²·î£±£µÆü	CT0869  ST1750	*/
/*¡ã¥½¡¼¥¹½¤Àµ¼ÔÌ¾¡ä			    £Ô£Ä£Ã  ÀÖÄÍ  °ì¸µ						*/
/*¡ã¥½¡¼¥¹½¤ÀµÇ¯·îÆüµÚ¤Ó½¤Àµ£É£Ä¡ä	'95.08.11			CT1095(ST3132)		*/
/*--------------------------------------------------------------------------*/
/*¡ã¸«ÀÑ¥¹¥Æ¥Ã¥×¡ä															*/
/*--------------------------------------------------------------------------*/
/*¡ãµ¡Ç½³µÍ×¡ä																*/
/*--------------------------------------------------------------------------*/
/*¡ã¸Æ½Ð·Á¼°¡ä																*/
/*¡ã²¾°ú¿ô¡ä																*/
/*¡ãÊÖµÑÃÍ¡ä																*/
/*--------------------------------------------------------------------------*/
/*¡ãÆþ½ÐÎÏ¥Ç¡¼¥¿¹½Â¤¡ä														*/
/*¡ãÀ©¸Â»ö¹à¡ä																*/
/*		£Ã£Í¥Æ¡¼¥Ö¥ë¤Ç¤¢¤ë¡£												*/
/*		£Ô£Ö£Ã£Ô¤Î¥¹¥Æ¡¼¥¿¥¹¤Ï°Ê²¼¤ÎÄÌ¤ê¤Ç¤¢¤ë¡£							*/
/*			­¡£Ó£Í£Ð¡¿£Á£Ð¤Î½êÂ°			£Ó£Í£Ð¥Æ¡¼¥Ö¥ë					*/
/*			­¢£Ò£Â£É¼èÆÀÉÔÍ×¡¿Í×			ÉÔÍ×							*/
/*			­£»²¾È¡¿¹¹¿·					¹¹¿·¥Æ¡¼¥Ö¥ë					*/
/*			­¤ÇÓÂ¾ÉÔÍ×¡¿Í×					ÇÓÂ¾Í×							*/
/*			­¥¸ÄÊÌÉôÇÓÂ¾¡¿Á´ÂÎÇÓÂ¾			Á´ÂÎÇÓÂ¾						*/
/*			­¦£Ê£Î£Ì¼èÆÀÃ±°Ì¸ÄÊÌÉô¡¿¹àÌÜ	¡Ê°ÕÌ£¤Ê¤·¡Ë					*/
/*¡ã»ÈÍÑ³°Éô¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/*¡ã¸Æ½Ð¸µ¤Î¥â¥¸¥å¡¼¥ë£É£Ä¡ä												*/
/****************************************************************************/
/****************************************************************************/
/*	£Ô£Ó£Ó£Ô¸ÄÊÌÉô															*/
/****************************************************************************/
struct  tsstpsz {
	char  tsstsysd;                     /* ¥Ö¥í¥Ã¥¯¶èÊ¬						*/
	char  tsststd0;                     /* £Ð£Õ£°³«»Ï¶èÊ¬					*/
	char  tsststd1;                     /* £Ð£Õ£±³«»Ï¶èÊ¬					*/
	char  tsstsysc;                     /* ¥·¥¹¥Æ¥à¹½À®¾ðÊó					*/
	char  tssttmst;                     /* ½ªÎ»¥¹¥Æ¡¼¥¿¥¹					*/
	char  tsstspms;                     /* £Ó£Ð£Í¥¹¥Æ¡¼¥¿¥¹			ST0869  */
	short tsststs1;                     /* £Ò£Ã£Ö¥¹¥Æ¡¼¥¿¥¹					*/
	long  tsstrc0a;                     /* £Ã£Í¥Æ¡¼¥Ö¥ë£Ò£Â£É¼èÆÀ¥Æ¡¼¥Ö¥ë	*/
										/*	ÀèÆ¬¥ª¥Õ¥»¥Ã¥È					*/
	long  tsstrc0l;                     /* £Ã£Í¥Æ¡¼¥Ö¥ë£Ò£Â£É¼èÆÀ¥Æ¡¼¥Ö¥ë	*/
										/*	¤ÎÂç¤­¤µ						*/
	long  tsstrl0a;                     /* £Ì£Í£°¥Æ¡¼¥Ö¥ë£Ò£Â£É¼èÆÀ¥Æ¡¼¥Ö¥ë	*/
										/*	ÀèÆ¬¥ª¥Õ¥»¥Ã¥È					*/
	long  tsstrl0l;                     /* £Ì£Í£°¥Æ¡¼¥Ö¥ë£Ò£Â£É¼èÆÀ¥Æ¡¼¥Ö¥ë	*/
										/*	¤ÎÂç¤­¤µ						*/
	long  tsstrl1a;                     /* £Ì£Í£±¥Æ¡¼¥Ö¥ë£Ò£Â£É¼èÆÀ¥Æ¡¼¥Ö¥ë	*/
										/*	ÀèÆ¬¥ª¥Õ¥»¥Ã¥È					*/
	long  tsstrl1l;                     /* £Ì£Í£±¥Æ¡¼¥Ö¥ë£Ò£Â£É¼èÆÀ¥Æ¡¼¥Ö¥ë	*/
										/*	¤ÎÂç¤­¤µ						*/
	char  tsstnoi[16];					/* ÁõÃÖÈÖ¹æ¾ðÊó						*/
	char  tsstosti[16];					/* ¥Ö¥í¥Ã¥¯¾õÂÖ¾ðÊó					*/
	char  tsstchbn;						/* Âå¹Ô¸½ÍÑ·Ï¥Ö¥í¥Ã¥¯ÈÖ¹æ			*/
	char  tsstksts;						/* ¼«·ÏÀÚÂØ¤¨¾õÂÖ					*/
	short tsstsysn;						/* ¥·¥¹¥Æ¥à¹½À®¿ô					*/
	long  tsstprmd[16];					/* ¥×¥í¥°¥é¥à¥â¡¼¥É¾ðÊó				*/
	short tsstrvnd[16];					/* Á÷¿®Àè¥Î¡¼¥ÉÈÖ¹æ					*/
	long  tsstmtwt;						/* ¥á¥ó¥Æ¥Ê¥ó¥¹¥«¡¼¥Í¥ë¾ÃÌÇÂÔ¤Á		*/
										/*	¥¿¥¤¥ÞÃÍ						*/
	long  tsstspid;						/* ¥»¥Þ¥Õ¥©¼±ÊÌ»Ò					*/
	unsigned  short tsstsdy1;			/* £Ó£Í£ÐÆüÉÕ(Î©¤Á¾å¤²²ó¿ô)			*/
	unsigned  short tsstsdy2;			/* £Ó£Í£ÐÆüÉÕ(·«¤ê¾å¤²²ó¿ô)			*/
	unsigned  long  tsstsdyn;			/* £Ó£Í£ÐÆüÉÕ(ÄÌÈÖ)					*/
};
typedef  struct  tsstpsz  TSSTPSZ;

/****************************************************************************/
/*	½ªÎ»¥¹¥Æ¡¼¥¿¥¹(tssttmst)												*/
/****************************************************************************/
#define  TSSTINIT  '0'                  /* ½é´üÃÍ							*/
#define  TSSTSTOP  '1'                  /* ÅÅ¸»ÃÇ							*/
#define  TSSTQSTA  '2'                  /* Àµ¾ï½ªÎ»¸åºÆÎ©¾å¤²				*/
#define  TSSTRSTA  '3'                  /* ¥á¥â¥êºÆÎ©¾å¤²					*/
#define  TSSTRIPL  '4'                  /* ½é´üºÆÎ©¾å¤²						*/
#define  TSSTSDWN  '5'                  /* ¥·¥¹¥Æ¥à¥À¥¦¥ó					*/
#define  TSSTCHGE  '6'                  /* ·ÏÀÚÂØ¤¨							*/
/****************************************************************************/
/*	£Ò£Ã£Ö¥¹¥Æ¡¼¥¿¥¹(tsststs1)						(»ÃÄê¡Ë					*/
/****************************************************************************/
#define	TSSTSRCV	0x008000			/* ¥·¥¹¥Æ¥à¥ê¥«¥Ð¥êÃæ				*/
#define	TSSTSSR0	0x004000			/* ¥µ¥Ö¥·¥¹¥Æ¥à¥ê¥«¥Ð¥ê(pu0)Ãæ		*/
#define	TSSTSSR1	0x002000			/* ¥µ¥Ö¥·¥¹¥Æ¥à¥ê¥«¥Ð¥ê(pu1)Ãæ		*/
#define	TSSTBKUP	0x001000			/* ¥Ð¥Ã¥¯¥¢¥Ã¥×Ãæ					*/
#define	TSSTHINF	0x000800			/* £Ö£Ò£Ã£ÖÁ°½èÍýÃæ                 */
#define	TSSTVRCV	0x000400			/* ¥Ü¥ê¥å¡¼¥à¥ê¥«¥Ð¥êÃæ				*/
#define TSSTCPU1    0x000200            /* £Ð£Õ£±ÊÄºÉÃæ						*/
#define TSSTARC0    0x000100            /* Àè¹Ô¥ê¥«¥Ð¥ê(PU0)Ãæ				*/
#define TSSTARC1    0x000080            /* Àè¹Ô¥ê¥«¥Ð¥ê(PU1)Ãæ				*/
#define	TSSTIRBI	0x000040			/* £Ò£Â£É¥Õ¥¡¥¤¥ë½é´ü²½Ãæ			*/
#define	TSSTIJNL	0x000020			/* £Ê£Î£Ì¥Õ¥¡¥¤¥ë½é´ü²½Ãæ			*/
#define	TSSTIKJ		0x000010			/* £Ë£Ê¥Õ¥¡¥¤¥ë½é´ü²½Ãæ				*/
/****************************************************************************/
/*	¼«·ÏÀÚÂØ¾õÂÖ															*/
/****************************************************************************/
#define	TSSTNONE	'N'					/* ·ÏÀÚÂØÉÔÍ×						*/
#define	TSSTSTBY	'S'					/* £È£ÓÍ½È÷·ÏÂÔµ¡Ãæ					*/
#define	TSSTCING	'C'					/* £È£ÓÍ½È÷·ÏÀÚÂØÃæ					*/
#define	TSSTAFCH	'A'					/* £È£ÓÍ½È÷·ÏÀÚÂØ					*/
/****************************************************************************/
/*  £Ó£Ð£Í¥¹¥Æ¡¼¥¿¥¹¡Ê£ô£ó£ó£ô£ó£ð£í£ó¡Ë							ST0869	*/
/****************************************************************************/
#define	TSSTSPMN	0x00				/* SPMÈ¿±ÇÌ¤						*/
#define	TSSTSPMO	0x01				/* SPMÈ¿±ÇºÑ¤ß						*/
#define	TSSTSPMJ	0x02				/* SPMÈ¿±ÇºÑ¤ß¡ÊJNLŽÎŽÞŽØŽ­Ž°ŽÑ¶¯À©Ž±ŽÝŽÏŽ³ŽÝŽÄ)*/
#define	TSSTSPMA	0x04				/* SPMÈ¿±ÇÎã³°		CT1095			*/
