/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ﾌｧｲﾙﾒｲ														 */
/*		TTCT ﾃｲｷﾞ ﾌｧｲﾙ (ttct.h)										 */
/*																	 */
/*	2 ｸﾌﾞﾝ															 */
/*		ﾄﾗﾝｻﾞｸｼｮﾝ ｶﾝﾘ ﾃ-ﾌﾞﾙ											 */
/*																	 */
/*	3 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*      変更者 : 渡邊　基樹    93/11/12                     TD-00    */
/*                (LMﾃ-ﾌﾞﾙﾘｶﾊﾞﾘ導入に伴う変更)              TD-39    */
/*                (ﾌﾟﾛｾｽ最大数拡張に伴う変更)               TD-57    */
/*				  (PUの独立化に伴う変更)					TD-59	 */
/*                (ﾊﾞﾂｸｱﾂﾌﾟ中JNL取得に伴う変更)             TD-67    */
/*                (JNL・RBIの初期化に伴う変更)              TD-79    */
/*                (KJ単独ﾊﾞﾂｸｱﾂﾌﾟに伴う変更)                TD-83    */
/*                (SMP日付の導入に伴う変更)                 TD-92    */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TTCT ｺﾍﾞﾂ ﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct	ttctpsz{
							    /* SMP日付の導入に伴う削除(1行) TD92 */
    unsigned char ttctjnls[2];	/* JNLｽﾃ-ﾀｽ                     TD67 */
	unsigned char ttctkjst[2];  /* KJｽﾃ-ﾀｽ                      TD83 */
								/* 不要な項目の削除(1行)        TD00 */
	char    ttctjmax;           /* JNL面構成                    TD67 */
	char    ttctjnlm;           /* JNL使用面                    TD67 */
	short   ttctpcn;            /* PCAｴﾝﾄﾘ数				    TD@1 */
	char    ttctjmcg;           /* JNL面切替中ｽﾃｰﾀｽ             TD67 */
	unsigned char ttctrbis[3];  /* RBIｽﾃ-ﾀｽ                     TD59 */
	long    ttctijro;           /* KJｲﾝﾃﾞﾂｸｽの大きさ         		 */
	long    ttctjrn;            /* ｼﾞﾔ-ﾅﾙﾚｺ-ﾄﾞ通番           		 */
	long	ttctjro[2];			/* ｼﾞﾔ-ﾅﾙﾚｺ-ﾄﾞ ﾉ ｶｷｺﾐ ｵﾌｾﾂﾄ	    TD67 */
	long    ttctkjro[2];        /* KJﾚｺ-ﾄﾞ書き込みｵﾌｾﾂﾄ         TD42 */
    long    ttctjstt;           /* JNLﾚｺ-ﾄﾞ先頭書き込みｵﾌｾﾂﾄ 		 */
	long    ttctyob3;           /* 予備3                        TD@1 */
	char	ttctjust[8];		/* JNL運用開始時間              TD79 */
	char	ttctkust[8];		/* KJ運用開始時間               TD79 */
	char	ttctpst[128];		/* PCA ｽﾃ-ﾀｽｲｷ			        TD57 */
};
typedef	struct	ttctpsz	TTCTPSZ;

/***************************************/
/* JNLｽﾃ-ﾀｽ(ttctjnls)の定義  	  TD-67*/
/***************************************/
#define  TTCTJERR    0x80       /* JNLﾌｱｲﾙ故障中                TD67 */
#define  TTCTJEND    0x40       /* ｼﾞｬｰﾅﾙﾆｱｴﾝﾄﾞ通知済み			TD65 */

/***************************************/
/* KJｽﾃ-ﾀｽ(ttctkjst)定義          TD-83*/
/***************************************/
#define  TTCTKJERR   0x80       /* 勘定照合ﾌｱｲﾙ故障中           TD83 */

/***************************************/
/* RBIｽﾃ-ﾀｽ(ttctrbis)定義         TD-39*/
/***************************************/
#define  TTCTRBIERR  0x80       /* RBIﾌｱｲﾙ故障中				TD39 */

/***************************************/
/* ＪＮＬ面切替中ステータスの定義 TD-67*/
/***************************************/
#define  TTCTJCHING  0x01       /* 面切替中						TD67 */
#define  TTCTJCHOFF  0x00       /* 面切替中でない				TD67 */

