/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		TTDT ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (ttdt.h)										 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽÄŽ×ŽÝŽ»ŽÞŽ¸Ž¼Ž®ŽÝ ŽÀŽÞŽÐ- ŽÃ-ŽÌŽÞŽÙ										 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž²Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ											 */
/*		Ž»Ž¸Ž¾Ž²Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ											 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TTDT ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	ttdtpsz{
	char	ttdtyobi[4];				/*  ŽÖŽËŽÞ                      */
};
typedef struct	ttdtpsz TTDTPSZ;
