/*********************************************************************/
/*   TRT ŽÉ Ž²ŽÝŽ¸ŽÙ-ŽÄŽÞ ŽÌŽ±Ž²ŽÙ                                              */
/*********************************************************************/
 
/*********************************************************************/
/*   TRT Ž»ŽÌŽÞ Ž·ŽÖŽ³ŽÂŽ³ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                       */
/*********************************************************************/
 
struct  ttrtsub
{
    short  ttrtuse;                     /* Ž¼ŽÖŽ³ ŽÁŽÕŽ³ ŽºŽÍŽÞŽÂŽÌŽÞ ŽÊŽÞŽÝŽºŽÞŽ³     */
    short  ttrtemp;                     /* ŽÐŽ¼ŽÖŽ³ ŽºŽÍŽÞŽÂŽÌŽÞ ŽÊŽÞŽÝŽºŽÞŽ³        */
};
typedef  struct  ttrtsub  TTRTSUB;
 
/*********************************************************************/
/*   TRT ŽºŽÍŽÞŽÂŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²                                            */
/*********************************************************************/
 
struct  ttrtpsz
{
    short ttrtorg;                      /* ŽºŽÍŽÞŽÂŽÌŽÞ ŽÊŽÞŽÝŽºŽÞŽ³             */
    short ttrtnxt;                      /* ŽÂŽ·ŽÞ ŽÉ ŽºŽÍŽÞŽÂŽÌŽÞ ŽÊŽÞŽÝŽºŽÞŽ³       */
    char  ttrtscl;                      /* Ž·ŽÄŽÞŽ³  Ž¼ŽÕŽÍŽÞŽÂ               */
    char  ttrtrv1[3];                   /* ŽÖŽÔŽ¸ 1                     */
    char  ttrtkcl;                      /* Ž¹Ž² Ž¸ŽÌŽÞŽÝ                   */
    char  ttrtntc;                      /* NTC ŽÊŽÞŽÝŽºŽÞŽ³                */
    short ttrtpno;                      /* ŽÌŽßŽÛŽ¾Ž½ ŽÊŽÞŽÝŽºŽÞŽ³              */
    char  ttrtpnm[8];                   /* ŽÌŽßŽÛŽ¾Ž½ Ž¼Ž·ŽÍŽÞŽÂ ŽÒŽ²            */
    long  ttrtclno;                     /* ŽÌŽßŽÛŽ¾Ž½ Ž·ŽÄŽÞŽ³ Ž²Ž×Ž² ŽÂŽ³ŽÊŽÞŽÝ      */
    char  ttrttid[8];                   /* ŽÄŽ· Ž·ŽÄŽÞŽ³ Ž¼Ž·ŽÍŽÞŽÂ ŽÒŽ²          */
    char  ttrttme[4];                   /* Ž·ŽÄŽÞŽ³ Ž¼ŽÞŽºŽ¸ / Ž¶ŽÝŽ¶Ž¸ Ž¼ŽÞŽ¶ŽÝ     */
    long  ttrtcyc;                      /* Ž¶ŽÝŽ¶Ž¸ Ž¼ŽÞŽ¶ŽÝ                 */
    long  ttrtabs;                      /* Ž¿Ž³ŽÀŽ² Ž¼ŽÞŽ¶ŽÝ                 */
    char  ttrtcmd[76];                  /* ŽºŽÏŽÝŽÄŽÞ ŽÓŽ¼ŽÞŽÚŽÂ               */
};
typedef  struct  ttrtpsz  TTRTPSZ;
      
#define  TTRTCLK  0x01                  /* Ž¼ŽÞŽºŽ¸ Ž¼ŽÃŽ²                  */
#define  TTRTCYC  0x02                  /* Ž¼ŽÕŽ³Ž· Ž¼ŽÃŽ²                  */
