/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ŽÌŽ§Ž²ŽÙŽÒŽ²														 */
/*		TVBT ŽÃŽ²Ž·ŽÞ ŽÌŽ§Ž²ŽÙ (tvbt.h)										 */
/*																	 */
/*	2 Ž¸ŽÌŽÞŽÝ															 */
/*		ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß ŽÛŽÝŽØ ŽÎŽÞŽØŽ­-ŽÑ Ž¶ŽÝŽØ ŽÃ-ŽÌŽÞŽÙ								 */
/*																	 */
/*	3 ŽØŽÚŽ·															 */
/*		Ž¾Ž¯Ž¹Ž²Ž¼Ž¬ : Ž½Ž½ŽÞŽ· Ž¶Ž½ŽÞŽÏŽ»											 */
/*		Ž»Ž¸Ž¾Ž²Ž¼Ž¬ : ŽÔŽÏŽÓŽÄ ŽÕŽ³Ž¼ŽÞ											 */
/*		ŽÍŽÝŽºŽ³Ž¼Ž¬ : ŽÎŽ¼ŽÉ ŽËŽÛŽÄŽ¼			'87/11/24	(L01)				 */
/*			 	 (ŽµŽ²Ž¶Ž¹ ŽØŽ¶ŽÊŽÞŽØ Ž¶ŽÝŽÚŽÝ ŽºŽ³ŽÓŽ¸ ŽÉ Ž»Ž¸Ž¼ŽÞŽ®) --- STC395			 */
/*      ÊÑ¹¹¼Ô : ÅÏî´¡¡´ð¼ù          93/11/12    TD-00               */
/*                (JNL¡¦RBI¤Î½é´ü²½¤ËÈ¼¤¦ÊÑ¹¹)   TD-79               */
/*                (KJÃ±ÆÈŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß¤ËÈ¼¤¦ÊÑ¹¹)     TD-83				 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	TVBT ŽºŽÍŽÞŽÂ ŽÌŽÞ ŽÉ ŽºŽ³Ž¿ŽÞŽ³ŽÀŽ²											 */
/*********************************************************************/
struct	tvbtpsz {
	char	tvbtbuid[8];				/* ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽßID			TD79 */
	unsigned char tvbtbkst;  			/* ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß Ž½ŽÃ-ŽÀŽ½			 */
	unsigned char tvbtvsta;				/* ŽÎŽÞŽØŽÕ-ŽÑ Ž½ŽÃ-ŽÀŽ½				 */
	unsigned char tvbtattr;				/* ŽÎŽÞŽØŽ­Ž°ŽÑ Ž¿ŽÞŽ¸Ž¾Ž² 			 */
                                        /* Í½È÷¤Îºï½ü(1¹Ô)      TD00 */
	char    tvbtfjfg;                   /* FJÉüµì²ÄÈÝŽÌŽ×Ž¸ŽÞ       TD79 */
	short	tvbtvbte;					/* ŽÄŽÞŽ³Ž²ŽÂ ŽÌŽÞŽÂŽØ VOL Ž¼ŽÞ VBT E N */
	short	tvbtpbte;					/* Ž¶ŽÞŽ²ŽÄŽ³ ŽÌŽÞŽÂŽØ VOL PBT E N	 */
	char	tvbtvnam[8];				/* ŽÛŽÝŽØ ŽÎŽÞŽØŽÕ-ŽÑ Ž¼Ž·ŽÍŽÞŽÂ ŽÒŽ²		 */
	char	tvbtfnch[32];				/* ŽÌŽ§Ž²ŽÙŽ±ŽØ Ž·Ž¬Ž×Ž¸ŽÀ ŽÄŽ¸Ž¼Ž­ ŽÌŽ§Ž²ŽÙŽÒŽ²  */
	char	tvbtfnbl[32];				/* ŽÌŽÞŽÛŽ¯Ž¸ ŽÄŽ¸Ž¼ŽÕ ŽÌŽ±Ž²ŽÙ ŽÒŽ²		 */
	char	tvbtmntn[32];				/* ŽÏŽ³ŽÝŽÄ ŽÃŽÞŽ²ŽÚŽ¸ŽÄŽØ ŽÒŽ²			 */
	short	tvbtyob2;					/* ŽÖŽËŽÞ						 */
	short	tvbtflcb;					/* FLCB ŽºŽ½Ž³ 				 */
	short	tvbtrdsz;					/* ŽÙŽ°ŽÄ ŽÃŽÞŽ¨ŽÚŽ¸ŽÄŽØ Ž»Ž²Ž½ŽÞ 		 */
	short	tvbtmino;					/* Ž¿Ž³ŽÁ Ž¼Ž·ŽÍŽÞŽÂŽ¼ (ŽÏŽ²ŽÅ ŽÊŽÞŽÝŽºŽÞŽ³)	 */
	long	tvbtsect;					/* ŽÛŽÝŽØ Ž¾Ž¸ŽÀ ŽÁŽÖŽ³				 */
	char	tvbtfnc2[32];				/* ŽÌŽ§Ž²ŽÙŽÅŽ¼ Ž·Ž¬Ž×Ž¸ŽÀ ŽÄŽ¸Ž¼Ž­ ŽÌŽ§Ž²ŽÙŽÒŽ²  */
	long	tvbtsize;					/* ŽÎŽÞŽØŽ­Ž°ŽÑ Ž»Ž²Ž½ŽÞ				 */
};
typedef	struct	tvbtpsz	TVBTPSZ;

/*********************************************************************/
/*	ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß Ž½ŽÃ-ŽÀŽ½ ( tvbtbkst ) ŽÉ ŽÃŽ²Ž·ŽÞ								 */
/*********************************************************************/
#define		TVBTBKUP	0x80			/* ŽÊŽÞŽ¯Ž¸Ž±Ž¯ŽÌŽß Ž½ŽÃŽ°ŽÀŽ½ Ž½ŽÐ 		 */
#define		TVBTIOERR	0x40            /* I/OŽ´Ž×Ž°È¯À¸ 			TD83 */
										/* ŽÊŽÞŽÂŽ¸Ž±ŽÂŽÌŽßÌ¤(0x00)     TD00 */

/*********************************************************************/
/*	ŽÎŽÞŽØŽ­-ŽÑ Ž½ŽÃ-ŽÀŽ½ ( tvbtvsta ) ŽÉ ŽÃŽ²Ž·ŽÞ								 */
/*********************************************************************/
#define		TVBTMNT		0x80			/* ŽÎŽÞŽØŽÕŽ°ŽÑŽ½ŽÃŽ°ŽÀŽ½ ŽÏŽ³ŽÝŽÄŽÁŽ­Ž³		 */

/*********************************************************************/
/*	ŽÎŽÞŽØŽ­-ŽÑ Ž¿ŽÞŽ¸Ž¾Ž² ( tvbtattr ) ŽÉ ŽÃŽ²Ž·ŽÞ								 */
/*********************************************************************/
#define		TVBTVCHK	0x80			/* ŽÎŽÞŽØŽ­Ž°ŽÑŽ¼Ž·ŽÍŽÞŽÂŽÒŽ² ŽÁŽªŽ¯Ž¸ ŽÖŽ³	 */

