								/* 動的テーブル削除の為削除(7行) TD60*/
								/* mf_vmnt2への対応				 SM01*/
/*********************************************************************/
/*  TVMT ｺﾍﾞﾂ ﾌﾞ ﾉ ｺｳｿﾞｳﾀｲ											 */
/*********************************************************************/
struct  tvmtpsz {
								/* 動的テーブル削除の為削除(2行) TD60*/
	char	tvmttype;					/* ｿｳﾁ ｼﾕﾍﾞﾂ				 */
										/*   'D' : ｺﾃｲ ﾃﾞｨｽｸ		 */
										/*   'O' : ﾋｶﾘ ﾃﾞｨｽｸ		 */
										/*   'F' : ﾌﾛｯﾋﾟｰ ﾃﾞｨｽｸ		 */
										/*   'M' : ｼﾞｷ ﾃｰﾌﾟ			 */
	unsigned char	tvmtrvat;			/* ﾘｶﾊﾞﾘ ｿﾞｸｾｲ 				 */
										/*   1... .... ﾊﾞｯｸ ｱｯﾌﾟ ｼﾞ	 */
										/*			'1' ﾊﾞｯｸｱｯﾌﾟｽﾙ	 */
										/*			'0' ﾊﾞｯｸｱｯﾌﾟｼﾅｲ	 */
										/*   .1.. .... ﾘﾗﾝ ｼﾞ ﾉ ｼｮﾁ	 */
										/*			'1' ﾘｽﾄｱ ｽﾙ		 */
										/*			'0' ﾘｽﾄｱ ｼﾅｲ	 */
	unsigned char	tvmtattr;			/* ﾎﾞﾘﾕ-ﾑ ｿﾞｸｾｲ				 */
										/*   1... .... ｲﾆｼｴｰﾄｼﾞ ﾏｳﾝﾄ */
										/*			'1' ﾏｳﾝﾄｽﾙ		 */
										/*			'0' ﾏｳﾝﾄｼﾅｲ		 */
										/*   .1.. .... ｲﾆｼｴｰﾄｼﾞ ﾏｳﾝﾄ */
										/*				ｴﾗｰ ﾉ ｼｮﾘ	 */
										/*			'1' ｴﾗｰｼﾞ ｼｭｳﾘｮｳ */
										/*			'0' ｼｮﾘ ｿﾞｯｺｳ	 */
										/*   ..1. .... ﾛﾝﾘﾎﾞﾘｭｰﾑﾁｪｯｸ */
										/*			'1' ﾁｪｯｸ ﾖｳ		 */
										/*			'0' ﾁｪｯｸ ﾌﾖｳ	 */
										/*   ...1 .... ﾌｧｲﾙ ｸﾌﾞﾝ	 */
										/*			'1' ﾜｰｸ   ﾌｧｲﾙﾖｳ */
										/*			'0' ｲｯﾊﾟﾝ ﾌｧｲﾙﾖｳ */
										/*   .... 11.. ﾏｳﾝﾄ ﾓｰﾄﾞ	 */
										/*		   '01' ﾖﾐｺﾐ ﾃﾞ ﾏｳﾝﾄ */
										/*		   '00' ｶｷｺﾐ ﾃﾞ ﾏｳﾝﾄ */
										/*				ST1699		 */
										/*	 .... ..1. JNLﾌｧｲﾙﾎﾞﾘｭｰﾑ */
										/*	 .... ...1 RBIﾌｧｲﾙﾎﾞﾘｭｰﾑ */
	unsigned char	tvmtstat;			/* ﾎﾞﾘﾕ-ﾑ ｽﾃ-ﾀｽ				 */
										/*   1... .... ﾏｳﾝﾄ ﾌﾗｸﾞ 	 */
										/*			'1' ﾏｳﾝﾄﾁｭｳ		 */
										/*			'0' ﾐﾏｳﾝﾄ		 */
										/*   .1.. .... ﾎﾞﾘｭｰﾑ ｼｮｳｶﾞｲ */
										/*			'1' ｼｮｳｶﾞｲ ﾁｭｳ	 */
										/*			'0' ｼｮｳｶﾞｲｶﾞ ﾅｲ	 */
										/*   .... ..11 ﾏｳﾝﾄﾓｰﾄﾞ2 SM01*/
										/*		   '01' ﾖﾐｺﾐ ﾃﾞ ﾏｳﾝﾄ */
										/*		   '00' ｶｷｺﾐ ﾃﾞ ﾏｳﾝﾄ */
										/*   .... ..11 ﾖﾋﾞ			 */
	short	tvmtvmtp;					/* ﾄﾞｳｲﾂ ﾌﾞﾂﾘ VOL ｼﾞ VMT E N */
	short	tvmtmrtp;					/* MRT ｴﾝﾄﾘ番号			TD22 */
	char	tvmtspnm[16];				/* ｿｳﾁ ﾄｸｼﾕ ﾌｱｲﾙ ﾒｲ			 */
	char	tvmtmntn[16];				/* ﾏｳﾝﾄ ﾃﾞｲﾚｸﾄﾘ ﾒｲ			 */
	char	tvmtvlid[8];				/* ﾛﾝﾘ ﾎﾞﾘﾕ-ﾑ ｼｷﾍﾞﾂ ﾒｲ		 */
	long	tvmtercd;					/* ｴﾗ- ｼﾞﾖｳﾎｳ				 */
	long	tvmtsect;					/* ﾛﾝﾘ ｾｸﾀ ﾁﾖｳ				 */
	char	tvmtcsnm[16];				/* ﾌｧｲﾙｱﾘ ｷｬﾗｸﾀ ﾄｸｼｭ ﾌｧｲﾙﾒｲ	 */
	short	tvmtpvtp;					/* ﾀｲｼｮｳ PVT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ	 */
	short	tvmtvbtp;					/* ﾀｲｼｮｳ VBT ｾﾝﾄｳ ｴﾝﾄﾘ ﾊﾞﾝｺﾞｳ*/
	short	tvmtoth2;					/* ﾖﾋﾞ						 */
	short	tvmtflcb;					/* FLCB ｺｽｳ 				 */
	short	tvmtrdsz;					/* ﾙｰﾄ ﾃﾞｨﾚｸﾄﾘ  ｻｲｽﾞ		 */
	short	tvmtmino;					/* ｿｳﾁ ｼｷﾍﾞﾂｼ (ﾏｲﾅ ﾊﾞﾝｺﾞｳ)	 */
	char	tvmtcnm2[16];				/* ﾌｧｲﾙﾅｼ ｷｬﾗｸﾀ ﾄｸｼｭ ﾌｧｲﾙﾒｲ  */
	long	tvmtsize;					/* ﾎﾞﾘｭｰﾑ ｻｲｽﾞ				 */
	unsigned char	tvmtheis;			/* 閉塞ｽﾃｰﾀｽ			TD90 */
	char	tvmtcros;					/* ｸﾛｽｺｰﾙVOL情報		TD90 */
	short	tvmtfmte;					/* 故障FMTｴﾝﾄﾘ番号		TD90 */
	char	tvmtrtim[8];				/* 故障発生日付時刻		TD90 */
	char	tvmteday[4];				/* 故障発生運用日付		TD90 */
};
typedef	struct	tvmtpsz	TVMTPSZ;

/*********************************************************************/
/*  ﾃｰﾌﾞﾙ ﾅｲ ｺｰﾄﾞ ﾃｲｷﾞ												 */
/*********************************************************************/
#define		TVMTMNT		0x80			/* ﾎﾞﾘﾕｰﾑｽﾃｰﾀｽ ﾏｳﾝﾄﾁｭｳ		 */
#define		TVMTMERR	0x00			/* ﾎﾞﾘﾕｰﾑｽﾃｰﾀｽ ﾐﾏｳﾝﾄ		 */
#define		TVMTVERR	0x40			/* ﾎﾞﾘｭｰﾑｽﾃｰﾀｽ ｼｮｳｶﾞｲﾁｭｳ	 */
#define		TVMTMMOD	0x0C			/* ﾎﾞﾘﾕｰﾑｿﾞｸｾｲ ﾏｳﾝﾄﾓｰﾄﾞ		 */
#define		TVMTMT		'M'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ｼﾞｷﾃｰﾌﾟ (MT)  */
#define		TVMTDISK	'D'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ｺﾃｲ ﾃﾞｨｽｸ	 */
#define		TVMTODISK	'O'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ﾋｶﾘ ﾃﾞｨｽｸ	 */
#define		TVMTFDISK	'F'				/* ﾎﾞﾘﾕｰﾑｼﾕﾍﾞﾂ ﾌﾛｯﾋﾟｰ ﾃﾞｨｽｸ	 */
#define		TVMTMINIT	0x80			/* ｲﾆｼｴｰﾄｼﾞ ﾏｳﾝﾄ ｽﾙ			 */
#define		TVMTMTERM	0x40			/* ﾏｳﾝﾄ ｴﾗｰｼﾞ  ｼｭｳﾘｮｳ		 */
#define		TVMTVCHK	0x20			/* ﾛﾝﾘﾎﾞﾘｭｰﾑﾁｪｯｸ ﾖｳ			 */
#define		TVMTWKVOL	0x10			/* ﾜｰｸ ﾌｧｲﾙ ﾖｳ ﾎﾞﾘｭｰﾑ		 */
#define		TVMTWKFIL	0x1C			/* ﾎﾞﾘﾕｰﾑｿﾞｸｾｲ ﾜｰｸﾌｧｲﾙ(ﾁｪｯｸ) */
#define		TVMTZI		0x10			/* ﾎﾞﾘﾕｰﾑｿﾞｸｾｲ ﾜｰｸﾌｧｲﾙ(ｼﾞ)	 */
#define		TVMTTA		0x14			/* ﾎﾞﾘﾕｰﾑｿﾞｸｾｲ ﾜｰｸﾌｧｲﾙ(ﾀ)	 */
#define		TVMTVNLEN    6L	    		/* ﾎﾞﾘｭ-ﾑ ｼｷﾍﾞﾂﾒｲ ﾉ ﾅｶﾞｻ     */
#define		TVMTMNTNL	16L				/* VMTﾏｳﾝﾄﾃﾞｲﾚｸﾄﾘﾒｲ ﾉ ｵｵｷｻ   */
#define		TVMTBKUP	0x80			/* ﾘｶﾊﾞﾘｿﾞｸｾｲ ﾊﾞｯｸｱｯﾌﾟﾀｲｼｮｳ  */
#define		TVMTREST	0x40			/* ﾘｶﾊﾞﾘｿﾞｸｾｲ ﾘｽﾄｱ			 */
#define		TVMTCROSS	'C'				/* クロスコール有り		TD90 */
#define		TVMTNOCROS	' '				/* クロスコール無し		TD90 */
#define		TVMTHOWN	0x80			/* 自系閉塞完了			TD90 */
#define		TVMTHOTH	0x40			/* 他系閉塞完了			TD90 */
#define		TVMTVVJG	0x20			/* ﾎﾞﾘｭｰﾑｽﾃｰﾀｽ VJ取得済	TD90 */
