/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_peri														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ｲｼﾞﾖｳ ﾄ ﾅﾂﾀ ﾌﾟﾛｾｽ ｼﾞﾖｳﾎｳ ｦ ｺﾝｿ-ﾙ ﾆ ｼﾕﾂﾘﾖｸ ｽﾙ.				 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		prb	:   ｷﾖｳﾂｳ ｼﾞﾖｳﾎｳ ｾﾂﾃｲ ﾘﾖｳｲｷ								 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		ﾅ ｼ															 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ				'86/08/22					 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ			 	'88/04/12 (L01)				 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｼｮﾘ ﾂｲｶ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ)  --- TC1990	 */
/*		変更者 : 佐藤　亘				"93/11/24					 */
/*				 (他TC動作監視による変更)					TD-01	 */
/*				 (ログの見直しに伴う修正)					TD-50	 */
/*				 (終了コードの拡張に伴う変更)				TD-64	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:KL0004 										 */
/*改造内容			:TABP関連情報削除漏れ							 */
/*改造日			:2003.02.19										 */
/*改造者			:								 */
/*********************************************************************/

/*********************************************************************/
/*  ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
/*********************************************************************/
/*	KL0004  修正 START 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
/*********************************************************************/
/*	KL0004  修正 END 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
#include	"tsst.h"
#include	"tbpt.h"
#include	"tsrt.h"
#include	"tpct.h"
#include	"tcst.h"
#include	"mopcb.h"
#include	"psect.h"
#include	"mrprcv.h"
#include	"mrmsg.h"
#include	"mcdebug.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*  ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘﾖｳｲｷ												 */
/*********************************************************************/
extern	PSCPSECT	pscparea;
extern	MOPSCPCB	*mopcbp;

/*********************************************************************/
/*	ﾃﾞﾌｧｲﾝ ﾁ 														 */
/*********************************************************************/
#define	MRWLOG	pscparea.pscobaad							/* (L01) */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_PERI	0x6d725f70,0x65726920

void	mr_peri(prb)
register	MRPRB	*prb;
{
	/*****************************************************************/
	/*  mr_peri ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	ms_wtop();
	long	mc_copy();
	long	mc_ccpy();
	long	mc_hccn();
	void	mo_wlg4();					/* 障害解析情報取得(L01)TD50 */

	/*****************************************************************/
	/*  ﾜ-ｸ ｴﾘｱ ﾉ ﾃｲｷﾞ												 */
	/*****************************************************************/
	register	char	*cp;			/* ﾜ-ｸ ﾎﾟｲﾝﾀ				 */
				long	len;			/* ﾘﾀ-ﾝ ｺ-ﾄﾞ ｶｸﾉｳ ｴﾘｱ		 */
				char	buf[51+sizeof(pscparea.pscprsnm)];	/*	TD64 */
										/* ｼｭﾂﾘｮｸ ﾒｯｾ-ｼﾞ ﾍﾝｼｭｳ ｴﾘｱ	 */
				long	mrlog[1];		/* ﾛｸﾞ ﾍﾝｼｭｳ ﾘｮｳｲｷ(L01)	TD50 */
				long	work_1	;		/* WORK	1					*/
				long	work_2	;		/* WORK	2					*/
				long	work_3	;		/* WORK	3					*/
				long	work_4	;		/* WORK	4					*/

	PRINT0("mr_peri() : START\n");
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = (long)prb;				/*					   (L01) */
	mo_wlg4(MR_PERI,WINSC,mrlog,4L);	/*			   	  (L01) TD50 */

	/*****************************************************************/
	/*  ｼｽﾃﾑ ｺﾝｿ-ﾙ ﾍ ｲｼﾞﾖｳ ｼﾞﾖｳﾎｳ ｦ ｼﾕﾂﾘﾖｸ ｽﾙ						 */
	/*****************************************************************/
	cp = buf;
	if ((mopcbp->mopssstp->tsstsysc) == 'C') {		/*			TD01 */
		if ((mopcbp->mopssstp->tsstsysd) == 'F' &&	/*			TD01 */
			(mopcbp->mopssstp->tsstchbn) == ' ') {	/*			TD01 */
			mc_copy(MRMSG03,cp,4L);		/* ﾒｯｾｰｼﾞIDの設定 ST0059TD01 */
		}								/*						TD01 */
		else {							/*						TD01 */
			mc_copy(MRMSG02,cp,4L);		/* ﾒｯｾ-ｼﾞIDの設定 ST0059TD01 */
		}								/*						TD01 */
	}									/*						TD01 */
	else {								/*						TD01 */
		if ((mopcbp->mopssstp->tsstsysd) == 'F') {	/*			TD01 */
			mc_copy(MRMSG03,cp,4L);		/* ﾒｯｾ-ｼﾞIDの設定 ST0059TD01 */
		}								/*						TD01 */
		else {							/*						TD01 */
			mc_copy(MRMSG02,cp,4L);		/* ﾒｯｾ-ｼﾞIDの設定 ST0059TD01 */
		}								/*						TD01 */
	}									/*						TD01 */

	cp += 4;
	*cp++ = '\t';						/* ｸｷﾞﾘ ﾓｼﾞ (TAB) ﾉ ｾｯﾃｲ	 */
	len = mc_ccpy(pscparea.pscprsnm,cp,(long)sizeof(pscparea.pscprsnm));
										/* ﾌﾟﾛｾｽ ｼｷﾍﾞﾂ ﾒｲ ﾉ ｾｯﾃｲ	 */
	cp += len;
	*cp++ = '\t';						/* ｸｷﾞﾘ ﾓｼﾞ (TAB) ﾉ ｾｯﾃｲ	 */
	mc_hccn((char *)&pscparea.pscprsid,cp,8L);

	cp += 8;
	*cp++ = '\t';						/* ｸｷﾞﾘ ﾓｼﾞ (TAB) ﾉ ｾｯﾃｲ	 */
	work_1 = htonl( prb->mrprabc ) ;	/* SR0003 バイト反転対追加   */
	mc_hccn((char *)&work_1,cp,8L);

	cp += 8;
	*cp++ = '\t';						/* ｸｷﾞﾘ ﾓｼﾞ (TAB) ﾉ ｾｯﾃｲ	 */
	work_2 = htonl( prb->mrprabd ) ;	/* SR0003 バイト反転対追加   */
	mc_hccn((char *)&work_2,cp,8L);

	cp += 8;
	*cp++ = '\t';											/*	TD64 */
	work_3 = htonl( prb->mrprabd2 ) ;	/* SR0003 バイト反転対追加   */
	mc_hccn((char *)&work_3,cp,8L);							/*	TD64 */

	cp += 8;												/*	TD64 */
	*cp++ = '\t';											/*	TD64 */
	work_4 = htonl( prb->mrprabd3 ) ;	/* SR0003 バイト反転対追加   */
	mc_hccn((char *)&work_4,cp,8L);						/*	TD64 */

	cp += 8;												/*	TD64 */
	*cp = '\0';
	PRINT0("mr_peri() : goto ms_wtop\n");
	ms_wtop(buf,(short)(cp-buf),MRMSGFOM,MROUTPTN,MRATGRUP,MRATSUBN);
	PRINT0("mr_peri() : return ms_wtop\n");

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mo_wlg4(MR_PERI,WOTSC,(long *)0,0L);/*				  (L01) TD50 */
	PRINT0("mr_peri() : END\n");
	return;
}
