/**************************** NTC-SMP-RCV ****************************/
/*																 	 */
/*	1 ｻﾌﾞﾊﾟｯｹｰｼﾞ													 */
/*		RCV															 */
/*																 	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		その他の提供関数										 	 */
/*																 	 */
/*	3 ｶﾝｽｳ ﾒｲ													 	 */
/*		mr_cpca										       TD-00	 */
/*																 	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		PCAｽﾃｰﾀｽ ﾉ ﾋﾞｯﾄ ｦ ｵﾝ/ｵﾌ ｽﾙ									 */
/*																 	 */
/*	5 ﾊﾟﾗﾒｰﾀ														 */
/*		pctno	: 	該当PCTｴﾝﾄﾘ番号 					   TD-00	 */
/*		mode	:	ｼｮﾘ	ｼｭﾍﾞﾂ										 */
/*					 MRCJNLON : ｵﾝ									 */
/*					 MRCJNLOFF: ｵﾌ									 */
/*																 	 */
/*	6 ﾍﾝｷｬｸﾁ														 */
/*		MRNORMAL	:	ｾｲｼﾞｮｳ										 */
/*		MRNOMEM		: 	ﾒﾓﾘｨ ﾌﾞｿｸ									 */
/*		MRENQERR	:	ENQ ｴﾗｰ										 */
/*		MRIVPARM	: 	ﾊﾟﾗﾒﾀ ｴﾗｰ									 */
/*		MCEOSERR	:	TRADE ｼｽﾃﾑｺｰﾙ ｴﾗｰ			   	   TD-00	 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		 ｾｯｹｲｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*		 ｻｸｾｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ 				'86/06/18					 */
/*		 ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'					 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者	: 渡邉 基樹				'93/12/22					 */
/*														   TD-@1	 */	
/*														   TD-00	 */
/*				 (ログの見直しに伴う修正)				   TD-50	 */
/*				 (ﾌﾟﾛｾｽ最大数拡張に伴う修正)			   TD-57	 */
/*＜ソース修正者名＞                Com'App 高橋					 */
/*＜ソース修正年月日及び修正ＩＤ＞  １９９７年  ６月１１日 SSCY0197  */
/*	（プロセスキャンセル追加によるキャンセル不可フラグＯＮ／ＯＦＦ） */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-034-01										 */
/*改造内容			:NOP対応	リターンコードに正常値を設定し不要	 */
/*								となったロジックは削除する			 */
/*改造日			:2002.10.18										 */
/*改造者			:Χ								 */
/*********************************************************************/
/*********************************************************************/
/*	PRC-034-01  修正 START 											 */
/*  NOP対応															 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙｰﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
#include	"mr.h"						/* 返却値の引数定義			 */	/* PRC-034-01 */
/*********************************************************************/
/*	引数の型宣言													 */
/*********************************************************************/
long	mr_cpca(pctno,mode)
register	short	pctno;				/* PCT ｴﾝﾄﾘ ﾊﾞﾝｺﾞｰ			 */
register	long	mode;				/* ｼｮﾘ ｼｭﾍﾞﾂ				 */
{
	/*****************************************************************/
	/* ﾘﾀｰﾝ ｽﾙ														 */
	/*****************************************************************/
	return(MRNORMAL);													/* PRC-034-01 */
}
/*********************************************************************/
/*	PRC-034-01  修正 END 											 */
/*  NOP対応															 */
/*********************************************************************/
