/**************************** NTC-SMP-RCV ****************************/
/*                                                                   */
/*  1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ                                                     */
/*      RCV                                                          */
/*                                                                   */
/*  3 ｶﾝｽｳ ﾒｲ                                                        */
/*      mr_cgbf                                                      */
/*                                                                   */
/*  4 ｷﾉｳ ｶﾞｲﾖｳ                                                      */
/*      ｼﾃｲ ｻﾚﾀ ﾅｶﾞｻ ﾉ ﾊﾞﾂﾌｱ ｵ ｶｸﾎ ｽﾙ  ﾅｵ ﾊﾞﾂﾌｱ ﾆ ｱｷ ｶﾞ ﾅｲ ﾊﾞｱｲ      */
/*      CST ﾆ ﾃｲｷﾞ ｻﾚﾃｲﾙ ｶｲｽｳﾌﾞﾝ ﾘﾄﾗｲ ｽﾙ                             */
/*                                                                   */
/*  5 ﾊﾟﾗﾒ-ﾀ                                                         */
/*      type   :  ﾊﾞﾂﾌｱﾌﾟ-ﾙ ﾉ ｼﾕﾍﾞﾂ                                  */
/*                  0 : CM (ｺﾓﾝ ﾒﾓﾘ)                                 */
/*                  1 : LM (ﾛ-ｶﾙ ﾒﾓﾘ ｱｸｾｽ権なし)           TD-10     */
/*					2 : LM (ﾛｰｶﾙ ﾒﾓﾘ ｱｸｾｽ権有り)		   TD-10	 */
/*      len    :  ﾊﾞﾂﾌｱ ﾉ ﾅｶﾞｻ                                       */
/*      bfadd  :  ﾊﾞﾂﾌｱ ｱﾄﾞﾚｽ ｶｸﾉｳ ｲｷ ｱﾄﾞﾚｽ                          */
/*                                                                   */
/*  6 ﾍﾝｷﾔｸﾁ                                                         */
/*      ｾｲ ﾉ ｱﾀｲ   :  ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ                                  */
/*      MRNOMEM    :  ﾒﾓﾘ ﾌﾞｿｸ                                       */
/*      MCEOSERR   :  TRADE ｼｽﾃﾑｺ-ﾙ ｴﾗ-                    TD-00     */
/*                                                                   */
/*  7 ﾘﾚｷ                                                            */
/*      ｾﾂｹｲｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ                                           */
/*      ｻｸｾｲｼﾔ : ﾉｸﾞﾁ ﾏｽｵ               '87/07/13                    */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*      ﾍﾝｺｳｼｬ : 渡邉　基樹				'93/11/01	  				 */ 
/*														   TD-@1	 */
/*														   TD-00 	 */
/*              （アクセス権付バッファの変更に伴う修正）   TD-10 	 */
/*				（ログの見直しに伴う修正）				   TD-50	 */
/*                                                                   */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:KL0004 										 */
/*改造内容			:TABP関連情報削除漏れ							 */
/*改造日			:2003.02.19										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*  ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ                                                     */
/*********************************************************************/
#include	"tcom.h"
#include	"tsst.h"
#include	"tcst.h"
#include	"tbpt.h"
#include	"tsrt.h"
#include	"tpct.h"
/*********************************************************************/
/*	KL0004  修正 START 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
/*********************************************************************/
/*	KL0004  修正 END 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
#include	"psect.h"
#include    "mopcb.h"
#include    "mo.h" 
#include    "mc.h"
#include    "mr.h"
#include    "mrmac.h"
#include    "mrcode.h"
#include    "osdelay.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*  ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘﾖｳｲｷ                                                 */
/*********************************************************************/
extern	PSCPSECT	pscparea;			/* PSECT ﾘﾖｳｲｷ				 */
extern  MOPSCPCB    *mopcbp;            /* MOPSCPCB ｱﾄﾞﾚｽ            */

/*********************************************************************/
/*  ﾃﾞﾌｱｲﾝ ﾁ                                                         */
/*********************************************************************/
										/* MRWLOG削除 1行		TD50 */
#define MILISEC     1L

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_CGBF	0x6d725f63,0x67626620

long    mr_cgbf(type,len,bfadd)
register    long    type;               /* ﾊﾞﾂﾌｱﾌﾟ-ﾙ ﾉ ｼﾕﾍﾞﾂ         */
register    long    len;                /* ﾊﾞﾂﾌｱ ﾉ ﾅｶﾞｻ              */
register    long    **bfadd;            /* ﾊﾞﾂﾌｱ ｱﾄﾞﾚｽ ｶｸﾉｳｲｷ ｱﾄﾞﾚｽ  */
{

	/*****************************************************************/
	/*  mr_cgtf ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ                                   */
	/*****************************************************************/
	void    mo_wlg4();                  /* Sﾄﾚｰｽ情報の取得		TD50 */
	void    mr_sabt();                  /* ﾌﾟﾛｾｽ ｱﾎﾞ-ﾄ ﾖｳｷｭｳ         */
	long    osdelay();                  /* ｲﾝﾀ-ﾊﾞﾙ ﾀｲﾏ ﾉ ｾﾂﾃｲ        */
	long    mo_gtbf();                  /* ﾊﾞﾂﾌｱﾌﾟ-ﾙ ﾉ ｶｸﾎ           */

	/*****************************************************************/
	/*  mr_cgtf ﾅｲ ﾜ-ｸｴﾘｱ                                            */
	/*****************************************************************/
	register    long       retcd;       /* ﾘﾀ-ﾝ ﾁ ｶｸﾉｳ ｴﾘｱ           */
	register    long       rcode;       /* ﾘﾀ-ﾝ ﾁ ｶｸﾉｳ ｴﾘｱ           */
   	register    int        i;           /* ｼｺｳ ｶｲｽｳ                  */
	            long       rtt;         /* ﾘﾄﾗｲ ﾀｲﾏ ﾁ                */
	            int        rtk;         /* ﾘﾄﾗｲ ｶｲｽｳ                 */
			    long       mrlog[3];    /* ﾛｸﾞ ｼﾞﾖｳﾎｳ ｼﾕﾄｸ ﾘﾖｳｲｷ     */

	/*****************************************************************/
	/*  ﾛｸﾞ ｼﾞﾖｳﾎｳ ﾉ ｼﾕﾄｸ                                            */
	/*****************************************************************/
										/* MRWLOG削除 1行		TD50 */
	mrlog[0] = type;
	mrlog[1] = len;
	mrlog[2] = (long)bfadd;
	mo_wlg4(MR_CGBF,WINSC,mrlog,12L);	/*						TD50 */
										/* MRWLOG削除 2行		TD50 */

	/*****************************************************************/
	/*  ﾊﾞﾂﾌｱ ﾉ ｶｸﾎ ｵ ｺｺﾛﾐﾙ                                          */
	/*****************************************************************/
	switch (type){						/* ﾌﾟｰﾙﾊﾞｯﾌｧの確保      TD10 */
	case	0L	:										   /*   TD10 */
		retcd = mo_gtbf(type,len,bfadd);/* CM ｱｸｾｽ権なし　　　  TD10 */
		break;											   /*   TD10 */
	case	1L	:									       /*   TD10 */	
		retcd = mo_gtbf(type,len,bfadd);/* LM ｱｸｾｽ権なし　　　  TD10 */
		break;								       		   /*   TD10 */	
	case	2L	:									       /*   TD10 */	
		retcd = mo_gabf(type,len,bfadd);/* LM ｱｸｾｽ権有り　  　  TD10 */
		break;									      	   /*   TD10 */	
	default	:									       	   /*   TD10 */	
	    mr_sabt(MRECGBF,MRDINVBUFNO);   /* ﾌﾟﾛｾｽ ｱﾎﾞ-ﾄ          TD10 */
	    break;									       	   /*   TD10 */	
    }
	if (retcd > 0L){				    /* ｾｲ ﾉ ｱﾀｲ ﾀﾞｯﾀﾗ ?          */
		rcode = retcd;
		goto end;
	}
	else{
		mrlog[0] = retcd;
		mo_wlg4(MR_CGBF,0x33331000,mrlog,4L);
										/*						TD50 */
	    switch (retcd){                 /* ﾍﾝｷﾔｸﾁ ﾃﾞ ﾌﾘﾜｹﾙ           */
	    case    MCEOSERR  :
		    rcode = MCEOSERR;
	  	    goto end;
	    case    MOEEFLBF  :
		    i = 1;				
		    break;
	    default :
		    mr_sabt(MRECGBF,MRDGBUFERR);/* ﾌﾟﾛｾｽ ｱﾎﾞ-ﾄ               */
		    break;
	    }
    }

	/*****************************************************************/
	/* ﾘﾄﾗｲ ｼﾞﾖｳﾎｳ ｵﾖﾋﾞ ﾘﾄﾗｲ ｶｲｽｳ ｵ ﾓﾄﾒﾙ                             */
	/*****************************************************************/
	rtt =  mopcbp->mopscstp->tcstfnat;  /* ﾘﾄﾗｲﾀｲﾏ ﾁ ｵ ﾓﾄﾒﾙ          */
	rtk =  (int)mopcbp->mopscstp->tcstfnar; 
										/* ﾘﾄﾗｲ ｶｲｽｳ ｵ ﾓﾄﾒﾙ          */

	/*****************************************************************/
	/*  ﾊﾞﾂﾌｱ ﾉ ｶｸﾎ ｵ ｻｲｼｺｳ ｽﾙ                                       */
	/*****************************************************************/
	for (;;){
		if (i >= rtk){                  /* ﾘﾄﾗｲ ｶｲｽｳ ﾆ ﾀｯｼﾀｶ ?       */
			mrlog[0] = (long)i;
			mo_wlg4(MR_CGBF,0x33331001L,mrlog,4L);
										/*						TD50 */
			rcode = MRNOMEM;
			goto end;
		}
		else;
										/* MRWLOG削除 3行		TD50 */
		mrlog[0] = rtt;
		mrlog[1] = MILISEC;
		mo_wlg4(MR_CGBF,WBSYS | OSDELAY,mrlog,8L);
										/*						TD50 */
		retcd = osdelay(rtt,MILISEC); 
		mrlog[0] = retcd;
		mo_wlg4(MR_CGBF,WASYS | OSDELAY,mrlog,4L);
										/*						TD50 */
		if (retcd != NORMAL){           /* ｲｼﾞｮｳ ﾀﾞｯﾀﾗ ?             */
			mo_wlg4(MR_CGBF,WNGSC,(long *)0,0L);
										/*						TD50 */
			MROSERR(MCEOSDELAY,retcd);
			rcode = MCEOSERR;
			goto end;
		}
		else;
		switch (type){						/* ﾌﾟｰﾙﾊﾞｯﾌｧの確保  TD10 */
		case	0L	:									     /* TD10 */
			retcd = mo_gtbf(type,len,bfadd);/* CM ｱｸｾｽ権なし    TD10 */
			break;									   	     /* TD10 */
		case	1L	:									     /* TD10 */
			retcd = mo_gtbf(type,len,bfadd);/* LM ｱｸｾｽ権なし    TD10 */
			break;									   	     /* TD10 */
		case	2L	:									     /* TD10 */
			retcd = mo_gabf(type,len,bfadd);/* LM ｱｸｾｽ権有り    TD10 */
			break;									   	     /* TD10 */
		default	:									   	     /* TD10 */
	    	mr_sabt(MRECGBF,MRDGBUFERR);	/* ﾌﾟﾛｾｽ ｱﾎﾞ-ﾄ      TD10 */
	    	break;									         /* TD10 */
		}
    	
		if (retcd > 0L){				/* ｾｲ ﾉ ｱﾀｲ ﾀﾞｯﾀﾗ ?          */
			rcode = retcd;
			goto end;
		}
		else{
			mrlog[0] = retcd;
			mo_wlg4(MR_CGBF,0x33331002L,mrlog,4L);
										/*						TD50 */
			switch (retcd){				/* ﾍﾝｷｬｸﾁ ﾃﾞ ﾌﾘﾜｹﾙ		     */
		    case   MCEOSERR :
			    rcode = MCEOSERR;
			    goto end;
		    case   MOEEFLBF :
			    i++;				
			    break;
		    default :
			    mr_sabt(MRECGBF,MRDGBUFERR);
										/* ﾌﾟﾛｾｽ ｱﾎﾞ-ﾄ               */
			    break;
		 	}
	    } 
	}
end:
	/*****************************************************************/
	/*  ﾛｸﾞ ｼﾞﾖｳﾎｳ ﾉ ｼﾕﾄｸ                                            */
	/*****************************************************************/
										/* MRWLOG削除 1行		TD50 */
	mrlog[0] = rcode;
	mo_wlg4(MR_CGBF,WOTSC,mrlog,4L);	/*						TD50 */
										/* MRWLOG削除 2行		TD50 */

	return(rcode);
}
