/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞ ﾊﾟﾂｹｰｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		故障管理依頼										 (TD-00) */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_esrq														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ＴＲＡＤＥからの故障通知及び事象通知に対する処理を   (TD-00) */
/*		故障管理プロセスに依頼する。						 (TD-00) */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		notify : 故障通知情報 								 (TD-00) */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		MRNORMAL	:	ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ								 */
/*  不要な返却値の為削除									 (TD00)  */
/*		MCEOSERR	:	TRADE ｼｽﾃﾑｺ-ﾙ ｴﾗ-							 */
/*		MRNOMEM 	:	ﾒﾓﾘ ﾌﾞｿｸ									 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾏｴｻﾞﾜ ｱｷﾗ											 */
/*		ｻｸｾｲｼﾔ : ｺｼﾞﾏ  ｱｷﾗ				'87/03/13					 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'87/12/24 (L01)				 */
/*				(ﾃﾞﾝﾌﾞﾝ ｿｳｼﾝ ｲｼﾞｮｳｼﾞ ﾉ ﾌﾟｰﾙﾊﾞｯﾌｧ ｶｲﾎｳ)	---	STC569	 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'88/05/11 (L02)				 */
/*				(ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ ｷﾉｳ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC911		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者 : 今井　弘幸						     (TD-10) (TD-59) */
/*				 (PUの独立化に伴う変更)						 (TD-59) */
/*				 (ﾛｸﾞの見直しに伴う修正)					 (TD-50) */
/*				 (ｱｸｾｽ権付きﾊﾞｯﾌｧに伴う変更)				 (TD-10) */
/*				 (ﾎｯﾄｽﾀﾝﾊﾞｲ変更に伴う変更)					 (TD-02) */
/*										'93/11/11			 (TD-59) */
/*		変更者 : 夛田　透				'95/03/02 --- CT0895(ST2493) */
/*				 (ﾐﾗｰﾘﾝｸﾞ制御同期保証機能追加に伴う修正)	  TD-22  */
/*      変更者 : 杉岡  克也				'95/05/02 --- CT1039(ST2764) */
/*				 (SCSIﾘｾﾂﾄ機能の見直しに伴う修正)			  TD-61  */
/*      変更者 : 杉岡  克也				'95/09/11 --- ST3243		 */
/*																	 */
/*	    変更者 : 今井　弘幸				'95/10/02 --- CT1141(ST3673) */
/*																	 */
/*	    変更者 : Ｃｏｍ’Ａｐｐ			'96/02/21 --- SSCY0152		 */
/*＜ソース修正者名＞				 Com'App 山口					 */
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９６年４月１０日	ST4008	 */
/*									 (装置間通信用バスリセット機能)	 */
/*＜ソース修正者名＞				 Com'App 高橋					 */
/*＜ソース修正年月日及び修正ＩＤ＞	 １９９７年３月２４日	ST4800	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-034-01										 */
/*改造内容			:NOP対応	リターンコードに正常値を設定し不要	 */
/*								となったロジックは削除する			 */
/*改造日			:2002.10.18										 */
/*改造者			:Χ								 */
/*********************************************************************/
/*********************************************************************/
/*	PRC-034-01  修正 START 											 */
/*  NOP対応															 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"mr.h"						/* 返却値の引数定義			 */	/* PRC-034-01 */
/*********************************************************************/
/*	引数の型宣言													 */
/*********************************************************************/
long	mr_esrq( notify )
char	*notify;
{
	/*****************************************************************/
	/* ﾘﾀｰﾝ ｽﾙ														 */
	/*****************************************************************/
	return(MRNORMAL);													/* PRC-034-01 */
}
/*********************************************************************/
/*	PRC-034-01  修正 END 											 */
/*  NOP対応															 */
/*********************************************************************/
