/*----------------------------------------------------------------------------------------------*/
/* ＜対象業務名＞                    故障管理業務      　　         							*/
/* ＜対象業務ＩＤ＞                  ＲＣＶ                         							*/
/* ＜サービス項目名＞                テーブルリカバリ          　   							*/
/* ＜サービス項目ＩＤ＞              trcv                    									*/
/* ＜モジュール名＞                  ｍｒ＿ferr													*/
/* ＜モジュールＩＤ＞                ＸＸＸＸＸＸＸＸ               							*/
/* ＜モジュール通番＞                                               							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種＞                      ＡＣＥ                         							*/
/* ＜適用ＯＳ＞                      ＬＩＮＵＸ                     							*/
/* ＜開発環境＞                      ＬＩＮＵＸ                     							*/
/* ＜記述言語＞                      Ｃ言語                         							*/
/* ＜モジュール形態＞                コマンド                       							*/
/* ＜機能区分＞                                                     							*/
/* ＜対象データ＞                                                   							*/
/* ＜工程・階層区分＞                                               							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞                ＡＣＥ−ＳＭＰシステム         							*/
/* ＜開発システム番号＞              ＸＸＸＸＸＸＸＸＸＸＸＸ       							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当者名＞                  Ｓｕｐｐｌｙ                   							*/
/* ＜電話番号＞                                         							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞　　　　　　　　　　　Ｓｕｐｐｌｙ                   							*/
/* ＜設計年月日＞                    ２００３年０４月１０日	        							*/
/* ＜設計修正者名＞                  朱                             							*/
/* ＜設計修正年月日及び修正ＩＤ＞                                  							    */
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者名＞                Ｓｕｐｐｌｙ                   							*/
/* ＜ソース作成年月日＞              ２００３年０４月１０日	         							*/
/* ＜ソース修正者名＞                                               							*/
/* ＜ソース修正年月日及び修正ＩＤ＞                                 							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞                ステップ                       							*/
/*---------------------------------------------------------------------------------------------	*/
/* ＜機能概要＞                                                     							*/
/*                                                                  							*/
/*      引継ぎ情報ファイルアクセスエラーの総合処理												*/
/*                                                                  							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞                                                     							*/
/*			void mr_ferr(int, char);															*/
/*																								*/                                                              
/* ＜仮引数＞                                                       							*/
/*		int	 	iFd;			ファイル ディスクリプタ  										*/
/*		char  	cSysCall;		システムコール名のスイッチ;										*/
/*		  																						*/
/*              	                                                							*/
/* ＜返却値＞                                                       							*/
/*         なし		                                                							*/
/*----------------------------------------------------------------------------------------------*/
/* ＜制限事項＞         なし                                        							*/
/*                                                                  							*/
/* ＜使用外部モジュールＩＤ＞                                      	                            */
/* ＜呼出モジュールＩＤ＞                                           							*/
/*                                                                  							*/
/************************************************************************************************/
/************************************************************************************************/
/*								共通ヘッダ・ファイル                							*/
/*																								*/
/************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <fcntl.h>
#include <string.h>
#include <sys/types.h> 
#include <unistd.h> 
#include <errno.h>
#include <sys/stat.h> 


/************************************************************************************************/
/*								利用者作成ヘッダ・ファイル             							*/
/*																								*/
/************************************************************************************************/
#include    "mr.h"
#include 	"trcv.h"
#include	"mrmsg.h"
#include	"mcdebug.h"


/************************************************************************************************/
/*	内部関数宣言										             							*/
/*																								*/
/************************************************************************************************/
/* 引継ぎ状態ファイルエラー処理 */
long mr_sfer(int, char);

/* 引継ぎ情報ファイルエラー処理 */
void mr_ferr(int, char);
long mr_ifer(int, char);


/************************************************************************************************/
/*																								*/
/*	＜関数名＞	void mr_ferr(int iFd, char cSysCall)											*/
/*																								*/
/*	＜機能概要＞ 引継ぎ情報ファイルエラー処理													*/
/*  																							*/
/*	リターン:																					*/
/*		なし																					*/
/************************************************************************************************/
void mr_ferr(int iFd, char cSysCall)
{
	
	long lRet = MRNORMAL;									/* 返却値							*/
	
	extern TRCV *mrtrcv;									/* リカバリテーブル宣言				*/
	
	PRINTF("(1) mr_ferr - iFd = %ld\n", iFd);
	
	lRet = mr_ifer(iFd, cSysCall);							/* 引継ぎ情報ファイルエラー処理		*/ 
	
	PRINTF("(2) mr_ferr - lRet = %ld\n", lRet);

	
	if(lRet != MRNORMAL)									/* エラーの場合						*/
	{														
	
		PRINTF("(3) mr_ferr - lRet = %ld\n", lRet);
	
		lRet = mr_sfer(SYSERROR, cSysCall);					/* 引継ぎ状態ファイルエラー処理		*/
		
		PRINTF("(4) mr_ferr - lRet = %ld\n", lRet);

		
		mrtrcv->trcvsfst = TRCVFERR;						/* 引継ぎ状態ファイルが故障中		*/
		
		PRINTF("(4.1) mr_ferr - mrtrcv->trcvsfst = %c\n",	mrtrcv->trcvsfst);
		
	}

	mrtrcv->trcvjfst = TRCVFERR;							/* 引継ぎ情報ファイルが故障中		*/

	PRINTF("(5) mr_ferr EXIT - mrtrcv->trcvjfst = %c\n",	mrtrcv->trcvjfst);
	
	return;
	
}

