/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞ ﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ｼﾞﾔ-ﾅﾙ ｼﾕﾄｸ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_jclr														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ｼﾞｬｰﾅﾙﾌｧｲﾙ ﾉ ﾍｯﾀﾞﾌﾞﾌﾞﾝ ﾉ									 */
/*		ｸﾘｱ ｦ ｵｺﾅｳ													 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		mode : ｸﾘｱ ﾓｰﾄﾞ												 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		MRNORMAL	: ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ									 */
/*		MRIVPARM	: ﾊﾟﾗﾒﾀ ｴﾗ-										 */
/*		MRJNLERR	: ｱｸｾｽ ｴﾗ-										 */
/*		MRMODEERR	: ﾓｰﾄﾞ ｴﾗｰ										 */
/*		MRNOOPEN	: ﾐｵ-ﾌﾟﾝ										 */
/*		MRNOMEM		: ﾒﾓﾘ ﾌﾞｿｸ										 */
/*		MCEOSERR	: ROS ｼｽﾃﾑｺｰﾙ ｴﾗｰ								 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ											 */
/*		ｻｸｾｲｼﾔ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ			 '87/04/23						 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ			 '87/10/08	(L01)				 */
/*					(ｼｽﾃﾑ ｼｮｷｶ ｼｮﾘ ｷﾉｳ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC355	 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ			 '88/01/25	(L02)				 */
/*					(mc_clea ｶﾝｽｳ ﾉ ｾﾝｹﾞﾝ ｦ long ﾄｽﾙ)				 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/10/12 (L03)				 */
/*				 	(ﾌﾟｰﾙ ﾊﾞｯﾌｧ ｶｸﾄｸ ﾎｳﾎｳ ﾉ ﾍﾝｺｳ) --- TC1230		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼｬ : 山下　元			 '93/12/20	 					 */
/*				 (ﾛｼﾞｯｸの整理)								TD-@1	 */
/*				 (ｱｸｾｽ権付きﾌﾟｰﾙﾊﾞｯﾌｧに伴う変更)			TD-10	 */
/*				 (KJ分離に伴う変更)							TD-42	 */
/*				 (ﾌﾟﾛｾｽｱﾎﾞｰﾄ見直しに伴う変更)				TD-49	 */
/*				 (ﾛｸﾞの見直しに伴う修正)					TD-50	 */
/*				 (SCSIﾘｾｯﾄ機能に伴う追加)					TD-61	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-034-01										 */
/*改造内容			:NOP対応	リターンコードに正常値を設定し不要	 */
/*								となったロジックは削除する			 */
/*改造日			:2002.11.27										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*	PRC-034-01  修正 START 											 */
/*  NOP対応															 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"mr.h"
/*********************************************************************/
/*	引数の型宣言													 */
/*********************************************************************/
long	mr_jclr(mode)
char	mode;
{
	/*****************************************************************/
	/* ﾘﾀｰﾝ ｽﾙ														 */
	/*****************************************************************/
	return(MRNORMAL);													/* PRC-034-01 */
}
/*********************************************************************/
/*	PRC-034-01  修正 END 											 */
/*  NOP対応															 */
/*********************************************************************/
