/**************************** NTC-SMP-RCV ****************************/
/*															 		 */
/*	1 ｻﾌﾞ ﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ｼﾞﾔ-ﾅﾙ ｼﾕﾄｸ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_jopn														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ﾍﾉ ｱｸｾｽ ｦ ｶﾉｳ ﾆ ｽﾙﾀﾒ							 */
/*		ﾊﾞｲﾀｲ ﾉ ｶｸﾎ ｵﾖﾋﾞ ｼｮｷ ｾｯﾃｲ ｦ ｵｺﾅｳ							 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		fname : ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ﾒｲ										 */
/*		mode  : ｵｰﾌﾟﾝ ﾓｰﾄﾞ											 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		MRNORMAL : ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ									 */
/*		MRIVPARM : ﾊﾟﾗﾒﾀ ｴﾗｰ										 */
/*		MRJNLERR : ｼﾞｬｰﾅﾙ ｵｰﾌﾟﾝ ｴﾗｰ (ﾆｼﾞｭｳ ｼｮｳｶﾞｲ)					 */
/*		MRALOPEN : ｽﾃﾞﾆ ｵｰﾌﾟﾝ ｽﾞﾐ									 */
/*		MRNOMEM  : mr_jgbf ﾅｲ ﾒﾓﾘ ﾌﾞｿｸ ｴﾗｰ							 */
/*		MCEOSERR : mr_jgbf ﾅｲ ROS ｴﾗｰ								 */
/*		MRTBLERR : ﾃｰﾌﾞﾙ ｴﾗｰ										 */
/*		MRNOMNT  : ﾊﾞｯｸｱｯﾌﾟ ﾌｧｲﾙ ﾖｳ ﾛﾝﾘﾎﾞﾘｭｰﾑ ﾐﾏｳﾝﾄ 		         */
/*		MRRJONEC : JNL再ｵ-ﾌﾟﾝ要							ST3699	     */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ											 */
/*		ｻｸｾｲｼﾔ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ			 '86/06/20						 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ			 '87/09/01 (L01)				 */
/*				 (ﾊﾞｯｸｱｯﾌﾟ ﾓｰﾄﾞ ﾉ ﾂｲｶ) --- STC358					 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ 			 '88/07/15	(L02)				 */
/*				 (mc_clea ｶﾝｽｳ ﾉ ｾﾝｹﾞﾝ ｦ long ﾄｽﾙ)					 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/10/12 (L03)				 */
/*				 (ﾌﾟｰﾙ ﾊﾞｯﾌｧ ｶｸﾄｸ ﾎｳﾎｳ ﾉ ﾍﾝｺｳ) --- TC1230			 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼﾔ : ﾏｴｻﾞﾜ ｱｷﾗ				'89/12/05 (L04)	--- TC3013	 */
/*		ﾍﾝｺｳｼｬ : 山下　元			 '93/12/20	 					 */
/*				 (ﾛｼﾞｯｸの整理)								TD-@1	 */
/*				 (ｱｸｾｽ権付きﾌﾟｰﾙﾊﾞｯﾌｧに伴う変更)			TD-10	 */
/*				 (２重化ﾌｧｲﾙ削除に伴う削除)					TD-27	 */
/*				 (KJ分離に伴う変更)							TD-42	 */
/*				 (ﾛｸﾞの見直しに伴う修正)					TD-50	 */
/*				 (SCSIﾘｾｯﾄ機能に伴う追加)					TD-61	 */
/*				 (BKUP中ｼﾞｬｰﾅﾙ取得)							TD-67	 */
/*		変更者 : 杉岡  克也			'95/10/09 --- CT1152(ST3674)	 */
/*		変更者 : 杉岡  克也			'96/02/07 --- ST3699			 */
/*				 (ﾎﾂﾄｽﾀﾝﾊﾞｲ予備系mr_jopn失敗時対処)					 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-034-01										 */
/*改造内容			:NOP対応	リターンコードに正常値を設定し不要	 */
/*								となったロジックは削除する			 */
/*改造日			:2002.10.18										 */
/*改造者			:Χ								 */
/*********************************************************************/
/*********************************************************************/
/*	PRC-034-01  修正 START 											 */
/*  NOP対応															 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"mr.h"						/* 返却値の引数定義			 */	/* PRC-034-01 */
/*********************************************************************/
/*	引数の型宣言													 */
/*********************************************************************/
long	mr_jopn(fname, mode)
register	char	*fname;
register	char	mode;
{
	/*****************************************************************/
	/* ﾘﾀｰﾝ ｽﾙ														 */
	/*****************************************************************/
	return(MRNORMAL);													/* PRC-034-01 */
}
/*********************************************************************/
/*	PRC-034-01  修正 END 											 */
/*  NOP対応															 */
/*********************************************************************/
