/****************************************************************************/
/*  著作権  １９９４														*/
/*		      ＮＴＴデータ通信株式会社										*/
/*			    金融システム事業部											*/
/*																			*/
/*																			*/
/*  収容物  ＡＣＥ−ＳＭＰシステム											*/
/*		    異常受付機能       アボート取得なし異常終了受付処理(mr_nabt)	*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/* ＜対象業務名＞                    故障監視業務                       　　*/
/* ＜対象業務ＩＤ＞                  ＲＣＶ                                 */
/* ＜サービス項目名＞                異常終了受付処理　	           　  		*/
/* ＜サービス項目ＩＤ＞              ０２５			                        */
/* ＜モジュール名＞                  アボート取得なし異常終了受付処理 		*/
/* ＜モジュールＩＤ＞                ２２６３００００						*/
/* ＜モジュール通番＞                	                                　　*/
/*--------------------------------------------------------------------------*/
/* ＜適用機種＞                      ＡＣＥ                                 */
/* ＜適用ＯＳ＞                      ＴＲＡＤＥ                             */
/* ＜開発環境＞                      ＳＵＮ　ＳＰＡＲＣ−ＩＰＸ             */
/* ＜記述言語＞                      Ｃ言語                                 */
/* ＜モジュール形態＞                関数                                   */
/* ＜機能区分＞                      	                                    */
/* ＜対象データ＞                    	                                　　*/
/* ＜工程・階層区分＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞                ＡＣＥ−ＳＭＰシステム                 */
/* ＜開発システム番号＞              ５７２６０１４０２１００               */
/*--------------------------------------------------------------------------*/
/* ＜開発担当者名＞                  営業店システム担当                     */
/* ＜電話番号＞                      169-3573(03-5702-3573)                 */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞　　　　　　　　　　　山本　智也								*/
/* ＜設計年月日＞                    １９９５年０６月０８日                 */
/* ＜設計修正者名＞                                                         */
/* ＜設計修正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者名＞                山本　智也                             */
/* ＜ソース作成年月日＞              １９９５年０６月０８日                 */
/* ＜ソース修正者名＞                          								*/
/* ＜ソース修正年月日及び修正ＩＤ＞  										*/
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ数＞                ステップ                         */
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞                                                             */
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞                                                             */
/*     #include  mr.h                                                       */
/*     void    mr_nabt( code, detail, detail2, detail3 );                  	*/
/*                                                                          */
/* ＜仮引数＞                                                               */
/*		short    code;               < 故障コード　　		>    			*/
/*		long	detail;				 < 詳細情報				>				*/
/*		long	detail2;			 < 詳細情報２			>				*/
/*		long	detail3;			 < 詳細情報３			>				*/
/*                                                                          */
/* ＜返却値＞    		なし                                                */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜制限事項＞         なし                                                */

/* ＜使用外部モジュールＩＤ＞                                               */
/*    psect.h , 															*/
/*	  tcom.h, tpct.h, tput.h,												*/
/*	  mr.h, mrcom.h, mrmac.h,										      	*/
/*	  mcdebug.h																*/
/*	  mo_wlg.h																*/
/*	  mr_sdwn, mo_wlg4, mo_tagt, osterm										*/
/* ＜呼出モジュールＩＤ＞                                                   */
/*                                                                          */
/****************************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-047-08										 */
/*改造内容			:エミュレート対象外ＴＲＡＤＥシステムコール対応	 */
/*					:自プロセスの無条件待ち関数(ossleep)は、ＰＵ閉塞 */
/*					:ルートのためルート削除を行う					 */
/*改造日			:2002.11.21										 */
/*改造者			:Χ								 */
/*********************************************************************/
/*********************************************************************/
/*  ｲﾝｸﾙｰﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
#include	"tpct.h"
#include	"tput.h"
#include	"mr.h"
#include	"mrcom.h"
#include	"mrmac.h"
#include	"psect.h"
#include    "mcdebug.h"
#include	"mo_wlg.h"

/*********************************************************************/
/*  ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘｮｳｲｷ 												 */
/*********************************************************************/
extern		PSCPSECT	pscparea;		/* PSECT ﾘｮｳｲｷ				 */

/*********************************************************************/
/*  ﾃﾞﾌｧｲﾝ ﾁ         												 */
/*********************************************************************/
										/* MRWLOG削除 1行		 	 */

/*********************************************************************/
/*	define function name for mo_wlg4							 	 */
/*********************************************************************/
#define	MR_NABT	0x6d725f6e,0x61627420

void	mr_nabt(code, detail, detail2, detail3)
short	code;							/* 故障 ｺｰﾄﾞ	 			 */
long	detail;							/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ				 */
long	detail2;						/* 詳細情報 2           	 */
long	detail3;						/* 詳細情報 3           	 */
{
	/*****************************************************************/
	/*  mr_nabt ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	osterm();					/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ 	 		 */
	void	mr_sdwn();					/* ｼｽﾃﾑ ﾀﾞｳﾝ 	 	 		 */
	void	mo_wlg4();					/* Sﾄﾚｰｽ情報の取得			 */
	TCOMPAT	*mo_tagt();					/* ﾃｰﾌﾞﾙ ｾﾝﾄｳ ｱﾄﾞﾚｽ ｶｸﾄｸ ｶﾝｽｳ */

	/*****************************************************************/
	/*  mr_nabt ﾅｲ ﾜｰｸ ｴﾘｱ								 			 */
	/*****************************************************************/
	register	long		endcd;		/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｻｸｾｲ ｴﾘｱ		 */
	register	TPCTPSZ		*tpctp;		/* PCT ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ ﾎﾟｲﾝﾀ	 */
				long		mrlog[4];	/* ﾛｸﾞ 情報編集領域			 */
	/*****************************************************************/
	/*	PRC-047-08  修正 START 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	/*改造内容	：	自プロセスの無条件待ち関数(ossleep)は、ＰＵ閉塞	 */	/* PRC-047-08 */
	/*			：	ルートのためルート削除を行う（変数定義）		 */	/* PRC-047-08 */
	/*****************************************************************/
	/*	PRC-047-08  修正 END 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/

	PRINT4("**  mr_nabt() is invoked. **\n    code = 0x%04x\n    detail = 0x%08x\n    detail2 = 0x%08x\n    detail3 = 0x%08x\n",code,detail,detail2,detail3);
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
	mrlog[0] = (long)code;				/* 故障 ｺｰﾄﾞ	 			 */
	mrlog[1] = detail;					/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ				 */
	mrlog[2] = detail2;					/* 詳細情報 2            	 */
	mrlog[3] = detail3;					/* 詳細情報 3            	 */
	mo_wlg4(MR_NABT,WINSC,mrlog,16L);	/*  					 	 */

	/*****************************************************************/
	/*  ﾏｽﾀ.ｽｹｼﾞｭﾗ ﾉ ﾊﾞｱｲ 	 								 		 */
	/*****************************************************************/
	endcd = code & 0x0000FFFFL;
	if (pscparea.pscpctno==0) {
		mr_sdwn(MRSTART, endcd, detail);
	}
	else;

	/*****************************************************************/
	/*  ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ﾁｭｳ ﾉ ﾊﾞｱｲ						 		         */
	/*****************************************************************/
	if (mrpcbp->mrprcst == MRPRCRUN){	/* ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ﾁｭｳ ﾅﾗﾊﾞ		 */
		mr_sdwn(MRSTART, endcd, detail);/* ｼｽﾃﾑ ﾀﾞｳﾝ ﾄ ｽﾙ      		 */
	}
	else;

	/*****************************************************************/
	/*  ｼｭｳﾘｮｳ ｺｰﾄﾞ ｦ ｻｸｾｲ ｽﾙ 										 */
	/*****************************************************************/
										/* PCT ｶﾞｲﾄｳｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ	 */
	tpctp = (TPCTPSZ *)MRTBLAD(pscparea.pscpctad,
							   pscparea.pscpctno+1);
	if( tpctp->tpctmflg == TPCTMKNE ){  /* 電文引継要？				*/
		endcd |= 0x00120000L;			/* 終了コード設定			*/
	}
	else{
		endcd |= 0x00020000L;			/* 終了コード設定			*/
	}

	/*****************************************************************/
	/*  ｼｭｳﾘｮｳ ｺｰﾄﾞ, ｼｮｳｻｲ ｺｰﾄﾞ ｦ PCT ﾆ ｾｯﾃｲ ｽﾙ 	 				 */
	/*****************************************************************/
	tpctp->tpctecd = endcd;
	tpctp->tpctdtl = detail;
	tpctp->tpctdtl2 = detail2;
	tpctp->tpctdtl3 = detail3;

	/*****************************************************************/
	/*	PRC-047-08  修正 START 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	/*改造内容	：	自プロセスの無条件待ち関数(ossleep)は、ＰＵ閉塞	 */	/* PRC-047-08 */
	/*			：	ルートのためルート削除を行う（ロジック）		 */	/* PRC-047-08 */
	/*****************************************************************/
	/*	PRC-047-08  修正 END 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/

	/*****************************************************************/
	/*  ﾌﾟﾛｾｽ ｦ ｼｭｳﾘｮｳ ｻｾﾙ 	 	 	 								 */
	/*****************************************************************/
	mrlog[0] = endcd;
	mo_wlg4(MR_NABT,WBSYS | OSTERM,mrlog,4L);

	osterm(endcd);							/* osterm発行			 */
}
