/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_prec														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾌﾟﾛｾｽ ﾉ ｼﾞﾖｳﾀｲ ﾆ ﾖﾘ ｼﾞﾔ-ﾅﾙ ｶﾗﾉ ﾌﾂｷﾕｳ ﾏﾀﾊ ｼﾞﾔ-ﾅﾙ ﾉ ﾊｷ ｦ ｵｺﾅｳ. */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		prb	:	ｷﾖｳﾂｳ ｼﾞﾖｳﾎｳ ｾﾂﾃｲ ﾘﾖｳｲｷ								 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		0	:	ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ										 */
/*		-1	:	ｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ										 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ				'					 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ			 	' (L01)				 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｼｮﾘ ﾂｲｶ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ 				'90/10/25 (L02)				 */
/*				 (KJﾍﾝｼｭｳ ﾌｶｶﾝｽｳ ﾅｲﾃﾞ mr_sabtｶﾞ ﾊｯｺｳｻﾚﾀ ﾄｷﾉ PRCV ﾃﾞﾊ */
/*				  AJ ｦ ｼｭﾄｸ ｼﾅｲ)				   --- TC3956		 */
/*		変更者 : 佐藤　亘											 */
/*				 (内部事情による変更)						TD-@1	 */
/*				 (ログの見直しに伴う修正)					TD-50	 */
/*		変更者 : 杉岡  克也				'95/05/06 --- CT1030(ST2657) */
/*		変更者 : 杉岡  克也				'95/06/12 --- ST2803		 */
/*		変更者 : 杉岡  克也				'96/04/30 --- ST4183		 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	 "tcom.h"
#include	 "ttct.h"
#include	 "tjct.h"
#include	 "psect.h"
#include	 "mrcom.h"
#include	 "mrprcv.h"
#include	 "mr.h"
#include	 "mrj.h"
#include	 "mc.h"
#include	 "mrcode.h"
#include	"mrmac.h"					/*					ST4183	 */
#include	"mcdebug.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*	ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘﾖｳｲｷ												 */
/*********************************************************************/
extern	PSCPSECT	pscparea;

/*********************************************************************/
/*	ﾃﾞﾌｧｲﾝ ﾁ 														 */
/*********************************************************************/
#define	MRWLOG	pscparea.pscobaad							/* (L01) */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_PREC	0x6d725f70,0x72656320

long	mr_prec(prb)
MRPRB	*prb;
{
		
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	START								 */
/*********************************************************************/	
#ifdef LINUX_ISOKUTAIOU	
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	END									 */
/*********************************************************************/
	
	/*****************************************************************/
	/*	mr_prec ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	mr_pfil();					/*							 */
	long	mr_cpca();					/*							 */
	void	mo_wlg4();					/* 障害解析情報取得(L01)TD50 */
										/* mr_pjnlは未使用の為削除	 */
										/*						TD@1 */

	/*****************************************************************/
	/*	mr_prec ﾅｲ ﾜ-ｸ ｴﾘｱ											 */
	/*****************************************************************/
	register	long	i;				/*							 */
	register	short	and;			/* ﾛﾝﾘﾜ ﾜ-ｸ ｲｷ				 */
	register	long	rc;				/* ﾘﾀ-ﾝ ｺ-ﾄﾞ ｲｷ				 */
				long	mrlog[5];		/* ﾛｸﾞ ﾍﾝｼｭｳ ﾘｮｳｲｷ(L01)	TD50 */
										/* ST2803					 */
				TTCTPSZ	*tctp;			/*					ST4318	 */

	PRINT0("mr_prec() : START\n");
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = (long)prb;				/*					   (L01) */
	mo_wlg4(MR_PREC,WINSC,mrlog,4L);	/*				  (L01) TD50 */

	/*****************************************************************/
	/*	ｼﾖﾘ															 */
	/*****************************************************************/
	tctp = ( TTCTPSZ* )MRTBLAD( mrpcbp->mrptcta, 1 );	/*	ST4318	 */

	if (mrpcbp->mrpnsrc==MRPNRNEC){		/* ﾘｶﾊﾞﾘ ﾘ ﾖｳ ﾉ ﾊﾞｱｲ		 */
		if ((mrpcbp->mrptrst&MRPTRST) != 0){ /* ﾄﾗﾝｻﾞｸｼﾖﾝ ｶｲｼ ﾁﾕｳ?	 */
			i = pscparea.pscpctno/8;	/* PCA ｽﾃ-ﾀｽ ﾉ ﾊﾞｲﾄ			 */
			and = 0x0080; 				/*							 */
			and >>= pscparea.pscpctno%8;/* PCA ｽﾃ-ﾀｽ ﾉ ﾋﾞﾂﾄ			 */
			if ((tctp->ttctpst[i]&and) != 0){			/*	ST4318	 */
				mrlog[0] = (long)pscparea.pscpctno;		/*	ST4318	 */
				mrlog[1] = (long)i;						/*	ST4318	 */
				mrlog[2] = tctp->ttctpst[i];			/*	ST4318	 */
				mrlog[3] = (long)and;					/*	ST4318	 */
				mo_wlg4(MR_PREC,0x33331003L,mrlog,16L); /*	ST4318	 */
				prb->mrprsta = MRTRANEND;	/* ｽﾃｰﾀｽ ｼﾞｮｳﾀｲ ｾﾂﾄ		 */
				rc = mr_pfil(prb);		/* ｼﾞﾔ-ﾅﾙ ﾃﾞ ﾌﾂｷﾕｳ			 */
				if (rc < 0L){			/*							 */
					mrlog[0] = rc;		/*					   (L01) */
					mo_wlg4(MR_PREC,0x33331000L,mrlog,4L);
										/* 				  (L01) TD50 */
					goto err;			/*							 */
				}						/*							 */
				else;					/*							 */
				rc = mr_cpca(pscparea.pscpctno+1,MRCJNLOFF);
										/* PCAｽﾃ-ﾀｽ ｵﾌ				 */
				if (rc != MRNORMAL){	/* ｴﾗ-?						 */
					prb->mrprdwd = MRDENQTDT;	/* ｼﾖｳｻｲ ｼﾞﾖｳﾎｳ ｾﾂﾄ	 */
					mrlog[0] = rc;		/*					   (L01) */
					mo_wlg4(MR_PREC,0x33331001L,mrlog,4L);
										/* 				  (L01) TD50 */
					goto err;			/*							 */
				}						/*							 */
				else;					/*							 */
			}							/*							 */
			else{						/*							 */
				if ((mrpcbp->mrptrst&MRPTRUPD) == 0){ /*ｼﾞﾂｺｳｼﾝ ﾏｴ?	 */
					prb->mrprsta = MRTRANSRT;/* ｽﾃｰﾀｽ ｼﾞｮｳﾀｲ ｾﾂﾄ	 */

					/*************************************************/
					/*	ｱﾎﾞｰﾄｼﾞｬｰﾅﾙは未使用の為、削除				 */
					/*	(削除ｽﾃｯﾌﾟ数 : 10)						TD@1 */
					/*************************************************/

				}						/*							 */
				else{					/*							 */
					prb->mrprsta = MRTRANEND;/* ｽﾃｰﾀｽ ｼﾞｮｳﾀｲ ｾﾂﾄ	 */
				}						/*							 */
			}							/*							 */
		}								/*							 */
		else{							/*							 */
			i = pscparea.pscpctno / 8;						/*	TD@1 */
			and = 0x0080; 									/*	TD@1 */
			and >>= pscparea.pscpctno % 8;					/*	TD@1 */
			if ((tctp->ttctpst[i] & and) != 0) {	/*	TD@1 ST4318  */
				prb->mrprdwd = MRDTRANNG;					/*	TD@1 */
				mrlog[0] = (long)pscparea.pscpctno;		/*	CT1030	 */
				mrlog[1] = (long)i;						/*	CT1030	 */
				mrlog[2] = (long)tctp;			/*	CT1030	ST4318	 */
				mrlog[3] = tctp->ttctpst[i];	/*	CT1030	ST4318	 */
				mrlog[4] = (long)and;					/*	CT1030	 */
				mo_wlg4(MR_PREC,0x33331002L,mrlog,20L); /*  CT1030   */
				goto err;									/*	TD@1 */
			}												/*	TD@1 */
			prb->mrprsta = MRNOTRAN; 	/* ｽﾃｰﾀｽ ｼﾞｮｳﾀｲ ｾﾂﾄ	 		 */
		}								/*							 */
	}									/*							 */
	else{								/* ﾘｽﾊﾞﾘ ﾌﾖｳ ﾉ ﾊﾞｱｲ			 */
		if ((mrpcbp->mrptrst&MRPTRST) != 0){ /* ﾄﾗﾝｻﾞｸｼﾖﾝ ｶｲｼ ﾁﾕｳ?	 */
			prb->mrprsta = MRTRANSRT;	/* ｽﾃｰﾀｽ ｼﾞｮｳﾀｲ ｾﾂﾄ	 		 */
		}								/*							 */
		else{							/*							 */
			prb->mrprsta = MRNOTRAN;	/* ｽﾃｰﾀｽ ｼﾞｮｳﾀｲ ｾﾂﾄ	 		 */
		}								/*							 */
	}									/*							 */
										/*							 */
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = 0L;						/*					   (L01) */
	mo_wlg4(MR_PREC,WOTSC,mrlog,4L);	/*			   	  (L01) TD50 */
	return(0L);							/*							 */
err:									/*							 */
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = -1L;						/*					   (L01) */
	mo_wlg4(MR_PREC,WOTSC,mrlog,4L);	/*			   	  (L01) TD50 */
	PRINT0("mr_prec() : END\n");
	return(-1L);						/*							 */
	
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	START								 */
/*********************************************************************/	
#endif	
	
	return(MRNORMAL);
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	END									 */
/*********************************************************************/	
	
	
}
