/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟｯｹｰｼﾞ													 */
/*		RCV															 */
/*																	 */
/*  2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ｼｮｷｶ / ｼｭｳﾘｮｳ ｼｮﾘ									 	 */
/*																	 */
/*  3 ｶﾝｽｳ ﾒｲ													 	 */
/*		mr_pint														 */
/*																	 */
/*  4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾌﾟﾛｾｽ ｼｮｷｶ ｼｮﾘ									 	 		 */
/*		ﾃｰﾌﾞﾙ ｹﾝｻｸ ｼｮﾘ									 	 		 */
/*																	 */
/*	5 ﾊﾟﾗﾒｰﾀ														 */
/*		ﾅｼ															 */
/*																	 */
/*	6 ﾍﾝｷｬｸﾁ														 */
/*		MRNORMAL	:	ｾｲｼﾞｮｳ										 */
/*		MRTBLERR	:	必要なﾃｰﾌﾞﾙがない					TD-00	 */
/*		MRNOMEM		:	ﾒﾓﾘ ﾌﾞｿｸ									 */
/*		MCEOSERR	:	TRADE ﾉ ｼｽﾃﾑｺｰﾙ ｴﾗｰ					TD-00	 */
/*		MRRJONEC	:   JNL再ｵ-ﾌﾟﾝ要						ST3699	 */
/*																	 */
/*  7 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ 											 */
/*		ｻｸｾｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ 				'86/07/16					 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ             '87/03/30 (L01)              */
/*				 (ﾎﾘｭｳ ﾃﾞ-ﾀ ｲｷ ｸﾘｱ ｼｮﾘ ﾉ ﾍﾝｺｳ)						 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ 	            '87/07/02 (L02)              */
/*				 (ｶﾞｲﾌﾞ ﾘｮｳｲｷ ﾉ ｼｮｷｶ ｼｮﾘ ﾂｲｶ)						 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'88/06/16 (L03)				 */
/*			 	 (ﾎﾘｭｳ ﾃﾞ-ﾀ ｼｭﾄｸ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) --- TC1350		 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'88/06/21 (L04)				 */
/*				 (ﾎﾞﾘｭ-ﾑ ﾍｲｿｸ ｷﾉｳ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC911		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼｬ : 渡邉　基樹				'93/11/01  					 */ 
/*														   TD-@1	 */
/*														   TD-00	 */
/*				 （Ｖ閉塞通知削除の変更に伴う修正）		   TD-47	 */
/*				 （ログの見直しに伴う修正）				   TD-50	 */
/*		変更者 : 杉岡  克也				'95/05/16 --- CT1039(ST2764) */
/*				 (SCSIﾘｾﾂﾄ機能の見直しに伴う変更)			TD-61    */
/*		変更者 : 杉岡  克也				'96/02/07 --- ST3699		 */
/*				 (ﾎﾂﾄｽﾀﾝﾊﾞｲ予備系mr_jopn失敗時対処)					 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:SU0046											 */
/*改造内容			:NOP関数版として提供していたが、NOP関数未対応版に*/
/*					:変更											 */
/*改造日			:2003.02.19										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*  ｲﾝｸﾙｰﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
#include	"psect.h"
#include	"mrcom.h"
#include	"mrmac.h"
#include	"mr.h"
#include	"mc.h"
#include	"tpct.h"
#include	"mo_wlg.h"					/*						TD50 */
#include	"mcdebug.h"					/*					ST3699	 */

/*********************************************************************/
/*  ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘｮｳｲｷ 												 */
/*********************************************************************/
extern		PSCPSECT	pscparea;				/* PSECT ﾘｮｳｲｷ		 */
extern		MRPCB		*mrpcbp ;				/* MRPCB ﾘｮｳｲｷ (L02) */

/*********************************************************************/
/*	ﾃﾞﾌｧｲﾝ ﾁ 														 */
/*********************************************************************/
										/* MRWLOG削除 1行		TD50 */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_PINT	0x6d725f70,0x696e7420

long	mr_pint()						/* ﾌﾟﾛｾｽ ｼｮｷｶ ｼｮﾘ 			 */
{
	/*****************************************************************/
	/*  mr_pint ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	mc_ccom();					/* 文字列の比較		CT1039	 */
	long	mr_ptbl();					/* ﾃｰﾌﾞﾙ ｹﾝｻｸ ｼｮﾘ  			 */ 
	long	mr_jopn();					/* ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ｵｰﾌﾟﾝ ｼｮﾘ	 */
	void	mo_wlg4();					/* Sﾄﾚｰｽ情報の取得		TD50 */

	/*****************************************************************/
	/*  mr_pint ﾅｲ ﾜｰｸ ｴﾘｱ								 			 */
	/*****************************************************************/
	register	long		retcd;		/* ﾘﾀｰﾝﾁ ｶｸﾉｳ ｴﾘｱ			 */
	register	TPCTPSZ		*tpctp;		/* PCT ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ ﾎﾟｲﾝﾀ	 */
				long		rc;			/* 返却値格納領域	CT1039	 */
				long		mrlog[1];	/* ﾛｸﾞ ｼﾞｮｳﾎｳ ﾍﾝｼｮｳ ﾘｮｳｲｷ	 */

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
	PRINT0("--- mr_pint START --- \n");					/*	ST3699	 */
										/* MRWLOG削除 1行		TD50 */
	mo_wlg4(MR_PINT,WINSC,(long *)0,0L);/*						TD50 */
										/* MRWLOG削除 2行		TD50 */

	/*****************************************************************/
	/*  MRPCB ﾉ ｼｮｷｶ, ﾃｰﾌﾞﾙ.ｱﾄﾞﾚｽ ﾉ ｾｯﾃｲ ｦ ｵｺﾅｳ 					 */
	/*****************************************************************/
	retcd = mr_ptbl();
	if (retcd!=MRNORMAL) {				/* ｴﾗｰ ｶ ?					 */
		mrlog[0] = retcd;
		mo_wlg4(MR_PINT,0x33331000L,mrlog,4L);
										/*						TD50 */
		goto error;
	}
	else;

	/*****************************************************************/
	/*  ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ﾉ ｵｰﾌﾟﾝ ﾖｳ.ﾌﾖｳ ﾉ ﾊﾝﾃｲ 		 	 				 */
	/*****************************************************************/
	tpctp = (TPCTPSZ *)MRTBLAD(pscparea.pscpctad,
							   pscparea.pscpctno+1); 
										/* PCT ｶﾞｲﾄｳ ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ	 */
	rc = mc_ccom( tpctp->tpcttyp, "CE", 2 );
										/* ﾌﾟﾛｸﾞﾗﾑ種別の比較CT1039	 */
	if ( rc == 0L )       				/* 発行元mrgか?		CT1039	 */
	{									/*					CT1039	 */
		goto	end;					/* JNLをｵ-ﾌﾟﾝしない CT1039	 */
	}									/*					CT1039	 */
	else;								/* 発行元がmrg以外  CT1039	 */

	if (tpctp->tpctjnl>=0 &&
		mrpcbp->mrpnsrc==MRPNRNEC) {
		retcd = mr_jopn((char *)0,
						MRAPMODE);
		if ((retcd==MRNOMEM) ||
			(retcd==MCEOSERR)||
			(retcd==MRRJONEC)) {		/*					ST3699	 */
			mrlog[0] = retcd;
			mo_wlg4(MR_PINT,0x33331001L,mrlog,4L);
										/*						TD50 */
			goto error;
		}
		else;
	}
	else;

				         				/* 閉塞完了情報の設定を		 */
										/* 削除する 			TD47 */

end :									/*					CT1039	 */
	/*****************************************************************/
	/*  ﾍﾝｷｬｸﾁ ｦ ｾｯﾃｲ ｽﾙ		 							 		 */
	/*****************************************************************/
	PRINT1("--- mr_pint END(%d) --- \n",retcd);			/*	ST3699	 */
										/* MRWLOG削除 1行		TD50 */
	mrlog[0] = MRNORMAL;
	mo_wlg4(MR_PINT,WOTSC,mrlog,4L);	/*						TD50 */
										/* MRWLOG削除 2行		TD50 */

	return(MRNORMAL);

error :
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
	PRINT1("--- mr_pint ERR-END(%d) --- \n",retcd);		/*	ST3699	 */
										/* MRWLOG削除 1行		TD50 */
	mrlog[0] = retcd;
	mo_wlg4(MR_PINT,WOTSC,mrlog,4L);	/*						TD50 */
										/* MRWLOG削除 2行		TD50 */

	return(retcd);
}
