/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_pffj														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾌｱｲﾙ ｺｳｼﾝ ｼﾞﾔ-ﾅﾙ ﾖﾘ ｶﾞｲﾄｳ ﾌｱｲﾙ ｦ ｺｳｼﾝ ｽﾙ.					 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		buf	:	ﾌｱｲﾙ ｼﾞﾔ-ﾅﾙ ｾﾝﾄｳ ｱﾄﾞﾚｽ								 */
/*		prb	:	ｷﾖｳﾂｳ ｼﾞﾖｳﾎｳ ｾﾂﾃｲ ﾘﾖｳｲｷ								 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		0	:	ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ										 */
/*		-1	:	ｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ										 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ				'					 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				' (L01)				 */
/*			 	 (AP ﾌﾞﾝｻﾝ ﾀｲｵｳ ﾉ ｶｲｿﾞｳ) --- STC448					 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ			 	' (L02)				 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｼｮﾘ ﾂｲｶ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者 : 渡邉　基樹				'94/01/18					 */
/*				 (ログの見直しに伴う修正)					TD-50	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*	NOP対応	修正 START 							修正日：2003.04.04	 */
/*	リターンコードに正常値を設定し、不要なロジックは削除		 	 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"mr.h"						/*	返却値の引数定義		 */
#include	"mrprcv.h"
#include	"mrjnl.h"

long	mr_pffj(buff,prb)
register	MRJFJ	*buff;
register	MRPRB	*prb;
{
	/*****************************************************************/
	/*	返却値（正常）をリターンする								 */
	/*****************************************************************/
	return(MRNORMAL);					/*	返却値					 */
/*********************************************************************/
/*	NOP対応	修正 END 							修正日：2003.04.04	 */
/*********************************************************************/
}
