/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_prcx														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾌﾟﾛｾｽ ｲｼﾞﾖｳ ﾄ ﾅﾂﾀﾄｷ ﾄﾗﾝｻﾞｸｼﾖﾝ ｷﾕｳｻｲ ﾉ ﾀﾒﾉ ﾏｴ ｼｮﾘ ｦ ｽﾙ		 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		class	:	ﾚｲｶﾞｲ ｼﾕﾍﾞﾂ										 */
/*		code	:	ﾚｲｶﾞｲ ｺ-ﾄﾞ										 */
/*																	 */
/*	6 ﾍﾝｼﾔｸﾁ														 */
/*		ﾅ ｼ															 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼｬ : ｳﾁﾀﾞ ﾕｳｽｹ											 */
/*		ｻｸｾｲｼｬ : ｳﾁﾀﾞ ﾕｳｽｹ				'88/08/11					 */
/*		変更者 : 佐藤　亘				'93/12/24					 */
/*				 (ログの見直しに伴う修正)					TD-50	 */
/*				 (電文消失の回避による変更)					TD-75	 */
/*				 (ｼｽﾃﾑｺｰﾙのｲﾝﾀｰﾌｪｰｽ変更による削除)			TD-95	 */
/* ＜ソース修正者名＞				Com'App 山口					 */
/* ＜ソース修正年月日及び修正ＩＤ＞	１９９６年０７月０４日	ST4460	 */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"tpct.h"
#include	"tcom.h"
#include	"psect.h"
#include	"mrmac.h"
#include	"mrcode.h"
#include	"mcdebug.h"
#include	"osexdef.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*	ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘﾕｳｲｷ												 */
/*********************************************************************/
extern	PSCPSECT	pscparea;			/* ｼｽﾃﾑ ｷﾖｳﾂｳ PSECT ﾘﾖｳｲｷ	 */

/*********************************************************************/
/*	define ﾁ														 */
/*********************************************************************/
#define	MRWLOG	pscparea.pscobaad		/* ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｴﾘｱ	 */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_PRCX	0x6d725f70,0x72637820

/*****************************************************************/
/*	2003-03-24  修正 START 										 */
/*  void型からlong型に変更										 */
/*****************************************************************/
//void	mr_prcx(class,code)

long	mr_prcx(class,code)
register	long	class;
register	long	code;
/*****************************************************************/
/*	2003-03-24  修正 END										 */
/*  void型からlong型に変更										 */
/*****************************************************************/
{
	/*****************************************************************/
	/*	mr_prcx ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	void	mo_wlg4();					/* 障害解析情報取得		TD50 */
	
	/*****************************************************************/
	/*	2003-03-24  修正 START 										 */
	/*  osterm()の発行しない										 */
	/*****************************************************************/
	//long	osterm();					/*						TD75 */
	/*****************************************************************/
	/*	2003-03-24  修正 END 										 */
	/*  osterm()の発行しない										 */
	/*****************************************************************/
	

	/*****************************************************************/
	/*	mr_prcx ﾅｲ ﾜ-ｸ ｴﾘｱ											 */
	/*****************************************************************/
	register	TPCTPSZ	*tpctp;			/* TPCT ｺﾍﾞﾂﾌﾞ ﾎﾟｲﾝﾀ		 */
	register	short	 endcd; 		/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｶｸﾉｳ ｲｷ		 */
	register	long	 ecd;			/* 終了ｺｰﾄﾞ編集領域		TD75 */
				long	 mrlog[2];		/* ﾛｸﾞｼﾞｮｳﾎｳ ﾍﾝｼｭｳﾘｮｳｲｷ 	 */

	PRINT0("mr_prcx() : START\n");
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = class;					/* ﾚｲｶﾞｲ ｼｭﾍﾞﾂ				 */
	mrlog[1] = code;					/* ﾚｲｶﾞｲ ｺｰﾄﾞ				 */
	mo_wlg4(MR_PRCX,WINSC,mrlog,8L);	/* 						TD50 */

	/*****************************************************************/
	/*	ﾚｲｶﾞｲ ｼｭﾍﾞﾂ ﾆ ﾖﾙ ﾌﾘﾜｹ ﾄ PCT ﾍﾉ ｺｰﾄﾞ ｾｯﾃｲ					 */
	/*****************************************************************/
	endcd = 0L;							/* 終了ｺｰﾄﾞの初期化		TD95 */
	switch(class){						/* ﾚｲｶﾞｲ ｼｭﾍﾞﾂ ﾆ ﾖﾙ ﾌﾘﾜｹ	 */
	case OSEXIBUS:						/* ﾊﾞｽｴﾗｰ ﾉ ﾊﾞｱｲ...			 */
		endcd = MREPRCVBUS;				/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		break;
	case OSEXIADR:						/* ｱﾄﾞﾚｽ ｴﾗｰ ﾊﾞｱｲ			 */
		endcd = MREPRCVADR;				/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		break;
	case OSEXIILL:						/* ﾌﾄｳ ﾒｲﾚｲ ﾉ ﾊﾞｱｲ			 */
		endcd = MREPRCVILL;				/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		break;
	case OSEXIDVD:						/* ｾﾞﾛ ｼﾞｮｻﾞﾝ ﾉ ﾊﾞｱｲ		 */
		endcd = MREPRCVDVD;				/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		break;

	/*****************************************************************/
	/*	OSの機能変更により、ｽﾀｯｸ異常に対応する処理を削除			 */
	/*	(削除ｽﾃｯﾌﾟ数 : 4)										TD95 */
	/*****************************************************************/

	case OSEXIILK:						/* ｶｰﾈﾙ ｺｰﾙ ｼﾖｳ ｱﾔﾏﾘ		 */
		endcd = MREPRCVILK;				/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		break;
	case OSEXIUSR:						/* ﾕｰｻﾞ ﾚｲｶﾞｲ ｼﾃｲ			 */
		endcd = MREPRCVUSR;				/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		break;
	default:							/* ｿﾉﾀ ﾉ ﾚｲｶﾞｲ ｼｭﾍﾞﾂ		 */
		break;
	}

	tpctp = (TPCTPSZ *)MRTBLAD(pscparea.pscpctad,pscparea.pscpctno+1);
										/* PCT ｶﾞｲﾄｳ ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ	 */

										/* ST4460 start				 */
	ecd = (tpctp->tpctmflg == TPCTMKNE)? 0x80130000L : 0x80030000L;
	ecd |= (0x0000FFFFL & endcd);		/* 終了ｺｰﾄﾞの編集		TD75 */
										/* ST4460 end				 */
	tpctp->tpctecd = ecd;				/* 終了ｺｰﾄﾞの設定		TD75 */
	tpctp->tpctdtl = code;				/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ ｾｯﾃｲ		 */

	/*****************************************************************/
	/*	OSの機能変更により、ﾌﾟﾛｾｽ終了例外ﾊﾝﾄﾞﾗmr_prcvの直接呼び出し	 */
	/*	に関する処理を削除											 */
	/*	(削除ｽﾃｯﾌﾟ数 : 27)										TD95 */
	/*****************************************************************/

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = ecd;						/* ﾃﾞﾌｫﾙﾄ ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ ﾍ ﾌｯｷ	 */
	mo_wlg4(MR_PRCX,WBSYS | OSTERM,mrlog,4L);
										/* 						TD50 */
	PRINT0("mr_prcx() : END\n");
	
	/*****************************************************************/
	/*	2003-03-24  修正 START 										 */
	/*  osterm()の発行しない										 */
	/*  終了コードを返却											 */
	/*****************************************************************/
	// osterm(ecd);						/* ﾌﾟﾛｾｽの終了			TD75 */
	
	return(ecd);
	/*****************************************************************/
	/*	2003-03-24  修正 END 										 */
	/*  osterm()の発行しない										 */
	/*  終了コードを返却											 */
	/*****************************************************************/

}
