/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_pfil														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ｼﾞﾔ-ﾅﾙ ｦ ﾖﾐｺﾐ ﾃ-ﾌﾞﾙ ﾏﾀﾊ ﾌｱｲﾙ ﾉ ﾌﾂｷﾕｳ ｦ ｵｺﾅｳ					 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		prb	:	ｷﾖｳﾂｳ ｼﾞﾖｳﾎｳ ｾﾂﾃｲ ﾘﾖｳｲｷ								 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		0	:	ｾｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ										 */
/*		-1 :	ｲｼﾞﾖｳ ｼﾕｳﾘﾖｳ										 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ				'					 */
/*		ﾍﾝｺｳｼﾔ : ﾉｸﾞﾁ ﾏｽｵ				'87/09/28 (L01)				 */
/*				 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) --- STC395			 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ			 	' (L02)				 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｼｮﾘ ﾂｲｶ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者 : 渡邉　基樹				'94/01/18					 */
/*				 （ログの見直しに伴う修正）					TD-50　　*/
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*	NOP対応	修正 START 							修正日：2003.04.04	 */
/*	リターンコードに正常値を設定し、不要なロジックは削除		 	 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"mr.h"						/*	返却値の引数定義		 */
#include	"mrprcv.h"

long	mr_pfil(prb)
register	MRPRB	*prb;
{
	/*****************************************************************/
	/*	返却値（正常）をリターンする								 */
	/*****************************************************************/
	return(MRNORMAL);					/*	返却値					 */
/*********************************************************************/
/*	NOP対応	修正 END 							修正日：2003.04.04	 */
/*********************************************************************/
}
