/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_prcv														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾌﾟﾛｾｽ ｲｼﾞﾖｳ ﾄ ﾅﾂﾀﾄｷ ﾄﾗﾝｻﾞｸｼﾖﾝ ｦ ｷﾕｳｻｲ ｽﾙ.					 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		class	:	ﾚｲｶﾞｲ ｼﾕﾍﾞﾂ										 */
/*		code	:	ﾚｲｶﾞｲ ｺ-ﾄﾞ										 */
/*																	 */
/*	6 ﾍﾝｼﾔｸﾁ														 */
/*		ﾅ ｼ															 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ				'					 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'87/07/08 (L01)				 */
/*				 (FIP ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ﾃﾞｸﾞﾁ ﾉ ﾖﾋﾞﾀﾞｼ ｼｮﾘ ﾂｲｶ)			 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ 				'88/04/08 (L02)				 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｼｮﾘ ﾂｲｶ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ｳﾁﾀﾞ ﾕｳｽｹ				' (L03)				 */
/*				 (ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ  ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ)	--- TC1990	 */
/*		ﾍﾝｺｳｼﾔ : ﾏｴｻﾞﾜ ｱｷﾗ				'89/12/06 (L04)	--- TC2715	 */
/*		変更者 : 佐藤　亘				'93/11/24			TD-00	 */
/*				 (複数回ｱﾎﾞｰﾄ変更による変更)				TD-07	 */
/*				 (ﾛｸﾞの見直しに伴う修正)					TD-50	 */
/*				 (終了ｺｰﾄﾞの拡張による変更)					TD-64	 */
/*				 (ｱﾎﾞｰﾄじﾌﾘｰｽﾞ取得による変更)				TD-91	 */
/*				 (ｼｽﾃﾑｺｰﾙのｲﾝﾀｰﾌｪｰｽ変更による削除)			TD-95	 */
/*				 (内部事情による変更)						TD-@1	 */
/*		変更者 : 山本  智也				'95/07/04			SSCY0090 */
/*				 (ｍｄ＿ｐｔｒｍ呼び出し)							 */
/*      変更者 : 杉岡  克也				'95/08/21 --- ST3060		 */
/*               (MS及びOSによる強制終了時の対処)					 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:KL0004 										 */
/*改造内容			:TABP関連情報削除漏れ							 */
/*改造日			:2003.02.19										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
#include	"tbkt.h"
/*********************************************************************/
/*	KL0004  修正 START 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
/*********************************************************************/
/*	KL0004  修正 END 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
#include	"tpct.h"
#include	"ttct.h"
#include	"tjct.h"
#include	"tsst.h"
#include	"tcst.h"
#include	"tbpt.h"
#include	"tsrt.h"
#include	"psect.h"
#include	"mopcb.h"
#include	"mrprcv.h"
#include	"mr.h"
#include	"mrcom.h"
#include	"mrj.h"
#include	"mrmac.h"
#include	"mf.h"
#include	"mfcom.h"
#include	"mrcode.h"
#include	"mcdebug.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*	2003-03-24  修正 START 										     */
/*  OSEXITRMの利用のためosexdef.hを追加							     */
/*	osrstex.h を削除												 */
/*********************************************************************/

//#include	"osrstex.h"					/*					   (L03) */
#include    "osexdef.h"

/*********************************************************************/
/*	2003-03-24  修正 END 										     */
/*  OSEXITRMの利用のためosexdef.hを追加							     */
/*	osrstex.h を削除												 */
/*********************************************************************/


/*********************************************************************/
/*	ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘﾕｳｲｷ												 */
/*********************************************************************/
extern	PSCPSECT	pscparea;			/* ｼｽﾃﾑ ｷﾖｳﾂｳ PSECT ﾘﾖｳｲｷ	 */
extern	MOPSCPCB	*mopcbp;		 	/* MOPSCPCB ﾎﾟｲﾝﾀ			 */

/*********************************************************************/
/*	define ﾁ 														 */
/*********************************************************************/
#define	MRWLOG	pscparea.pscobaad		/*					   (L02) */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_PRCV	0x6d725f70,0x72637620

/*********************************************************************/
/*	2003-03-24  修正 START 										     */
/*  void型からlong型に変更										     */
/*********************************************************************/
//void	mr_prcv(class,code)

long	mr_prcv(class,code)
long	class;
long	code;
/*********************************************************************/
/*	2003-03-24  修正 END 										     */
/*  void型からlong型に変更										     */
/*********************************************************************/
{
	/*****************************************************************/
	/*	mr_prcv ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	mf_rdeq();					/*							 */
	long	mf_fdcn();					/*							 */
	void	mf_prcv();					/*					   (L01) */
	void	mr_sdwn();					/*							 */
	void	mr_peri();					/*							 */
	
	long	mr_prec();					/*	今回対象外 2003-03-24	 */


	void	md_ptrm();					/* ｲﾝﾀﾌｪｰｽ追加 		SSCY0090 */
	void	mo_wlg4();					/*				  (L02) TD50 */
	
	/*****************************************************************/
	/*	2003-03-24  修正 START 										 */
	/*  osrstex()からosrstex2()に変更								 */
	/*	osexith()発行しない			  								 */
	/*****************************************************************/
	//long	osrstex();					/* ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ ﾉ ｶｲｼﾞｮ (L03) */
	//long	osexith();					/*						TD@1 */
	
	long	osrstex2();					/* ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ ﾉ ｶｲｼﾞｮ (L03) */

	/*****************************************************************/
	/*	2003-03-24  修正 END 										 */
	/*  osrstex()からosrstex2()に変更								 */
	/*	osexith()発行しない			  								 */
	/*****************************************************************/

	/*****************************************************************/
	/*	mr_prcv ﾅｲ ﾜ-ｸ ｴﾘｱ											 */
	/*****************************************************************/
				MRPRB	prb;			/* ｷﾖｳﾂｳ ｼﾞﾖｳﾎｳ ｾﾂﾃｲ ﾘﾖｳｲｷ	 */
	register	TPCTPSZ	*tpctp;			/* TPCT ｺﾍﾞﾂﾌﾞ ﾎﾟｲﾝﾀ		 */
	register	long	 rc;			/* ﾘﾀﾝ ｺ-ﾄﾞ					 */
	register	char	 errid;			/* ｱﾎﾞ-ﾄ ｹﾞﾝｲﾝ ｼｷﾍﾞﾂ		 */
	register	long	 dtl;			/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ ｶｸﾉｳ ｲｷ 	 */
				long	mrlog[7];		/* ﾛｸﾞｼﾞｮｳﾎｳ ﾍﾝｼｭｳﾘｮｳｲｷ(L02) */
															/* 	TD50 */
															
	/*****************************************************************/
	/*	2003-03-24 追加 START 										 */
	/*****************************************************************/
				long 	lCnt;			/* ループカンウタ			 */
				long    lRet;			/* mr_prcx()の返却値		 */	
	/*****************************************************************/
	/*	2003-03-24 追加 END 										 */
	/*****************************************************************/	
															

	PRINT2("	**  PROCESS RECOVER START. class = 0x%08x ,code = 0x%08x **\n",class,code);

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = class;					/*					   (L02) */
	mrlog[1] = code;					/*					   (L02) */
	mo_wlg4(MR_PRCV,WINSC,mrlog,8L);	/*				  (L02) TD50 */

	/*****************************************************************/
	/*	例外ﾊﾝﾄﾞﾗの解除											TD00 */
	/*****************************************************************/
	mrpcbp->mrprcst = MRPRCRUN ;	/* mr_prcv ｿｳｺｳ ﾌﾗｸﾞｦ ﾀﾃﾙ  (L03) */
									/* ｾﾞﾝ ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗｦ ｷﾘﾊﾅｽ		 */
										/* MRWLOG削除 3行		TD50 */
										
	/*****************************************************************/
	/*	2003-03-24  修正 START 										 */
	/*  osrstex()はosrstex2()を変更する								 */
	/*  シグナル番号は(1)〜(31)にセットするため例外ハンドラの		 */
	/*  登録する処理を削除											 */
	/*****************************************************************/
	for(lCnt = 1; lCnt < 32; lCnt++) 
	{
										/*				  (L03) TD50 */
		osrstex2(lCnt);				/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	}									
	

#ifdef  LINUX_ISOKUTAIOU
										
	mrlog[0] = OSEXITRM;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXITRM);				/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
										/*						TD50 */

										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = OSEXIBUS;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXIBUS);				/* ﾊﾞｽ ｴﾗｰ      ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
										/*						TD50 */

										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = OSEXIADR;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXIADR);				/* ｱﾄﾞﾚｽ ｴﾗｰ    ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
										/*						TD50 */

										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = OSEXIILL;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXIILL);				/* ﾌﾄｳ ﾒｲﾚｲ     ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
										/*						TD50 */

										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = OSEXIDVD;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXIDVD);				/* ｾﾞﾛ ｼﾞｮｻﾞﾝ   ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
										/*						TD50 */

	/*****************************************************************/
	/*	OSの機能変更に伴い、ｽﾀｯｸ異常に対する例外ﾊﾝﾄﾞﾗの解除を削除	 */
	/*	(削除ｽﾃｯﾌﾟ数 : 6)										TD95 */
	/*****************************************************************/

										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = OSEXIILK;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXIILK);				/* ｶｰﾈﾙｺｰﾙ ｱﾔﾏﾘ ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
										/*						TD50 */

										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = OSEXIUSR;				/*					   (L03) */
	mo_wlg4(MR_PRCV,WBSYS | OSRSTEX,mrlog,4L);
										/*				  (L03) TD50 */
	osrstex(OSEXIUSR);				/* ﾕｰｻﾞ ﾃｲｷﾞ    ﾚｲｶﾞｲ ﾊﾝﾄﾞﾗ (L03)*/
	mo_wlg4(MR_PRCV,WASYS | OSRSTEX,(long *)0,0L);
	
	
#endif
	
	/*****************************************************************/
	/*	2003-03-24  修正 END 										 */
	/*  osrstex()はosrstex2()を変更する								 */
	/*  シグナル番号は(1)〜(31)にセットするため例外ハンドラの		 */
	/*  登録する処理を削除											 */
	/*****************************************************************/
	
	
										/*						TD50 */
	md_ptrm();							/* ｲﾝﾀﾌｪｰｽ追加 		SSCY0090 */

	/*****************************************************************/
	/*	故障ｺｰﾄﾞ／詳細情報の設定								TD00 */
	/*****************************************************************/
	tpctp = (TPCTPSZ *)MRTBLAD(pscparea.pscpctad,pscparea.pscpctno+1);
	if ((tpctp->tpctecd == 0L) &&		/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ﾁｪｯｸ	   (L03) */
		(tpctp->tpctdtl == 0L)){		/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ ﾁｪｯｸ   (L03) */
		tpctp->tpctecd = (MREPRCVTRM & 0x0000FFFFL) |		/* (L03) */
							(code & 0xFFFF0000L);			/* (L03) */
										/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｾｯﾃｲ			 */
		tpctp->tpctdtl = code;			/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ ｾｯﾃｲ   (L03) */
	}														/* (L03) */
	else;													/* (L03) */
	prb.mrprabc  = tpctp->tpctecd;	 	/* ｱﾎﾞｰﾄ ｺｰﾄﾞ ｾｯﾄ	   (L03) */
	prb.mrprabd  = tpctp->tpctdtl;		/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ ｾｯﾄ	   (L03) */
	prb.mrprabd2 = tpctp->tpctdtl2;		/* 詳細情報2の設定		TD64 */
	prb.mrprabd3 = tpctp->tpctdtl3;		/* 詳細情報3の設定		TD64 */

	PRINT0("mr_prcv() : goto mr_peri\n");
	mr_peri(&prb);						/* ｲｼﾞﾖｳ ｼﾞﾖｳﾎｳ ｼﾕﾂﾘﾖｸ		 */
	PRINT0("mr_prcv() : return mr_peri\n");

	/*****************************************************************/
	/*	ｱﾎﾞｰﾄ発生回数の許容範囲ﾁｪｯｸ								TD00 */
	/*****************************************************************/
	(tpctp->tpctabtn)++;				/* ｱﾎﾞｰﾄ回数のｶｳﾝﾄｱｯﾌﾟ	TD07 */
	if ((tpctp->tpctdwnf) == '0') {		/* ﾀﾞｳﾝ回避ﾌﾗｸﾞのﾁｪｯｸ	TD07 */
		if ((tpctp->tpctabtm) != 0) {	/* 許容値が0以外の時	TD07 */
			if ((tpctp->tpctabtn) >= (tpctp->tpctabtm)) {
										/* ｱﾎﾞｰﾄ回数がｵｰﾊﾞｰ		TD07 */
				mrlog[0] = (long)tpctp->tpctabtn;			/*	TD07 */
				mo_wlg4(MR_PRCV,0x33331000,mrlog,4L);		/*	TD07 */
				mr_sdwn(MRSTART, MREPRCV, MRDPABTERR);
										/*						TD07 */
 			}							/*						TD07 */
			else;						/*						TD07 */
		}								/*						TD07 */
		else {							/*						TD07 */
			if ((tpctp->tpctabtn) >= (mopcbp->mopscstp->tcstabtn)) {
										/* ｱﾎﾞｰﾄ回数がｵｰﾊﾞｰ		TD07 */
				mrlog[0] = (long)tpctp->tpctabtn;			/*	TD07 */
				mo_wlg4(MR_PRCV,0x33331001,mrlog,4L);		/*	TD07 */
				mr_sdwn(MRSTART, MREPRCV, MRDPABTERR);
										/*						TD07 */
			}							/*						TD07 */
			else;						/*						TD07 */
		}								/*						TD07 */
	}									/*						TD07 */
	else;								/*						TD07 */

	/*****************************************************************/
	/*	ﾌﾘｰｽﾞﾌｧｲﾙの取得											TD00 */
	/*****************************************************************/
	if ( 0x00030000L == ( code & 0x000F0000L ))			/*	ST3060	 */
	{									/* 重大度3の時		ST3060	 */
		if ((tpctp->tpctabt) == 'D') {	/* ﾌﾘｰｽﾞﾌｧｲﾙ取得要		TD91 */
			PRINT0("mr_prcv() : get fleez file\n");
			mr_sdwn(MRSTART, MREPRCV, MRDFLZFILE);	/*	  		TD91 */
		}								/*						TD91 */
		else;							/*						TD91 */
	}									/*					ST3060	 */
	else;								/*					ST3060	 */

/*********************************************************************/
/*	S-TC2715		(L04)											 */
/*********************************************************************/
	if(mrjcfp->mrjckfg != MRJKJON){		/*						TD@1 */
		if((mrjcfp->mrjcsts&MRJENQF) != 0){	
										/* ｼﾞﾔ-ﾅﾙ ENQﾌﾗｸﾞ ｵﾝ?		 */
			mrlog[0] = (long)mrjcfp->mrjcsts;
										/*					   (L02) */
			mo_wlg4(MR_PRCV,0x33331002,mrlog,4L);
										/*					   (L02) */
			mr_sdwn(MRSTART, MREPRCV, MRDNODEQTCT);
										/* ｼｽﾃﾑ ﾀﾞｳﾝ 			TD@1 */
		}								/*							 */
		else;							/*							 */
	}
	else;
/*********************************************************************/
/*	E-TC2715		(L04)											 */
/*********************************************************************/

	/*****************************************************************/
	/*	PCAｽﾃｰﾀｽ排他ﾁｪｯｸ										TD00 */
	/*****************************************************************/
	if ((mrpcbp->mrpenqf&(MRPENQT)) != 0){	/* TDT ENQ?				 */
		mrlog[0] = (long)mrpcbp->mrpenqf;	/*				   (L02) */
		mo_wlg4(MR_PRCV,0x33331003,mrlog,4L);/*				   (L02) */
		mr_sdwn(MRSTART, MREPRCV, MRDNODEQTDT);
										/* ｼｽﾃﾑﾀﾞｳﾝ				TD@1 */
	}									/*							 */
	else;								/*							 */
	mf_prcv();							/* FIP ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ﾃﾞｸﾞﾁ(L01)*/
	mf_fdcn((char *)0,(char *)0,(char *)0);
										/* ﾌｱｲﾙ ﾉ ﾚﾝｹﾂ ｶｲｼﾞﾖ		 */

	/*****************************************************************/
	/*	仕様変更	修正 START					修正日：2003.04.04	 */
	/*																 */
	/*	mf_fdcn()とmr_prec()の間にﾄﾗﾝｻﾞｸｼｮﾝ状態(prb.mrprsta)を		 */
	/*	ﾄﾗﾝｻﾞｸｼｮﾝ開始前(0x00)に設定するように修正					 */
	/*****************************************************************/
	prb.mrprsta = MRNOTRAN;				/* ﾄﾗﾝｻﾞｸｼｮﾝ開始前(0x00)設定 */
	/*****************************************************************/
	/*	仕様変更	修正 END					修正日：2003.04.04	 */
	/*****************************************************************/

	/*****************************************************************/
	/*	復旧処理												TD00 */
	/*****************************************************************/
	PRINT0("mr_prcv() : goto mr_prec\n");

	rc = mr_prec(&prb);					/* ﾌﾟﾛｾｽ ﾌﾂｷﾕｳ ｼﾖﾘ		 */

	PRINT0("mr_prcv() : return mr_prec\n");

	if (rc < 0L){						/* ｴﾗ-?						 */
		mrlog[0] = rc;					/*					   (L02) */
		mo_wlg4(MR_PRCV,0x33331004,mrlog,4L);/*				   (L02) */
		mr_sdwn(MRSTART, MREPRCV, prb.mrprdwd);
										/* ｼｽﾃﾑﾀﾞｳﾝ				TD@1 */
	}									/*							 */
	else;				

	if (mrpcbp->mrpexf != 0){			/*							 */
		if ((prb.mrprabc&0x80000000L) == 0L){	/* ｱﾎﾞｰﾄ ｺｰﾄﾞ  (L03) */
			errid = MRPGMABT;			/* ｱﾎﾞ-ﾄ					 */
		}								/*							 */
		else{							/*							 */
			errid = MRROSABT;			/* ﾌﾟﾛｾｽ ﾚｲｶﾞｲ				 */
		}								/*							 */
										/*							 */
										/* MRWLOG削除 1行		TD50 */
		mrlog[0] = (long)errid;			/*					   (L02) */
		mrlog[1] = prb.mrprabc;			/*					   (L02) */
		mrlog[2] = prb.mrprabd;			/*					   (L02) */
		mrlog[3] = (long)prb.mrprsta;				/*		   (L02) */
		mrlog[4] = (long)mrpcbp->mrpmiad;			/*		   (L02) */
		mrlog[5] = prb.mrprabd2;					/*			TD50 */
		mrlog[6] = prb.mrprabd3;					/*			TD50 */
		mo_wlg4(MR_PRCV,0x44440000,mrlog,28L);		/*	  (L02) TD50 */
		(*(mrpcbp->mrpexf))	 			/* APﾚｲｶﾞｲ ｶﾝｽｳ ﾖﾋﾞﾀﾞｼ		 */
				(errid,					/* ｱﾎﾞｰﾄ原因識別		TD@1 */
				 prb.mrprabc,			/* 終了ｺｰﾄﾞ				TD@1 */
				 prb.mrprabd,			/* 詳細情報				TD@1 */
				 prb.mrprsta,			/* ﾄﾗﾝｻﾞｸｼｮﾝ状態		TD@1 */
				 mrpcbp->mrpmiad,		/* 入力電文MIAｱﾄﾞﾚｽ		TD@1 */
				 prb.mrprabd2,			/* 詳細情報２			TD64 */
				 prb.mrprabd3);			/* 詳細情報３			TD64 */

										/* MRWLOG削除 3行		TD50 */
		mo_wlg4(MR_PRCV,0x4444F000,(long *)0,0L);	/* 	  (L02) TD50 */
										/*							 */
	}									/*							 */
	else;								/*							 */

	/*****************************************************************/
	/*	終了処理												TD00 */
	/*****************************************************************/
	MFENQCHK(MFCHKOFF);
	PRINT0("mr_prcv() : goto mf_rdeq\n");
	rc = mf_rdeq((long *)0,0L);			/* ｾﾝﾕｳ ｼｹﾞﾝ ﾉ ｶｲｼﾞﾖ		 */
	PRINT0("mr_prcv() : return mf_rdeq\n");
	if (rc != MFNORMAL){				/* ｴﾗｰ 						 */
		mrlog[0] = rc;					/*					   (L02) */
		mo_wlg4(MR_PRCV,0x33331005,mrlog,4L);/*			  (L02) TD50 */
		mr_sdwn(MRSTART, MREPRCV, MRDDEQERR);
										/* ｼｽﾃﾑﾀﾞｳﾝ				TD@1 */
	}									/*							 */
	else;								/*							 */
	tpctp->tpctpst = 1;					/* ﾌﾟﾛｾｽ ｶｲｼ ｸﾌﾞﾝ ｵﾝ		 */
	mrpcbp->mrprcst = MRPRCSTP ;	   /* mr_prcv ｿｳｺｳ ﾌﾗｸﾞｦ ｵﾛｽ(L03)*/

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mo_wlg4(MR_PRCV,WOTSC,(long *)0,0L);
										/* ﾛｸﾞ ｼｮﾄｸ		  (L03) TD50 */
	/*****************************************************************/
	/*	2003-03-24  修正 START 										 */
	/*  第一引数はOSEXITRM以外の場合はmr_prcx()呼び出し返却される終了*/
	/*  コードを取得する											 */
	/*	第一引数はOSEXITRMの場合は終了コード						 */
	/*	osexith()発行しない											 */
	/*****************************************************************/
	PRINT0("	**  PROCESS RECOVER NORMALY ENDED **\n");

//	osexith(-1);						/* ST0072               TD@1 */
	
	if(class != OSEXITRM)
	{
		lRet = mr_prcx(class,code);
	}
	else
	{
		lRet = code;	
	}			
	
	return(lRet);		

	/*****************************************************************/
	/*	2003-03-24  修正 END 										 */
	/*  第一引数はOSEXITRM以外の場合はmr_prcx()呼び出し返却される終了*/
	/*  コードを取得する											 */
	/*	第一引数はOSEXITRMの場合は終了コード						 */
	/*	osexith()発行しない											 */
	/*****************************************************************/
									
}
