/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ													 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_pftj														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾃ-ﾌﾞﾙ ｺｳｼﾝ ｼﾞﾔ-ﾅﾙ ﾖﾘ ｶﾞｲﾄｳ ﾃ-ﾌﾞﾙ ﾁ ｺｳｼﾝ ｽﾙ.					 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		buff	:	ﾃ-ﾌﾞﾙ ｼﾞﾔ-ﾅﾙ ｾﾝﾄｳ ｱﾄﾞﾚｽ							 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		ﾅ ｼ															 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾﾂｹｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		ｻｸｾｲｼﾔ : ﾀｹｳﾁ ｼﾝｲﾁ				'					 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ 			 	'87/10/19 (L01)				 */
/*			 	 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ) --- STC395			 */
/*		ﾍﾝｺｳｼﾔ : ﾔﾏﾓﾄ ﾕｳｼﾞ			 	' (L02)				 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｼｮﾘ ﾂｲｶ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者 : 佐藤　亘				'93/12/27					 */
/*				 (PUの独立化による変更)						TD-59	 */
/*				 (ログの見直しに伴う修正)					TD-50    */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*	NOP対応	修正 START 							修正日：2003.04.04	 */
/*	リターンコードに正常値を設定し、不要なロジックは削除		 	 */
/*********************************************************************/
/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｱｲﾙ													 */
/*********************************************************************/
#include	"mr.h"						/*	返却値の引数定義		 */
#include	"mrjnl.h"

void	mr_pftj(buff)
register	MRJTJ	*buff;
{
	/*****************************************************************/
	/*	返却値（正常）をリターンする								 */
	/*****************************************************************/
	return;							/*	返却値					 */
/*********************************************************************/
/*	NOP対応	修正 END 							修正日：2003.04.04	 */
/*********************************************************************/
}
