/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟﾂｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ｼｽﾃﾑｼｮｷｶ/ｼｭｳﾘｮｳ ｼｮﾘ											 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_sint														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾘｶﾊﾞﾘ ﾉ ｼｽﾃﾑﾅｲｶﾝｷｮｳ ﾉ ｼｮｷｶ ﾄ ﾘｶﾊﾞﾘ ﾉ ｷﾉｳ ｦ ｳｹﾙﾀﾒﾆﾋﾂﾖｳ ﾅ		 */
/*		ｶﾝｷｮｳ ﾉ ｼｮｷｶ ｦ ｵｺﾅｳ											 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		ﾅｼ															 */
/*																	 */
/*	6 ﾍﾝｷｬｸﾁ														 */
/*		MRNORMAL : ｾｲｼﾞｮｳ ｼｭｳﾘｮｳ									 */
/*		MRRJONEC : JNL再ｵ-ﾌﾟﾝ要										 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*		ｻｸｾｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ				'86/08/11					 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ				'87/06/18 (WLOG)			 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ				'87/09/01 (L01)				 */
/*				 (ﾊﾞｯｸｱｯﾌﾟ ｼﾞｬｰﾅﾙﾖｳ ﾛﾝﾘﾎﾞﾘｭｰﾑ ﾏｳﾝﾄ ｷﾉｳ 				 */
/*				  ﾉ ﾂｲｶ) --- STC350									 */
/*		ﾍﾝｺｳｼｬ : ﾏﾂｼﾀ ｴｲｼﾞ 				'87/09/24 (L02)				 */
/*				 (1 : ﾊﾞｯｸｱｯﾌﾟ ﾌﾖｳ ｼｽﾃﾑ ﾆ ｵｹﾙ ｼﾞｬｰﾅﾙ ｷﾘｶｴ ｼｮﾘ)		 */
/*				 (2 : ｳﾝﾃﾝ ｽﾃｰﾀｽ ﾂｲｶ ﾆ ﾄﾓﾅｳ ｼｭｳｾｲ)	   --- STC355	 */
/*		ﾍﾝｺｳｼｬ : ﾏﾂｼﾀ ｴｲｼﾞ 				'87/09/24 (L03)				 */
/*				 (ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ｻｲｽﾞ ﾉ ﾁｪｯｸ ｷﾉｳ ﾂｲｶ)	   --- STC346	 */
/*		ﾍﾝｺｳｼｬ : ﾏﾂｼﾀ ｴｲｼﾞ 				'87/09/24 (L04)				 */
/*				 (ｲｯﾊﾟﾝﾌｧｲﾙ ｿｳｻ ﾓｰﾄﾞ ｼﾝｾﾂ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) --- STC357	 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ  				'87/09/29 (L05)				 */
/*				 (ｵｲｶｹ ﾘｶﾊﾞﾘ ｶﾝﾚﾝ ｷﾉｳ ﾉ ｻｸｼﾞｮ)         --- STC395	 */
/*		ﾍﾝｺｳｼｬ : ﾏﾂｼﾀ ｴｲｼﾞ 				'88/05/19 (L06)				 */
/*				 (RCT ｳﾝﾖｳ ﾋﾂﾞｹ ｾｯﾃｲ ﾎｳﾎｳ ｼｭｳｾｲ)	   --- TC1277	 */
/*		ﾍﾝｺｳｼｬ : ｳﾁﾀﾞ ﾕｳｽｹ 				'88/08/04 (L07)				 */
/*				 (RBIﾌｧｲﾙ ﾑｺｳｶ ｷﾉｳ ﾉ ﾂｲｶ )      	   --- TC1229	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/11/14 (L08)				 */
/*				 (ｼﾞｬｰﾅﾙ ﾘｰﾄﾞ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) 	   --- TC1230	 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/30 (L09)				 */
/*				 (ﾘｶﾊﾞﾘ ﾌﾖｳ ｼﾞ ｵｰﾌﾟﾝ ｼｮﾘ ｼｭｳｾｲ)		   --- TC2215	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/11/14 (L10)				 */
/*				 (ｼﾞｬｰﾅﾙ ｼｮｷｶ ｷﾉｳ ﾂｲｶ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ) 	   --- TC3016	 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'90/10/24 (L11)				 */
/*				 (RBI ﾑｺｳｶ ﾊ, ｾｲｼﾞｮｳ ﾀﾁｱｹﾞｼﾞ ﾉﾐ ｵｺﾅｳ)  --- TC3816	 */
/*		変更者 : 佐藤　亘				'94/02/15			TD-00	 */
/*				 (他TC動作監視による変更)					TD-01	 */
/*				 (ﾎｯﾄｽﾀﾝﾊﾞｲ変更による変更)					TD-02	 */
/*				 (勘定ﾌｧｲﾙ操作による変更)					TD-42	 */
/*				 (ﾛｸﾞの見直しによる変更)					TD-50	 */
/*				 (PUの独立化による変更)						TD-59	 */
/*				 (不正時刻ﾁｪｯｸによる変更)					TD-80	 */
/*		変更者 : 杉岡  克也				'96/02/07	---	ST3699		 */
/*				 (ﾎﾂﾄｽﾀﾝﾊﾞｲ予備系mr_jopn失敗対処)					 */
/*		変更者 : 杉岡  克也				'96/05/08	CT1222(ST4317)	 */
/*		変更者 : 山本　智也 			'97/09/16	ST4983			 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:KL0004 										 */
/*改造内容			:TABP関連情報削除漏れ							 */
/*改造日			:2003.02.19										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
#include	"psect.h"
#include	"mrcom.h"
#include	"mrmuse.h"
#include	"tcst.h"
#include	"tsst.h"
#include	"tbpt.h"
#include	"tsrt.h"
#include	"tpct.h"
#include	"trbt.h"
/*********************************************************************/
/*	KL0004  修正 START 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
/*********************************************************************/
/*	KL0004  修正 END 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
#include	"mrs.h"
#include	"mopcb.h"
#include	"ttct.h"										/* (L02) */
#include	"trct.h"
#include	"mr.h"
#include	"mrmac.h"
#include	"mrcode.h"
#include	"osgtdat.h"
#include	"mcdebug.h"
#include	"ossstd.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*	ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘｮｳｲｷ												 */
/*********************************************************************/
extern		PSCPSECT	pscparea;		/* PSECT ﾘｮｳｲｷ				 */
extern		MOPSCPCB	*mopcbp;		/* MOPSCPCB ﾘｮｳｲｷ			 */

/*********************************************************************/
/*	define ﾁ														 */
/*********************************************************************/
#define	 MRSTAD		'N'					/* SST ｶｲｼｸﾌﾞﾝ ｾｲｼﾞｮｳ		 */
#define	 MRWLOG	 pscparea.pscobaad
										/* MRSSTTのdefineは未使用の為*/
										/* 削除					TD@1 */

/*********************************************************************/
/*	define function name for mo_wlg4							TD00 */
/*********************************************************************/
#define	MR_SINT	0x6d725f73,0x696e7420
long	mr_sint()
{
	/*****************************************************************/
	/*	mr_sint ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	void	mr_sjnc();					/* ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ﾁｪｯｸ ｼｮﾘ(L03) */
	long	mr_pint();					/* ﾌﾟﾛｾｽ ﾅｲ ｼｮｷｶ ｼｮﾘ		 */
	void	mr_srbc();					/* RBI ﾌｧｲﾙ ﾁｪｯｸ ｼｮﾘ		 */
	long	mr_somc();					/* ｵｰﾌﾟﾝ ﾓｰﾄﾞ ﾍﾝｶﾝ ｼｮﾘ (L02) */
										/*					ST3699	 */
	void	mr_sjud();					/* ｼﾞｬｰﾅﾙ ｷﾘｶｴ ｼｮﾘ	   (L02) */
	void	mr_srba();					/* RBI ﾃﾞ-ﾀｼｭﾄｸ ｲﾗｲ ｼｮﾘ		 */
	void	mr_sjnl();					/* ｼﾞｬ-ﾅﾙﾚｺ-ﾄﾞ ｼｭﾄｸ ｼｮﾘ		 */
	void	mr_sinf();					/* ｷｮｳﾂｳ ｼﾞｮｳﾎｳ ｾｯﾃｲ ｼｮﾘ	 */
															/* (L01) */
	void	mr_smnt();					/* ﾊﾞｯｸｱｯﾌﾟｼﾞｬｰﾅﾙ ﾏｳﾝﾄ ｼｮﾘ   */
	void	mr_sdwn();					/* ｼｽﾃﾑﾀﾞｳﾝ ｳｹﾂｹﾖｳｷｭｳｼｮﾘ	 */
	void	mo_down();					/* ｼｽﾃﾑﾀﾞｳﾝ ｳｹﾂｹﾖｳｷｭｳｼｮﾘ	 */
	void	mo_wlg4();					/* Cﾄﾚｰｽ情報の取得		TD50 */
	long	mr_jclr();					/* ｼﾞｬｰﾅﾙ ﾍｯﾀﾞ ｸﾘｱ	   (L02) */
	long	mr_jedt();					/* ｼﾞｬ-ﾅﾙﾃﾞ-ﾀ ﾉ ﾍﾝｼｭｳ		 */
	long	mc_pccn();					/* ﾊﾟｯｸﾃﾞ-ﾀ -> ｷｬﾗｸﾀﾃﾞ-ﾀ	 */
	long	osgtdat();					/* ﾏｼﾝ ﾋﾂﾞｹ ﾉ ｶｸﾄｸ			 */
	long	mr_jcls();					/* ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ﾉ ｸﾛｰｽﾞ (L08) */

	/*****************************************************************/
	/*	mr_sint ﾅｲ ﾜ-ｸ ｴﾘｱ											 */
	/*****************************************************************/
	MRSCB		scb;					/* MRSCB ﾘｮｳｲｷ				 */
	register	long		retcd;		/* ﾘﾀ-ﾝﾁ ｶｸﾉｳ ｴﾘｱ			 */
	register	TTCTPSZ		*ttctp;		/* TCTｺﾍﾞﾂﾌﾞｱﾄﾞﾚｽ ﾎﾟｲﾝﾀ(L02) */
	register	TRCTPSZ		*trctp;		/* RCTｺﾍﾞﾂﾌﾞｱﾄﾞﾚｽ ﾎﾟｲﾝﾀ		 */
				long		gtday;		/* ﾏｼﾝﾋｽﾞｹ ｶｸﾉｳ ｴﾘｱ			 */
				long		gttim;		/* ｼﾞｺｸ ｶｸﾉｳ ｴﾘｱ			 */
				long		no;			/* ｲﾝﾃﾞｯｸｽ用領域		TD01 */
	            long        mrlog[2];   /* ﾛｸﾞ ｼﾞｮｳﾎｳ ﾍﾝｼｭｳ ﾘｮｳｲｷ    */
				long		pintrcd;	/* pint返却値待避域	ST3699	 */
				long		somcrcd;	/* somc返却値待避域	ST3699	 */

	PRINT0("**  mr_sint() is invoked. **\n");

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
	mo_wlg4(MR_SINT,WINSC,(long *)0,0L);
										/*						TD50 */

	/*****************************************************************/
	/*	ﾘｶﾊﾞﾘ要／不要の設定											 */
	/*****************************************************************/
	pintrcd = 0L;						/*					ST3699	 */
	somcrcd = 0L;						/*					ST3699	 */
	mrpcbp = (MRPCB *)pscparea.pscmrpcb;
	
	/*****************************************************************/
	/*	03-24-2003  修正 START 										 */
	/*  コールドスタンバイ構成のルートを削除する					 */
	/*****************************************************************/
#ifdef LINUX_ISOKUTAIOU	
	if ((mopcbp->mopssstp->tsstsysc) == 'C') {
										/* ｼｽﾃﾑ構成情報の判定	TD01 */
		if (mopcbp->mopssstp->tsstsysd > '9') {
										/* ﾌﾞﾛｯｸ区分の判定		TD01 */
			no = (long)mopcbp->mopssstp->tsstsysd - 'A' + 10;
										/* ｲﾝﾃﾞｯｸｽの取得		TD01 */
		}								/*						TD01 */
		else {							/*						TD01 */
			no = (long)mopcbp->mopssstp->tsstsysd - '0';
										/* ｲﾝﾃﾞｯｸｽの取得		TD01 */
		}								/*						TD01 */
	}
										/*						TD01 */
	else {								/*						TD01 */
		no = 0L;						/* ｲﾝﾃﾞｯｸｽの取得		TD01 */
	}									/*						TD01 */
#endif

	if ((mopcbp->mopssstp->tsstsysc) != 'C') {
										/*						TD01 */
		no = 0L;						/* ｲﾝﾃﾞｯｸｽの取得		TD01 */
	}									/*						TD01 */
	/*****************************************************************/
	/*	03-24-2003  修正 END 										 */
	/*  コールドスタンバイ構成のルートを削除する					 */
	/*****************************************************************/

	if( ((mopcbp->mopssstp->tsstprmd[no] & 0x0000000FL)	/* (L04)TD01 */
					== 0x0000000FL) ||	/* ﾃﾞﾊﾞｯｸﾞ ﾓｰﾄﾞ		   (L04) */
		((mopcbp->mopssstp->tsstprmd[no] & 0x0000000FL)	/* (L04)TD01 */
					== 0x0000000DL) ){	/* ｲｯﾊﾟﾝﾌｧｲﾙ ｿｳｻ ﾓｰﾄﾞ  (L04) */
		mrpcbp->mrpnsrc = MRPNRUEC;
	}
	else {
		if (mopcbp->mopscstp->tcstrnui==TCSTRNEC) {
			mrpcbp->mrpnsrc = MRPNRNEC;
		}
		else {
			mrpcbp->mrpnsrc = MRPNRUEC;
		}
	}

	/* tbl_dmp(mopcbp->mopscstp, sizeof(TCSTPSZ)); */

	/*****************************************************************/
	/*	mo_down ﾉ ｱﾄﾞﾚｽ ｦ ｾｯﾃｲｽﾙ									 */
	/*****************************************************************/
	mrpcbp->mrpsexf = mo_down;
	
	/*****************************************************************/
	/*	03-24-2003  修正 START 										 */
	/*  PU1の場合はgotoの処理を削除する					 			 */
	/*****************************************************************/

	/*****************************************************************/
	/*	PU番号のﾁｪｯｸ											TD00 */
	/*****************************************************************/
#ifdef LINUX_ISOKUTAIOU
		
	if (pscparea.pscpuno == 0x01) {		/* 自PUがPU1の時		TD59 */
		goto ret;						/*						TD59 */
	}									/*						TD59 */

#endif

	/*****************************************************************/
	/*	03-24-2003  修正 END 										 */
	/*  PU1の場合はgotoの処理を削除する					 			 */
	/*****************************************************************/
	
	
	/*****************************************************************/
	/*	ｷｮｳﾂｳｼﾞｮｳﾎｳ ｾｯﾃｲﾘｮｳｲｷ ﾉ ｼｮｷｶ								 */
	/*****************************************************************/
	mr_sinf(&scb);

	/*****************************************************************/
	/*	CST ﾉ ﾘｶﾊﾞﾘ ﾖｳ ﾌﾖｳ ｼﾞｮｳﾎｳ ﾃﾞ ﾌﾘﾜｹﾙ							 */
	/*****************************************************************/
										/* ﾘｶﾊﾞﾘ ﾖｳ ﾀﾞｯﾀﾗ ?			 */
	if (mrpcbp->mrpnsrc == MRPNRNEC){
		mr_sjnc( &scb );				/* ｼﾞｬｰﾅﾙ ﾌｧｲﾙ ﾁｪｯｸ ｼｮﾘ(L03) */
	}
	else;

	/*****************************************************************/
	/*	ﾌﾟﾛｾｽ ﾅｲ ｼｮｷｶ ｼｮﾘ											 */
	/*****************************************************************/
	retcd = mr_pint();
	if(retcd!=MRNORMAL) {				/* ｴﾗｰ ﾀﾞｯﾀﾗ ?				 */
		if ( retcd == MRRJONEC )		/* JNL再ｵ-ﾌﾟﾝ要?	ST3699	 */
		{								/* 					ST3699	 */
			pintrcd = retcd;			/* 返却値待避		ST3699	 */
		}								/*					ST3699	 */
		else							/*					ST3699	 */
		{								/*					ST3699	 */
			mrlog[0]=retcd;
			mo_wlg4(MR_SINT,0x33331000L,mrlog,4L);
										/* 						TD50 */
			mr_sdwn(MRDOWN, MRESYSINT, MRDPRCERR);
										/* ｼｽﾃﾑﾀﾞｳﾝ					 */
		}								/*					ST3699	 */
	}
	else;
										/* mo_downﾉ ｱﾄﾞﾚｽ ｦ ｾｯﾃｲｽﾙ	 */
	mrpcbp->mrpsexf = mo_down;

	/*****************************************************************/
	/*	SRT ﾉ ｳﾝﾃﾝｽﾃ-ﾀｽ ﾃﾞ ﾌﾘﾜｹﾙ									 */
	/*****************************************************************/
										/* ｳﾝﾃﾝｼｭｳﾘｮｳﾁｭｳ ﾀﾞｯﾀﾗ ?	 */
	if( (mopcbp->mopssrtp->tsrtdvst==TSRTEND) ||			/* (L02) */
										/* ﾃﾞﾝｹﾞﾝ ﾀﾞﾝ		   (L02) */
		(mopcbp->mopssrtp->tsrtdvst==TSRTQST) ){			/* (L02) */
										/* ﾃﾞﾝｹﾞﾝﾀﾞﾝｺﾞ ｻｲﾀﾁｱｹﾞ (L02) */
		PRINT0("-- mr_sint 終了処理中の処理へ --\n");
		goto normal;					/* MRNORMAL ﾃﾞ ｼｭｳﾘｮｳ ｽﾙ	 */
	}
	else;

	/*****************************************************************/
	/*	CST ﾉ ﾘｶﾊﾞﾘ ﾖｳ ﾌﾖｳ ｼﾞｮｳﾎｳ ﾃﾞ ﾌﾘﾜｹﾙ							 */
	/*****************************************************************/
										/* ﾘｶﾊﾞﾘﾖｳ ﾀﾞｯﾀﾗ ?			 */
	if (mrpcbp->mrpnsrc == MRPNRNEC){
		mr_srbc(&scb);					/* RBIﾌｧｲﾙ ﾉ ﾁｪｯｸ ｦ ｽﾙ		 */
		PRINT0("-- mr_sint call-mr_somc(1) --\n");
		retcd = mr_somc();				/* ｵｰﾌﾟﾝﾓｰﾄﾞ変換処理   (L02) */
										/*					ST3699	 */
		if ( retcd == MRRJONEC )		/* JNL再ｵ-ﾌﾟﾝ要?	ST3699	 */
		{								/* 					ST3699	 */
			somcrcd = retcd;			/* 返却値待避		ST3699	 */
		}								/*					ST3699	 */
		else;							/*					ST3699	 */

		/*************************************************************/
		/*	ｼﾞｬｰﾅﾙ ﾉ ｷﾘｶｴ ｦ ｵｺﾅｳ							   (L02) */
		/*************************************************************/
		if(((mopcbp->mopscstp->tcstbnui == TCSTBUEC) &&/* (L02)(L10) */
										/* ﾊﾞｯｸｱｯﾌﾟ ﾌﾖｳ		   (L02) */
			(mopcbp->mopssstp->tsststd0 == MRSTAD)) || /* (L02)(L10) */
										/* ｾｲｼﾞｮｳ ｶｲｼ	  (L02) TD59 */
		   ((mopcbp->mopscstp->tcstbnui != TCSTBUEC) &&
										/* ﾊﾞｯｸｱｯﾌﾟ ﾖｳ 		   (L10) */
			(mopcbp->mopssstp->tsststd0 == MRSTAD) &&
										/* ｾｲｼﾞｮｳ ｶｲｼ	  (L10) TD59 */
			(mopcbp->mopscstp->tcstjnui == '0'))){		/* (L02)TD@1 */
										/* ｼﾞｬｰﾅﾙ ｼｮｷｶ ﾖｳﾅﾗ	   (L10) */
			mr_sjud();					/* ｼﾞｬｰﾅﾙ ｷﾘｶｴ ｼｮﾘ	   (L02) */
		}													/* (L02) */
		else;												/* (L02) */

															/* (L01) */
		mr_smnt();						/* ﾊﾞｯｸｱｯﾌﾟ ｼﾞｬｰﾅﾙ ﾉ ﾏｳﾝﾄ	 */

		if (mopcbp->mopssstp->tsststd0 == MRSTAD){			/*	TD59 */
										/* ｶｲｼｸﾌﾞﾝ ﾊ ｾｲｼﾞｮｳ ｶ? (L11) */
			PRINT0("-- mr_sint call-mr_srba(1) --\n");
			mr_srba(&scb,MRMUARBINV);	/* RBIﾌｧｲﾙ ﾉ ﾑｺｳｶｦ ｽﾙ  (L07) */
		}													/* (L11) */
		else;												/* (L11) */

		/* RBI直接取得(mr_srba)をｵﾝﾗｲﾝ開始ｼﾞｬｰﾅﾙの取得後に移動 ST4983*/

		/*************************************************************/
		/*	RCT ｼﾞｮｳﾎｳ ｦ ｾｯﾃｲ ｽﾙ									 */
		/*************************************************************/
										/* SSTｶｲｼｸﾌﾞﾝ ｶﾞ			 */
										/*	 ｾｲｼﾞｮｳｶｲｼ ﾀﾞｯﾀﾗ ?		 */
		if(mopcbp->mopssstp->tsststd0 == MRSTAD) {			/*	TD59 */
										/* TCTｺﾍﾞﾂﾌﾞｱﾄﾞﾚｽ ｦ ﾓﾄﾒﾙ(L02)*/
			ttctp = (TTCTPSZ *)MRTBLAD(mrpcbp->mrptcta,1);	/* (L02) */
										/* EOFｲﾁ ﾄ BOFｲﾁ ｦ ﾋｶｸ (L02) */
			if (ttctp->ttctjro[ttctp->ttctjnlm - 1] ==
												ttctp->ttctjstt) {
										/*				  (L02) TD42 */
				PRINT0("-- mr_sint call-mr_sjnl(1) --\n");
				mr_sjnl(MRJINIT);		/* ｼｮｷ ｼﾞｬｰﾅﾙ ｦ ｼｭﾄｸｽﾙ (L02) */
				if (mopcbp->mopssstp->tsstsysc != 'H'  ||	/*	TD02 */
					mopcbp->mopssstp->tsstsysd != 'F') {	/*	TD02 */
					retcd = mr_jclr(MRJINDEX);
											/* ｼﾞｬｰﾅﾙ ﾍｯﾀﾞ ｸﾘｱ (L02) */
					if((retcd!=MRNORMAL)&&	/* ﾍﾝｷｬｸﾁ		   (L02) */
						(retcd!=MRJNLERR)){	/* ﾊﾝﾃｲ			   (L02) */
						mrlog[0] = retcd;	/* ﾛｸﾞ ｼﾞｮｳﾎｳ ｾｯﾃｲ (L02) */
										/* ﾛｸﾞ ｼﾞｮｳﾎｳ ｼｭﾄｸ	   (L02) */
						mo_wlg4(MR_SINT,0x33331001L,mrlog,4L);/*(L02)*/
										/* 						TD50 */
						mr_sdwn(MRDOWN, MRESYSINT, MRDJNLWTERR);
										/* ｼｽﾃﾑﾀﾞｳﾝ					 */
					}										/* (L02) */
					else;									/* (L02) */
				}											/*	TD02 */
			}												/* (L02) */
			else;											/* (L02) */

			if (( 'H' == mopcbp->mopssstp->tsstsysc )&&
				( 'F' == mopcbp->mopssstp->tsstsysd ))	/*	CT1222	 */
			{							/*					CT1222	 */
			}							/*					CT1222	 */
			else						/*					CT1222	 */
			{							/*					CT1222	 */
										/* RCTｺﾍﾞﾂﾌﾞｱﾄﾞﾚｽ ｦ ﾓﾄﾒﾙ	 */
				trctp = (TRCTPSZ *)MRTBLAD(mrpcbp->mrprcta,1);

										/* ｵｲｶｹ ﾘｶﾊﾞﾘ ﾊｲｼ ﾆ ﾄﾓﾅｲ     */
										/* RCT ｳﾝﾖｳ ﾋﾂﾞｹ ｦ ﾑｼﾞｮｳｹﾝﾆ  */
										/* ｾｯﾃｲ ｽﾙ            (L05)  */
										/* MRWLOG削除(3行)		TD50 */
 				mrlog[0] = (long)&gtday;
				mrlog[1] = (long)&gttim;
				mo_wlg4(MR_SINT,WBSYS | OSGTDAT,mrlog,8L);
										/*						TD50 */
				retcd = osgtdat(&gtday,	/* ﾏｼﾝﾋｽﾞｹ ｦ ﾓﾄﾒﾙ			 */
								&gttim);
				mrlog[0] = (long)retcd;
				mo_wlg4(MR_SINT,WASYS | OSGTDAT,mrlog,4L);
										/*						TD50 */
				if(retcd==NORMAL){		/* ｾｲｼﾞｮｳｼｭｳﾘｮｳ ﾀﾞｯﾀﾗ ?		 */
					retcd = mo_dyck(gtday, gttim);			/*	TD80 */
					if (retcd < 0L) {	/*						TD80 */
						mr_sdwn(MRSTART, MRESYSINT, MRDDATERR);	
															/*	TD80 */
					}					/*						TD80 */
					gtday <<= 8;		/* ｳﾝﾖｳﾋｽﾞｹ ﾆ ﾏｼﾝﾋｽﾞｹ ｵ		 */
					gtday >>= 12;		/*			   ｾｯﾃｲ ｽﾙ		 */
					gtday |= 0x0000000C;
					mc_pccn((char *)&gtday,
							trctp->trctdate,
							4L);
										/* TC1277 88-05-19	   (L06) */
					if(trctp->trctdate[0]==' '){
						trctp->trctdate[0] = '0';	
												/* '0' ｦ ｾｯﾃｲ  (L06) */
					}										/* (L06) */
					else;				/* TC1277 88-05-19	   (L06) */
				}
				else {					/* ｲｼﾞｮｳｼｭｳﾘｮｳ ﾀﾞｯﾀﾗ ?		 */
					mo_wlg4(MR_SINT,WNGSC,(long *)0,0L);
										/*						TD50 */
					mr_sdwn(MRSTART, MRESYSINT, MRDDATERR);
										/* ｼｽﾃﾑﾀﾞｳﾝ					 */
				}
										/* RCTｺﾍﾞﾂﾌﾞ ｵ				 */
										/*		ｼﾞｬ-ﾅﾙﾍﾝｼｭｳ ｽﾙ		 */
				retcd = mr_jedt(MRTJ,
								"TRCT",
								(char *)trctp,
								(char *)0,
								1L,
								(long)sizeof(TRCTPSZ),
								(long)((char *)trctp -
								(char *)pscparea.psccmadt));
				if(retcd < 0L){			/* MRNORMAL ﾀﾞﾂﾀﾗ ?			 */
					mrlog[0] = retcd;
					mo_wlg4(MR_SINT,0x33331002L,mrlog,4L);
										/*						TD50 */
					mr_sdwn(MRSTART, MRESYSINT, MRDJEDERR);
										/* ｼｽﾃﾑﾀﾞｳﾝ					 */
				}
				else;
				PRINT0("-- mr_sint call-mr_sjnl(2) --\n");
				mr_sjnl(MRJONST);		/* ｵﾝﾗｲﾝｶｲｼｼﾞｬ-ﾅﾙ ｵ			 */
	 									/*			   ｼｭﾄｸ ｽﾙ		 */
			}							/*					CT1222	 */
		}
		else;

		PRINT0("-- mr_sint call-mr_srba(2) --\n");         /* ST4983 */
		mr_srba(&scb,MRMUARBGET);	/* RBIﾃﾞｰﾀﾉ ﾁｮｸｾﾂｼｭﾄｸｵ ｽﾙ ST4983 */

		PRINT0("-- mr_sint call-mr_srba(3) --\n");
		mr_srba(&scb,					/* RBIﾃﾞ-ﾀﾉ ｼｭﾄｸｶｲｼｲﾗｲ		 */
				MRMUARBSTA);			/*				  ｦ ｽﾙ		 */
	}
	else;

	/*****************************************************************/
	/*	ﾍﾝｷﾔｸﾁ ｦ ｾｯﾃｲ ｽﾙ											 */
	/*****************************************************************/
normal :								/* ﾘｶﾊﾞﾘﾖｳ ﾀﾞｯﾀﾗ ?			 */
	if (mrpcbp->mrpnsrc == MRPNRNEC){
		mr_jcls();											/* (L08) */
		PRINT0("-- mr_sint call-mr_somc(2) --\n");
		retcd = mr_somc();				/* ｵｰﾌﾟﾝﾓｰﾄﾞ変換処理   (L02) */
										/*					ST3699	 */
		if ( retcd == MRRJONEC )		/* JNL再ｵ-ﾌﾟﾝ要?	ST3699	 */
		{								/* 					ST3699	 */
			somcrcd = retcd;			/* 返却値待避		ST3699	 */
		}								/*					ST3699	 */
		else;							/*					ST3699	 */
	}									/* TC2215 88-11-30	   (L09) */
	else;								/* TC2215 88-11-30	   (L09) */

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
ret :									/*						TD59 */
	mrlog[0] = pintrcd;					/*					ST3699	 */
	mrlog[1] = somcrcd;					/*					ST3699	 */
	mo_wlg4(MR_SINT,0x33331001,mrlog,8L);				/*	ST3699	 */
    if ( pintrcd == 0L )				/*					ST3699	 */
	{									/*					ST3699	 */
		if ( somcrcd == 0L )			/*					ST3699	 */
		{								/*					ST3699	 */
			retcd = MRNORMAL;			/*					ST3699	 */
		}								/*					ST3699	 */
		else							/*					ST3699	 */
		{								/*					ST3699	 */
			PRINT0("**  mr_somc失敗 **\n");				/*	ST3699	 */
			retcd = somcrcd;			/*					ST3699	 */
		}								/*					ST3699	 */
	}									/*					ST3699	 */
	else								/*					ST3699	 */
	{									/*					ST3699	 */
		PRINT0("**  mr_pint失敗 **\n");					/*	ST3699	 */
		retcd = pintrcd;				/*					ST3699	 */
	}									/*					ST3699	 */
	mrlog[0] = retcd;					/*					ST3699	 */
	mo_wlg4(MR_SINT,WOTSC,mrlog,4L);	/*			 			TD50 */
	PRINT1("**  mr_sint() ... RETURN(%d). **\n",retcd);
										/*					ST3699	 */
	return(retcd);						/*					ST3699	 */
}
