/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟｯｹ-ｼﾞ													 */
/*		RCV 														 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ 													 */
/*		ｼｽﾃﾑｼｮｷｶ/ｼｭｳﾘｮｳ ｼｮﾘ 										 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_sumt 													 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ 													 */
/*		ｽﾍﾞﾃ ﾉ ﾊﾞｯｸｱｯﾌﾟﾎﾞﾘｭ-ﾑ ｦ ｱﾝﾏｳﾝﾄ ｽﾙ							 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		ﾅｼ															 */
/*																	 */
/*	6 ﾍﾝｷｬｸﾁ														 */
/*		ﾅｼ															 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ 										 */
/*		ｻｸｾｲｼｬ : ﾔﾏｸﾞﾁ ﾏｻﾋﾛ 			'87/08/14					 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				' (L01)				 */
/*			 	 (AP ﾌﾞﾝｻﾝ ﾀｲｵｳ ﾉ ｶｲｿﾞｳ) --- STC448					 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者 : 佐藤　亘				'94/02/15			TD-00	 */
/*				 (ﾛｸﾞの見直しによる変更)					TD-50	 */
/*		変更者 : 夛田　透				'95/05/24					 */
/*				(SCSIﾘｾｯﾄ機能に伴う修正)		  --- CT1039(ST2764) */
/*																	 */
/*********************************************************************/

/*********************************************************************/
/*	ｲﾝｸﾙ-ﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
#include	"tvbt.h"
#include	"mrcom.h"										/* (L01) */
#include	"mrmac.h"
#include	"mo_wlg.h"					/*						TD50 */
										/* PSECTに関する宣言を削除	 */
										/* (削除ｽﾃｯﾌﾟ数 : 3)	TD50 */
#include	"tsst.h"					/* TSSTﾃｰﾌﾞﾙ		CT1039	 */
#include	"tcst.h"					/* TCSTﾃｰﾌﾞﾙ		CT1039	 */
#include	"tbpt.h"					/* TBPTﾃｰﾌﾞﾙ		CT1039	 */
#include	"tsrt.h"					/* TSRTﾃｰﾌﾞﾙ		CT1039	 */
#include	"tpct.h"					/* TPCTﾃｰﾌﾞﾙ		CT1039	 */
#include	"tabp.h"					/* TABPﾃｰﾌﾞﾙ		CT1039	 */
#include	"mopcb.h"					/* OCP用ﾌﾟﾛｾｽ内情報制御ﾌﾞﾛｯｸ CT1039	*/
#include	"mrcsrr.h"					/* SCSIﾘｾｯﾄ機能共通ﾍｯﾀﾞ CT1039 */

/*********************************************************************/
/*	define function name for mo_wlg4							TD00 */
/*********************************************************************/
#define	MR_SUMT	0x6d725f73,0x756d7420

extern	MOPSCPCB	*mopcbp;			/* MOPCBｱﾄﾞﾚｽ		CT1039	 */

void	mr_sumt()
{
	
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	START								 */
/*********************************************************************/	
#ifdef LINUX_ISOKUTAIOU	
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	END									 */
/*********************************************************************/

	
	/*****************************************************************/
	/*	mr_sumt ﾅｲ ｼﾖｳ ｶﾝｽｳ 										 */
	/*****************************************************************/
	long	mr_bumt();					/* ﾊﾞｯｸｱｯﾌﾟ ﾎﾞﾘｭ-ﾑ ﾉ ｱﾝﾏｳﾝﾄ  */
	void	mo_wlg4();					/* ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ	TD50 */

	/*****************************************************************/
	/*	mr_sumt ﾅｲ ﾜ-ｸ ｴﾘｱ											 */
	/*****************************************************************/
	register	TVBTPSZ *vbtp;			/* VBT ｺﾍﾞﾂﾌﾞ ﾍﾉ ﾎﾟｲﾝﾀ		 */
	register	short	efen;			/* VBT ﾕｳｺｳ ｴﾝﾄﾘ ｽｳ 		 */
	register	int 	i;				/* ﾙ-ﾌﾟ ｶｳﾝﾀ				 */

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 (3行)		TD50 */
	mo_wlg4(MR_SUMT,WINSC,(long *)0,0L);/*						TD50 */

	/*****************************************************************/
	/*	ﾊﾞｯｸｱｯﾌﾟ ﾎﾞﾘｭ-ﾑ ｦ ｱﾝﾏｳﾝﾄ ｽﾙ 								 */
	/*****************************************************************/
	if (mrpcbp->mrpvbta == (TCOMPAT *)0){					/* (L01) */
		mo_wlg4(MR_SUMT,0x33331000L,(long *)0,0L);
		goto ret;						/* VBT ｶﾞ ｿﾝｻﾞｲ ｼﾅｲ 		 */
	}
	else;
										/* VBT ﾉ ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ ｦ ﾓﾄﾒﾙ */
	vbtp = (TVBTPSZ *)MRTBLAD(mrpcbp->mrpvbta,1);			/* (L01) */
	efen = mrpcbp->mrpvbta->tcomefen;	/* ｺﾍﾞﾂﾌﾞ ｽｳ ｦ ﾓﾄﾒﾙ    (L01) */
	for(i=0; i<efen; i++){
		if ((vbtp->tvbtvsta & TVBTMNT) == TVBTMNT){			/*	TD@1 */
										/* VBT ﾉ ﾏｳﾝﾄﾁｭｳ ﾌﾗｸﾞ ｶﾞ ｵﾝ  */
			mopcbp->mopsvolno = (short)i + 1;
										/* 個別部番号設定	CT1039	 */
			mopcbp->mopsttype = MRMCVBT;/* テーブル種別設定	CT1039	 */
			mr_bumt(vbtp);				/* ﾉ ﾄｷ ｶﾞｲﾄｳ ﾛﾝﾘ ﾎﾞﾘｭ-ﾑ ｦ	 */
		}								/* ｱﾝﾏｳﾝﾄ ｽﾙ				 */
		else;
		vbtp++;
	}

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
ret :
										/* MRWLOG削除 (3行)		TD50 */
	mo_wlg4(MR_SUMT,WOTSC,(long *)0,0L);/*						TD50 */

/*********************************************************************/
/*	03-26-2003 NOP関数に変更	START								 */
/*********************************************************************/	
#endif	
/*********************************************************************/
/*	03-26-2003 NOP関数に変更	END									 */
/*********************************************************************/

	return;

}
