/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟｯｹｰｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ｲｼﾞｮｳ ｳｹﾂｹ ｼｮﾘ									 			 */
/*																	 */
/*  3 ｶﾝｽｳﾒｲ														 */
/*		mr_sdwn														 */
/*																	 */
/*  4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ｼｽﾃﾑ ﾅｲ ﾃﾞ ｲｺﾞ ﾉ ｼｽﾃﾑ ﾉ ｼｮﾘｿﾞｯｺｳ ｶﾞ ﾌｶﾉｳ ﾄ ﾊﾝﾀﾞﾝ ｼﾀ ﾊﾞｱｲ,	 */
/*	   ｼｽﾃﾑ.ﾀﾞｳﾝ ｻｾﾙ 								 				 */
/*																	 */
/*	5 ﾊﾟﾗﾒｰﾀ														 */
/*		type	:	ｲﾗｲ ｸﾌﾞﾝ										 */
/*		code	: 	故障 ｺｰﾄﾞ							   TD-00	 */
/*		detail	:	詳細情報					 		   TD-00	 */
/*																	 */
/*	6 ﾍﾝｷｬｸﾁ														 */
/*		ﾅｼ															 */
/*																	 */
/*  7 ﾘﾚｷ															 */
/*		 ｾｯｹｲｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		 ｻｸｾｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ 				'86/06/20					 */
/*		 ﾍﾝｺｳｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ				'87/01/16 (WLOG)			 */
/*		 ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'87/08/17 (L01)				 */
/*				  (ﾃﾞﾝﾌﾞﾝ ｿｳｼﾝ ﾎｳﾎｳ ﾉ ﾍﾝｺｳ) --- STC325				 */
/*		 ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/10/12 (L02)				 */
/*				  (ﾌﾟｰﾙ ﾊﾞｯﾌｧ ｶｸﾄｸ ﾎｳﾎｳ ﾉ ﾍﾝｺｳ) --- TC1230			 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼｬ : 渡邉　基樹				'93/11/01					 */	
/*														   TD-@1     */
/*														   TD-00	 */	
/*				 （ログの見直しに伴う修正）				   TD-50	 */
/*				 （ﾌﾟﾛｾｽ最大数拡張に伴う修正）			   TD-57     */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-005-09										 */
/*改造内容			:バイト反転対応									 */
/*改造日			:2002.11.05										 */
/*改造者			:Χ								 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-047-08										 */
/*改造内容			:エミュレート対象外ＴＲＡＤＥシステムコール対応	 */
/*					:自プロセスの無条件待ち関数(ossleep)をＬｉｎｕｘ */
/*					:システムコールを使用する						 */
/*改造日			:2002.11.21										 */
/*改造者			:Χ								 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:KL0004 										 */
/*改造内容			:TABP関連情報削除漏れ							 */
/*改造日			:2003.02.19										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*  ｲﾝｸﾙｰﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
/*********************************************************************/
/*	PRC-047-08  修正 START 											 */
/*  エミュレート対象外ＴＲＡＤＥシステムコール対応					 */
/*********************************************************************/
#include	<unistd.h>													/* PRC-047-08 */
/*********************************************************************/
/*	PRC-047-08  修正 END 											 */
/*  エミュレート対象外ＴＲＡＤＥシステムコール対応					 */
/*********************************************************************/
/*********************************************************************/
/*	PRC-005-09  修正 START 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
#include	"mosmpcom.h"												/* PRC-005-09 */
/*********************************************************************/
/*	PRC-005-09  修正 END 											 */
/*  エンディアン問題対応  バイト反転								 */
/*********************************************************************/
#include	"tcom.h"
#include	"tsst.h"					/* 						TD@1 */
#include	"tcst.h"					/* 						TD@1 */
#include	"tsrt.h"					/* 						TD@1 */
#include	"tpct.h"					/* 						TD@1 */
#include	"tbpt.h"					/* 						TD@1 */
/*********************************************************************/
/*	KL0004  修正 START 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
/*********************************************************************/
/*	KL0004  修正 END 												 */
/*  TABP関連情報削除(tabp.h)										 */
/*********************************************************************/
#include	"mr.h"						/* 						TD@1 */
#include	"mo.h"						/* 						TD@1 */
#include	"mocom.h"					/* 						TD@1 */
#include	"mrcom.h"					/* 						TD@1 */
#include	"mrmuse.h"					/* 						TD@1 */
#include	"mrmac.h"					/* 						TD@1 */
#include	"ossenmsp.h"				/* STC325 87-08-17 (L01)TD@1 */
#include	"mrsdwn.h"					/* 						TD@1 */
#include	"mcmia.h"					/* 						TD@1 */
#include	"momhead.h"					/* 						TD@1 */
#include	"psect.h"					/* 						TD@1 */
#include	"mopcb.h"					/* 						TD@1 */
#include	"mcdebug.h"
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*  ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘｮｳｲｷ 												 */
/*********************************************************************/
extern		PSCPSECT	pscparea;		/* PSECT ﾘｮｳｲｷ				 */
extern		MOPSCPCB	*mopcbp;

/*********************************************************************/
/*  ﾃﾞﾌｧｲﾝ ﾁ         												 */
/*********************************************************************/
										/* MRWLOG削除 1行		TD50 */
#define TSUSINK		'F'					/* ﾌﾞﾛｯｸ区分 予備系		TD01 */
#define COLDSTN		'C'					/* ｼｽﾃﾑ構成情報 		TD01 */
										/* ｺｰﾙﾄﾞｽﾀﾝﾊﾞｲ			TD00 */
#define DAIKOUN		' '					/* 代行現用系ﾌﾞﾛｯｸ番号	TD01 */
										/* 代行していない		TD00 */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_SDWN	0x6d725f73,0x64776e20

void	mr_sdwn(type, code, detail)
long	type;							/* ｲﾗｲ ｸﾌﾞﾝ					 */
short	code;							/* 故障 ｺｰﾄﾞ	 		TD@1 */
long	detail;							/* 詳細情報	 			TD@1 */
{
	/*****************************************************************/
	/*  mr_sdwn ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	ossenmsp();					/* ﾒｯｾｰｼﾞ ﾂｳｼﾝ 	 			 */
	/*****************************************************************/
	/*	PRC-047-08  修正 START 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	/*改造内容	：	自プロセスの無条件待ち関数(ossleep)をＬｉｎｕｘ	 */	/* PRC-047-08 */
	/*			：	システムコールを使用する（関数定義削除）		 */	/* PRC-047-08 */
	/*****************************************************************/
	/*	PRC-047-08  修正 END 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	long	osterm();					/* ﾌﾟﾛｾｽ ﾉ ｼｭｳﾘｮｳ  	 		 */
	void	mr_pcan();					/* ﾌﾟﾛｾｽﾘｶﾊﾞﾘ ﾉ ﾄｳﾛｸｶｲｼﾞｮ	 */
	long	mc_copy();					/* ﾓｼﾞﾚﾂ ﾉ ｺﾋﾟｰ 			 */
	long	mc_clea();					/* ﾓｼﾞﾚﾂ ﾉ ｸﾘｱ				 */
	long	mr_cgbf();					/* STC325 87-08-17	   (L01) */
															/* (L02) */
	void	mo_wlg4();					/* Sﾄﾚｰｽ情報の取得		TD50 */

	/*****************************************************************/
	/*  mr_sdwn ﾅｲ ﾜｰｸ ｴﾘｱ									 		 */
	/*****************************************************************/
	struct {							/* ｿｳｼﾝ ﾃﾞﾝﾌﾞﾝ ﾎﾟｲﾝﾀ   (L01) */
		MOMHEAD	sdhead;					/*					   (L01) */
		MRMSA	sdmrmsa;
	} *sdx;								/* STC325 87-08-17	   (L01) */

	register	long		endcd;		/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｻｸｾｲ ｴﾘｱ		 */
	register	long		edcd;		/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｻｸｾｲ ｴﾘｱ		 */
	register	long		cd;			/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｶｸﾉｳ ｴﾘｱ		 */
	register	long		sdtype;		/* ｲﾗｲ ｸﾌﾞﾝ ｻｸｾｲ ｴﾘｱ		 */
	register	long		retcd;		/* ﾘﾀｰﾝﾁ ｶｸﾉｳ ｴﾘｱ	 		 */
	register	long		size;		/* STC325 87-08-17	   (L01) */
	register	TPCTPSZ		*tpctp;		/* PCTｺﾍﾞﾂﾌﾞｱﾄﾞﾚｽ ﾉ ﾎﾟｲﾝﾀ	 */
				long		mrlog[3];	/* ﾛｸﾞ ｼﾞｮｳﾎｳ ﾍﾝｼｮｳ ﾘｮｳｲｷ	 */
	/*****************************************************************/
	/*	PRC-005-09  修正 START 										 */
	/*  エンディアン問題対応  バイト反転							 */
	/*****************************************************************/
	register	MOMK34 muinf;			/* ｲﾝﾀﾌｪｰｽｺｰﾄﾞ ﾎﾟｲﾝﾀ		 */ /* PRC-005-09 */
	/*****************************************************************/
	/*	PRC-005-09  修正 END 										 */
	/*  エンディアン問題対応  バイト反転							 */
	/*****************************************************************/

	PRINT3("**  mr_sdwn() is invoked. **\n type = 0x%08x\n  code = 0x%04x\n  detail = 0x%08x\n",
			type,code,detail);

	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = type;					/* ｲﾗｲ ｸﾌﾞﾝ					 */
	mrlog[1] = (long)code;				/* 故障 ｺｰﾄﾞ	 		TD@1 */
	mrlog[2] = detail;					/* 詳細情報	 			TD@1 */
	mo_wlg4(MR_SDWN,WINSC,mrlog,12L);	/*						TD50 */

	/*****************************************************************/
	/* OCP ﾉ ｼｽﾃﾑﾀﾞｳﾝ ｶﾝｽｳ ﾉ ﾊﾝﾃｲ  		 		 	 				 */
	/*****************************************************************/
	edcd = code & 0x0000FFFFL;
	switch (type) {
		case MRSTART:
			sdtype = MORSTAT;
			cd = MRSSTART;
			break;
		case MRIPL:
			sdtype = MOIPL;
			cd = MRSIPL;
			break;
		case MRDOWN:
			sdtype = MODOWN;
			cd = MRSDOWN;
			break;
		default:
			sdtype = MODOWN;
			cd = MRSDOWN;
			break;
	}
	if (mrpcbp->mrpsexf!=0) {
		(*mrpcbp->mrpsexf)(sdtype, edcd, detail);
	}
	else;

	/*****************************************************************/
	/*  ｿｳｼﾝ ﾃﾞﾝﾌﾞﾝ ｾｯﾃｲ ｼｮﾘ 	 				 					 */
	/*****************************************************************/
							/* ﾏｽﾀｰｽｹｼﾞｭｳﾗ ﾉ PCT ｶﾞｲﾄｳｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ	 */
	tpctp = (TPCTPSZ *)MRTBLAD(pscparea.pscpctad,1);
										/* STC325 87-08-17	   (L01) */
	size = (long)(sizeof(MOMHEAD)+sizeof(MRMSA)); /* ﾃﾞﾝﾌﾞﾝｻｲｽﾞ(L01) */
	retcd = mr_cgbf(0L,					/* CM ﾌﾟ-ﾙ ﾊﾞｯﾌｧ ﾉ ｶｸﾄｸ(L01) */
															/* (L02) */
					size,				/* ｶｸﾄｸ ﾊﾞｯﾌｧ ﾁｮｳ	   (L01) */
					(long **)&sdx);		/* ｶｸﾄｸ ﾊﾞｯﾌｧ ｱﾄﾞﾚｽ	   (L01) */
	if ( retcd < size ) {				/* ﾍﾝｷｬｸﾁ ﾉ ﾁｪｯｸ	   (L01) */
		mrlog[0] = retcd;				/* ﾛｸﾞ ｼｮｳﾎｳ ﾉ ｼｭﾄｸ	   (L01) */
		mo_wlg4(MR_SDWN,0x33331000L,mrlog,4L);	
										/*				   (L01)TD50 */
		mr_pcan();						/* PRCV ﾉ ｶｲｼﾞｮ		   (L01) */
		mrlog[0] = cd;					/* ﾛｸﾞ ｼｮｳﾎｳ ﾉ ｼｭﾄｸ	   (L01) */
		mo_wlg4(MR_SDWN,WBSYS | OSTERM,mrlog,4L);
										/*				   (L01)TD50 */
		osterm(cd);						/* ﾌﾟﾛｾｽ ﾉ ｼｮｳﾘｮｳ	   (L01) */
	}									/*					   (L01) */
	else;								/*					   (L01) */

	mc_clea((char *)sdx,0x00,size);		/* ｿｳｼﾝ ﾖｳ ﾊﾞｯﾌｧ ﾉ ｸﾘｱ (L01) */
	sdx->sdhead.momk1 = MOMK1;								/* (L01) */
	sdx->sdhead.momk2 = MOMK2;								/* (L01) */
	/*****************************************************************/
	/*	PRC-005-09  修正 START 										 */
	/*  エンディアン問題対応  バイト反転							 */
	/*****************************************************************/
	muinf.momk_s.momk3  = htons(MORCVMSG);								/* PRC-005-09 */
	muinf.momk_s.momk4  = htons(MOSDMSG);								/* PRC-005-09 */
	sdx->sdhead.momk34  = ntohl(muinf.momk_l);							/* PRC-005-09 */
	/*****************************************************************/
	/*	PRC-005-09  修正 END 										 */
	/*  エンディアン問題対応  バイト反転							 */
	/*****************************************************************/
	mc_copy(pscparea.pscprsnm,
			sdx->sdhead.momonm,								/* (L01) */
			8L);

	/*****************************************************************/
	/*	仕様変更	修正 START					修正日：2003.04.04	 */
	/*																 */
	/*	コールドスタンバイ構成時のMIA共通域の系区分設定を削除		 */
	/*****************************************************************/
//	if(mopcbp->mopssstp->tsstsysc == COLDSTN){				 /* TD01 */
										/* ｺｰﾙﾄﾞｽﾀﾝﾊﾞｲなら?		TD00 */
//		if (mopcbp->mopssstp->tsstsysd == TSUSINK &&		 /* TD01 */
//			mopcbp->mopssstp->tsstchbn == DAIKOUN){			 /* TD01 */
										/* ﾌﾞﾛｯｸ区分が予備系で、かつ */	
										/* 代行現用系ﾌﾞﾛｯｸ番号が代行 */
										/* していないなら?      TD00 */

//			sdx->sdhead.momokk = MOMKSH;					/* (L01) */
//			sdx->sdhead.momdkk = MOMKSH;					/* (L01) */
//		}
//		else{
//			sdx->sdhead.momokk = MOMKTU;					/* (L01) */
//			sdx->sdhead.momdkk = MOMKTU;					/* (L01) */
//		}
//	}									/* 						TD01 */
//	else{								/* ｼﾝﾌﾟﾚｯｸｳｽ,				 */
										/*		ﾎｯﾄｯｽﾀﾝﾊﾞｲなら?	TD01 */
		if(mopcbp->mopssstp->tsstsysd == TSUSINK){
										/* ﾌﾞﾛｯｸ区分が				 */
										/*			予備系なら?	TD01 */
			sdx->sdhead.momokk = MOMKSH;				/* (L01)TD01 */
			sdx->sdhead.momdkk = MOMKSH;				/* (L01)TD01 */
		}								/* 						TD01 */
		else{							/* 						TD01 */
			sdx->sdhead.momokk = MOMKTU;				/* (L01)TD01 */
			sdx->sdhead.momdkk = MOMKTU;				/* (L01)TD01 */
		}								/* 						TD01 */
//	}									/* 						TD01 */
	/*****************************************************************/
	/*	仕様変更	修正 END					修正日：2003.04.04	 */
	/*****************************************************************/

	mc_copy(tpctp->tpctpnm,
			sdx->sdhead.momdnm,								/* (L01) */
			8L);

	sdx->sdhead.momglen = size;								/* (L01) */

	endcd = pscparea.pscpctno;
	endcd <<= 16;						/* 						TD57 */
	edcd |= endcd;
	sdx->sdmrmsa.mrmendcd = edcd;							/* (L01) */
	sdx->sdmrmsa.mrmdtlc = detail;							/* (L01) */
	sdx->sdmrmsa.mrmdwnt = type;							/* (L01) */

	/*****************************************************************/
	/*  ｿｳｼﾝ ﾃﾞﾝﾌﾞﾝ ｦ ﾏｽﾀ ｽｹｼﾞｭﾗ ﾍ ｿｳｼﾝ ｽﾙ  				 		 */
	/*****************************************************************/
										/* MRWLOG削除 1行   	TD50 */
	mrlog[0] = pscparea.pscmlbms;
	mrlog[1] = size;										/* (L01) */
	mrlog[2] = (long)sdx;									/* (L01) */
	mo_wlg4(MR_SDWN,WBSYS | OSSENMSP,mrlog,12L);
										/*  					TD50 */
										/* MRWLOG削除 2行 		TD50 */
	retcd = ossenmsp(pscparea.pscmlbms,						/* (L01) */
					size,									/* (L01) */
					(char *)sdx);							/* (L01) */
	mrlog[0] = retcd;
	mo_wlg4(MR_SDWN,WASYS | OSSENMSP,mrlog,4L);
										/*  					TD50 */
	if (retcd!=NORMAL) {
		mo_wlg4(MR_SDWN,WNGSC,(long*)0,0L);
										/*  					TD50 */
		mr_pcan();
		mrlog[0] = cd;
		mo_wlg4(MR_SDWN,WBSYS | OSTERM,mrlog,4L);
										/*  					TD50 */
		osterm(cd);
	}
	else;

	/*****************************************************************/
	/*  ﾌﾟﾛｾｽ ﾏﾁｼﾞｮｳﾀｲ 	 	 	 				 				 	 */
	/*****************************************************************/
	for (;;) {
	/*****************************************************************/
	/*	PRC-047-08  修正 START 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	/*改造内容	：	自プロセスの無条件待ち関数(ossleep)をＬｉｎｕｘ	 */	/* PRC-047-08 */
	/*			：	システムコールを使用する（ロジック変更）		 */	/* PRC-047-08 */
	osdelay(0x7FFFFFFF, 4);												/* PRC-047-08 */
	/*****************************************************************/
	/*	PRC-047-08  修正 END 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	}
}
