/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟｯｹ-ｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ｼｽﾃﾑｼｮｷｶ/ｼｭｳﾘｮｳ ｼｮﾘ											 */
/*																	 */
/*	3 ｶﾝｽｳ ﾒｲ														 */
/*		mr_srba														 */
/*																	 */
/*	4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		RBIﾌﾟﾛｾｽ ﾆ RBIﾃﾞ-ﾀ ﾉ ｼｭﾄｸｲﾗｲ ｦ ｽﾙ							 */
/*																	 */
/*	5 ﾊﾟﾗﾒ-ﾀ														 */
/*		scbp : ｷｮｳﾂｳｼﾞｮｳﾎｳ ｾｯﾃｲ ﾘｮｳｲｷ								 */
/*		type : ｲﾗｲ ｼｭﾍﾞﾂ											 */
/*																	 */
/*	6 ﾍﾝｷﾔｸﾁ														 */
/*		ﾅｼ															 */
/*																	 */
/*	7 ﾘﾚｷ															 */
/*		ｾｯｹｲｼｬ : ﾎｼﾉ ﾋﾛﾄｼ											 */
/*		ｻｸｾｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ				'86/08/12					 */
/*		ﾍﾝｺｳｼｬ : ｽｽﾞｷ ｵｻﾑ				'87/06/18 (WLOG)			 */
/*		ﾍﾝｺｳｼｬ : ﾔﾏﾓﾄ ﾕｳｼﾞ				'87/08/18 (L01)				 */
/*				 (ﾃﾞﾝﾌﾞﾝ ｿｳｼﾞｭｼﾝ ﾎｳﾎｳ ﾉ ﾍﾝｺｳ) --- STC325			 */
/*		ﾍﾝｺｳｼﾔ : ｽｽﾞｷ ｵｻﾑ			 	'88/10/12 (L02)				 */
/*				 (ﾌﾟｰﾙ ﾊﾞｯﾌｧ ｶｸﾄｸ ﾎｳﾎｳ ﾉ ﾍﾝｺｳ) --- TC1230			 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		変更者 : 佐藤　亘				'94/02/15			TD-00	 */
/*				 (ﾎｯﾄｽﾀﾝﾊﾞｲ変更による変更)					TD-02	 */
/*				 (ｱｸｾｽ権付きﾊﾞｯﾌｧによる変更)				TD-10	 */
/*				 (LMﾃｰﾌﾞﾙのﾘｶﾊﾞﾘ機能による変更)				TD-39	 */
/*				 (ｼｽﾃﾑﾀﾞｳﾝの見直しによる変更)				TD-48	 */
/*				 (ﾛｸﾞの見直しに伴う修正)					TD-50	 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-034-01										 */
/*改造内容			:NOP対応	リターンコードに正常値を設定し不要	 */
/*								となったロジックは削除する			 */
/*改造日			:2002.11.27										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*	PRC-034-01  修正 START 											 */
/*  NOP対応															 */
/*********************************************************************/
/*********************************************************************/
/*	ヘッダーファイル												 */
/*********************************************************************/
#include	"tpct.h"					/*							 */
#include	"mrs.h"
/*********************************************************************/
/*	引数の型宣言													 */
/*********************************************************************/
void	mr_srba(scbp,type)
register	MRSCB	*scbp;				/* ｷｮｳﾂｳｼﾞｮｳﾎｳ ｾｯﾃｲﾘｮｳｲｷ	 */
register	char	type;				/* ｲﾗｲ ｼｭﾍﾞﾂ				 */
{
	/*****************************************************************/
	/* ﾘﾀｰﾝ ｽﾙ														 */
	/*****************************************************************/
	return;																/* PRC-034-01 */
}
