/**************************** NTC-SMP-RCV ****************************/
/*																	 */
/*	1 ｻﾌﾞﾊﾟｯｹｰｼﾞ													 */
/*		RCV															 */
/*																	 */
/*	2 ｶﾝｽｳ ｸﾌﾞﾝ														 */
/*		ｲｼﾞｮｳ ｳｹﾂｹ ｼｮﾘ									 			 */
/*																	 */
/*  3 ｶﾝｽｳﾒｲ														 */
/*		mr_sabt														 */
/*																	 */
/*  4 ｷﾉｳ ｶﾞｲﾖｳ														 */
/*		ﾌﾟﾛｾｽ ﾅｲ ﾃﾞ ｼｮﾘﾑｼﾞｭﾝ ｦ ｹﾝｼｭﾂ ｼ, ｼｮﾘｿﾞｯｺｳ ｶﾞ ﾌｶﾉｳ ﾄ ﾊﾝﾀﾞﾝ ｼﾀ	 */
/*	   ﾊﾞｱｲ ﾆ ｶﾞｲﾄｳ ﾌﾟﾛｾｽ ｦ ｱﾎﾞｰﾄ ｻｾﾙ 								 */
/*																	 */
/*	5 ﾊﾟﾗﾒｰﾀ														 */
/*		code	: 	故障 ｺｰﾄﾞ					 			TD-00	 */
/*		detail	:	ｼｮｳｻｲ ｼﾞｮｳﾎｳ									 */
/*		detail2	:	詳細情報2								TD-64	 */
/*		detail3	:	詳細情報3								TD-64	 */
/*																	 */
/*	6 ﾍﾝｷｬｸﾁ														 */
/*		ﾅｼ															 */
/*																	 */
/*  7 ﾘﾚｷ															 */
/*		 ｾｯｹｲｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ											 */
/*		 ｻｸｾｲｼｬ : ｺﾐﾔﾏ ｲｸﾖ 				'86/06/18					 */
/*		 ﾍﾝｺｳｼｬ : ﾀｹｳﾁ ｼﾝｲﾁ				'87/01/16			(WLOG)   */
/*		 ﾍﾝｺｳｼｬ : ｳﾁﾀﾞ ﾕｳｽｹ				'		  	(L02)    */
/*                ( ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ｶｲｿﾞｳ ﾆ ﾄﾓﾅｳ ﾍﾝｺｳ ) --- STC978		 */
/*		ﾍﾝｺｳｼﾔ : ﾏﾂｼﾀ ｴｲｼﾞ				'88/11/20					 */
/*				 (ｼｮｳｶﾞｲ ｶｲｾｷ ｼﾞｮｳﾎｳ ｼｭﾄｸ ｶﾝｽｳ ﾉ ﾍﾝｺｳ) --- TC1990	 */
/*		ﾍﾝｺｳｼｬ : ｲﾄｳ ﾋﾛﾕｷ				'93/02/22			(L03)	 */
/*				  ( PUﾍｲｿｸ ﾁｭｳ ﾊ ｱﾎﾞｰﾄ ｾｽﾞ,Sleepｽﾙ.	)    TC4931      */
/*      ﾍﾝｺｳｼｬ : 渡邉　基樹　　　　 　　'93/11/04  					 */
/*														 TD-@1 	     */
/*														 TD-00		 */	
/*				 （ログの見直しに伴う修正）　　　　　　　TD-50		 */
/*				 （終了コードの拡張に伴う修正）			 TD-64		 */
/*               （電文消失の回避の変更に伴う修正）      TD-75  	 */
/*      ﾍﾝｺｳｼｬ : 赤塚　一元　　　　 　　'94/12/13  	ST1223			 */
/*																	 */
/*********************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-047-08										 */
/*改造内容			:エミュレート対象外ＴＲＡＤＥシステムコール対応	 */
/*					:自プロセスの無条件待ち関数(ossleep)は、ＰＵ閉塞 */
/*					:ルートのためルート削除を行う					 */
/*改造日			:2002.11.21										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*  ｲﾝｸﾙｰﾄﾞ ﾌｧｲﾙ													 */
/*********************************************************************/
#include	"tcom.h"
#include	"tpct.h"					/* 						TD@1 */
#include	"tput.h"					/*				   (L03)TD@1 */
#include	"mr.h"						/*						TD@1 */
#include	"mrcom.h"					/*				   (L02)TD@1 */
#include	"mrmac.h"					/* 						TD@1 */ 
#include	"psect.h"					/* 						TD@1 */
#include    "mcdebug.h"					/* 						TD@1 */
#include	"mo_wlg.h"					/*						TD50 */

/*********************************************************************/
/*  ｶﾞｲﾌﾞ ﾍﾝｽｳ ﾘｮｳｲｷ 												 */
/*********************************************************************/
extern		PSCPSECT	pscparea;		/* PSECT ﾘｮｳｲｷ				 */

/*********************************************************************/
/*  ﾃﾞﾌｧｲﾝ ﾁ         												 */
/*********************************************************************/
										/* MRWLOG削除 1行		TD50 */

/*********************************************************************/
/*	define function name for mo_wlg4						TD-50	 */
/*********************************************************************/
#define	MR_SABT	0x6d725f73,0x61627420

void	mr_sabt(code, detail, detail2, detail3)              /* TD64 */ 
short	code;							/* 故障 ｺｰﾄﾞ	 		TD@1 */
long	detail;							/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ				 */
long	detail2;						/* 詳細情報 2           TD64 */
long	detail3;						/* 詳細情報 3           TD64 */
{
	/*****************************************************************/
	/*  mr_sabt ﾅｲ ｼﾖｳ ｶﾝｽｳ ﾉ ﾃｲｷﾞ									 */
	/*****************************************************************/
	long	osterm();					/* ﾌﾟﾛｾｽ ｼｭｳﾘｮｳ 	 		 */
	void	mr_sdwn();					/* ｼｽﾃﾑ ﾀﾞｳﾝ 	 	 		 */
	void	mo_wlg4();					/* Sﾄﾚｰｽ情報の取得		TD50 */
	TCOMPAT	*mo_tagt();			/* ﾃｰﾌﾞﾙ ｾﾝﾄｳ ｱﾄﾞﾚｽ ｶｸﾄｸ ｶﾝｽｳ   (L03)*/

	/*****************************************************************/
	/*  mr_sabt ﾅｲ ﾜｰｸ ｴﾘｱ								 			 */
	/*****************************************************************/
	register	long		endcd;		/* ｼｭｳﾘｮｳ ｺｰﾄﾞ ｻｸｾｲ ｴﾘｱ		 */
	register	TPCTPSZ		*tpctp;		/* PCT ｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ ﾎﾟｲﾝﾀ	 */
				long		mrlog[4];	/* ﾛｸﾞ 情報編集領域		TD64 */
	/*****************************************************************/
	/*	PRC-047-08  修正 START 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	/*改造内容	：	自プロセスの無条件待ち関数(ossleep)は、ＰＵ閉塞	 */	/* PRC-047-08 */
	/*			：	ルートのためルート削除を行う（変数定義）		 */	/* PRC-047-08 */
	/*****************************************************************/
	/*	PRC-047-08  修正 END 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/

	PRINT4("**  mr_sabt() is invoked. **\n    code = 0x%04x\n    detail = 0x%08x\n    detail2 = 0x%08x\n    detail3 = 0x%08x\n",code,detail,detail2,detail3);											/*						TD64 */
	/*****************************************************************/
	/*	ﾛｸﾞ ｼﾞｮｳﾎｳ ﾉ ｼｭﾄｸ											 */
	/*****************************************************************/
										/* MRWLOG削除 1行		TD50 */
	mrlog[0] = (long)code;				/* 故障 ｺｰﾄﾞ	 		TD@1 */
	mrlog[1] = detail;					/* ｼｮｳｻｲ ｼﾞｮｳﾎｳ				 */
	mrlog[2] = detail2;					/* 詳細情報 2           TD64 */
	mrlog[3] = detail3;					/* 詳細情報 3           TD64 */
	mo_wlg4(MR_SABT,WINSC,mrlog,16L);	/*  					TD50 */
										/* MRWLOG削除 2行		TD50 */

	/*****************************************************************/
	/*  ﾏｽﾀ.ｽｹｼﾞｭﾗ ﾉ ﾊﾞｱｲ 	 								 		 */
	/*****************************************************************/
	endcd = code & 0x0000FFFFL;
	if (pscparea.pscpctno==0) {
		mr_sdwn(MRSTART, endcd, detail);
	}
	else;

	/*****************************************************************/
	/*  ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ﾁｭｳ ﾉ ﾊﾞｱｲ						 		         */
	/*****************************************************************/
	if (mrpcbp->mrprcst == MRPRCRUN){	/* ﾌﾟﾛｾｽ ﾘｶﾊﾞﾘ ﾁｭｳ ﾅﾗﾊﾞ(L02) */
		mr_sdwn(MRSTART, endcd, detail);/* ｼｽﾃﾑ ﾀﾞｳﾝ ﾄ ｽﾙ      (L02) */
	}
	else;

	/*****************************************************************/
	/*  ｼｭｳﾘｮｳ ｺｰﾄﾞ ｦ ｻｸｾｲ ｽﾙ 										 */
	/*****************************************************************/
										/* PCT ｶﾞｲﾄｳｺﾍﾞﾂﾌﾞ ｱﾄﾞﾚｽ	 */
	tpctp = (TPCTPSZ *)MRTBLAD(pscparea.pscpctad,
							   pscparea.pscpctno+1);
	if( tpctp->tpctmflg == TPCTMKNE ){	/*					ST1223	 */
		endcd |= 0x00130000L;           /* 						TD75 */
	}									/*					ST1223	 */
	else{								/*					ST1223	 */
		endcd |= 0x00030000L;           /* 						TD75 */
	}									/*					ST1223	 */

	/*****************************************************************/
	/*  ｼｭｳﾘｮｳ ｺｰﾄﾞ, ｼｮｳｻｲ ｺｰﾄﾞ ｦ PCT ﾆ ｾｯﾃｲ ｽﾙ 	 				 */
	/*****************************************************************/
	tpctp->tpctecd = endcd;
	tpctp->tpctdtl = detail;
	tpctp->tpctdtl2 = detail2;          /*						TD64 */
	tpctp->tpctdtl3 = detail3;          /* 						TD64 */

	/*****************************************************************/
	/*	PRC-047-08  修正 START 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/
	/*改造内容	：	自プロセスの無条件待ち関数(ossleep)は、ＰＵ閉塞	 */	/* PRC-047-08 */
	/*			：	ルートのためルート削除を行う（ロジック）		 */	/* PRC-047-08 */
	/*****************************************************************/
	/*	PRC-047-08  修正 END 										 */
	/*  エミュレート対象外ＴＲＡＤＥシステムコール対応				 */
	/*****************************************************************/

	/*****************************************************************/
	/*  ﾌﾟﾛｾｽ ｦ ｼｭｳﾘｮｳ ｻｾﾙ 	 	 	 								 */
	/*****************************************************************/
										/* MRWLOG削除 3行		TD50 */
	mrlog[0] = endcd;
	mo_wlg4(MR_SABT,WBSYS | OSTERM,mrlog,4L);
										/*  					TD50 */
	osterm(endcd);
}
