/****************************************************************************/
/*	著作権　１９９３														*/
/*			　ＮＴＴデータ通信株式会社										*/
/*				金融システム事業本部										*/
/*																			*/
/*																			*/
/*	収容物　ＡＣＥ−ＳＭＰシステム　ＲＣＶ　（ｍｒ＿ｓｊｎｃ）				*/
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/*＜対象業務名＞					 故障回復業務							*/
/*＜対象業務ＩＤ＞					 ＲＣＶ									*/
/*＜サービス項目名＞				 システム初期化処理						*/
/*＜サービス項目ＩＤ＞				 ０３２									*/
/*＜モジュール名＞					 ＪＮＬファイルチェック処理				*/
/*＜モジュールＩＤ＞				 ２２４６								*/
/*＜モジュール通番＞														*/
/*--------------------------------------------------------------------------*/
/*＜適用機種＞						 ＡＣＥ									*/
/*＜適用ＯＳ＞						 ＴＲＡＤＥ								*/
/*＜開発環境＞						 ＳＵＮ  ＳＰＡＲＣ−ＩＰＸ				*/
/*＜記述言語＞						 Ｃ言語									*/
/*＜モジュール形態＞				 関数									*/
/*＜機能区分＞																*/
/*＜対象データ＞															*/
/*＜工程・階層区分＞				 										*/
/*--------------------------------------------------------------------------*/
/*＜開発システム名＞				 ＡＣＥ−ＳＭＰシステム					*/
/*＜開発システム番号＞				 ５７２６０１４０２１００				*/
/*--------------------------------------------------------------------------*/
/*＜開発担当名＞					 営業店システム担当						*/
/*＜電話番号＞						 169-3537(03-5702-3537)					*/
/*--------------------------------------------------------------------------*/
/*＜設計者名＞						 佐藤　亘						TD-42	*/
/*＜設計年月日＞					 １９９４年０２月０１日					*/
/*--------------------------------------------------------------------------*/
/*＜ソース作成者名＞				 佐藤　亘								*/
/*＜ソース作成年月日＞				 １９９４年０２月１５日					*/
/*--------------------------------------------------------------------------*/
/*＜見積ステップ数＞				 １７３ステップ							*/
/*--------------------------------------------------------------------------*/
/*＜機能概要＞																*/
/*		ＪＮＬファイルの論理チェックを行う。								*/
/*--------------------------------------------------------------------------*/
/*＜呼出形式＞																*/
/*	  void    mr_sjnc(scbp);					<RBIﾌｧｲﾙﾁｪｯｸ処理		>	*/
/*																			*/
/*＜仮引き数＞																*/
/*	  MRSCB   scbp;								<共通情報設定領域		>	*/
/*																			*/
/*＜返却値＞   																*/
/*	  なし																	*/
/*--------------------------------------------------------------------------*/
/*＜入出力データ構造＞														*/
/*	（１）共通情報設定領域（入力）											*/
/*		ﾚﾍﾞﾙ  項目名			属性  ﾊﾞｲﾄ数  繰返  入出  内容説明			*/
/*		  1   共通情報設定領域  ﾎﾟｲﾝﾀ    4     --   入    共通情報設定領域	*/
/*		      ﾎﾟｲﾝﾀ                                       ﾎﾟｲﾝﾀ				*/
/*		  2   共通情報設定領域  MRSCB          --   入    共通情報設定領域	*/
/*		  3   ｻﾌﾞMS要／不要     char     1     --   入    ｻﾌﾞMS要／不要		*/
/*		  3   RBI(CM)用         ﾎﾟｲﾝﾀ    4     --   入    RBI(CM)用			*/
/*		      TPCT個別部ﾎﾟｲﾝﾀ                             TPCT個別部ﾎﾟｲﾝﾀ	*/
/*		  4   RBI(CM)用         TPCTPSZ        --   入    RBI(CM)用			*/
/*		      TPCT個別部                                  TPCT個別部		*/
/*		  3   RBI(LM0)用        ﾎﾟｲﾝﾀ    4     --   入    RBI(LM0)用		*/
/*		      TPCT個別部ﾎﾟｲﾝﾀ                             TPCT個別部ﾎﾟｲﾝﾀ	*/
/*		  4   RBI(LM0)用        TPCTPSZ        --   入    RBI(LM0)用		*/
/*		      TPCT個別部                                  TPCT個別部		*/
/*		  3   RBI(LM1)用        ﾎﾟｲﾝﾀ    4     --   入    RBI(LM1)用		*/
/*		      TPCT個別部ﾎﾟｲﾝﾀ                             TPCT個別部ﾎﾟｲﾝﾀ	*/
/*		  4   RBI(LM1)用        TPCTPSZ        --   入    RBI(LM1)用		*/
/*		      TPCT個別部                                  TPCT個別部		*/
/*																			*/
/*＜制限事項＞																*/
/*	  特になし																*/
/*																			*/
/*＜使用外部モジュールＩＤ＞												*/
/*	  osgfinf																*/
/*	  mr_ctba, mr_sdwn, mr_jopn, mr_jcls, mr_jerr, mr_sjfs					*/
/*	  tcom.h, tadt.h, tbpt.h, tcst.h, tfmt.h, tpct.h, trbt.h, tsrt.h		*/
/*	  tsst.h, ttct.h, tvmt.h												*/
/*	  psect.h																*/
/*	  mopcb.h																*/
/*	  mc.h																	*/
/*	  mfcom.h																*/
/*	  mr.h																	*/
/*	  mrj.h																	*/
/*	  mrs.h																	*/
/*	  mrcom.h																*/
/*	  mrmac.h																*/
/*	  mrcode.h																*/
/*	  osgfinf.h																*/
/*																			*/
/*＜呼出元のモジュールＩＤ＞												*/
/*	  mr_sint																*/
/*																			*/
/****************************************************************************/
/*********************************************************************/
/*プロジェクト名	:												 */
/*プロセス名		:ＡＰプロセス									 */
/*改造番号			:PRC-034-01										 */
/*改造内容			:NOP対応	リターンコードに正常値を設定し不要	 */
/*								となったロジックは削除する			 */
/*改造日			:2002.11.27										 */
/*改造者			:Χ								 */
/*********************************************************************/

/*********************************************************************/
/*	PRC-034-01  修正 START 											 */
/*  NOP対応															 */
/*********************************************************************/
/*********************************************************************/
/*	ヘッダーファイル												 */
/*********************************************************************/
#include	"tpct.h"					/*							 */
#include	"mrs.h"						/*							 */
/*********************************************************************/
/*	引数の型宣言													 */
/*********************************************************************/
void									/*							 */
mr_sjnc(scbp)							/*							 */
	MRSCB	*scbp;						/* 共通情報格納領域			 */
{										/*							 */
	return;																/* PRC-034-01 */
}										/*							 */
/*********************************************************************/
/*	PRC-034-01  修正 END 											 */
/*  NOP対応															 */
/*********************************************************************/
