/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 障害処理													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 異常終了処理（アボート処理）								*/
/* ＜モジュールＩＤ＞				 os_abort													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*      終了コードに応じて、アボート処理をする。                                                */
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<oscreat.h>																	*/
/*																								*/
/*      void    os_abort()                                                                      */
/*																								*/
/* ＜仮引数＞																					*/
/*      long    termcode                                                                        */
/*      long    detail                                                                          */
/*      long    coreflg（０：core未取得  １：core取得）                                         */
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了			iFilId+1(iFilIdはファイル記述子カウント用)							*/
/*		異常終了			-1																	*/
/*							OSFEACC																*/
/*							OSFENOFILE															*/
/*							OSEEWKEX															*/
/*							OSFEPFILRS															*/
/*							OSFESFILRS															*/
/*							OSFEPATH															*/
/*							OSFERSIZE															*/
/*							OSFEFSIZE															*/
/*							OSFEPFILRS															*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*      ＴＲＡＤＥエミュレート内のみ利用可能とする。                                            */
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/************************************************************************************************/
/*  インクルードファイル                                                                        */
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/


/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_abort_ins.h"


void	os_abort(termcode, detail, coreflg)
long	termcode;									/* ＴＲＡＤＥ終了コード						*/
long	detail;										/* 詳細情報									*/
long	coreflg;									/* core取得フラグ							*/
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	char	cSerious;								/* 重大度									*/
	struct	timeval tTmVal;							/* 時間取得用構造体							*/
	struct	tm		*ptTm;							/* 日付時刻変換用構造体						*/
	TAbortInfo		tAbtInfo;						/* アボート情報構造体						*/
	os_trcget2( D_MD_OS_ABORT, D_T_TRA_IN, 3, termcode, detail, coreflg );
													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgSubFnc \n", "os_abort" ) );
//	DbgMsg01( DLv04, ( OutPut, "***** %s:termcode = %08lx \n", "os_abort", termcode ) );
//	DbgMsg01( DLv04, ( OutPut, "***** %s:detail   = %ld \n", "os_abort", detail ) );
//	DbgMsg01( DLv04, ( OutPut, "***** %s:coreflg  = %ld \n", "os_abort", coreflg ) );


	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	cSerious = 0;									/* 重大度 クリア							*/
	
													/* アボート情報タイトル クリア				*/
	memset(tAbtInfo.acTitle, 0, sizeof(tAbtInfo.acTitle));


													/* アボート情報サブタイトル クリア          */
	memset(tAbtInfo.acSubTitle, 0, sizeof(tAbtInfo.acSubTitle));


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	/****************************************/
	/*  アボート情報の記録					*/
	/****************************************/
	os_trcget2( D_MD_OS_ABORT, D_T_SYS_GETTIMEOFDAY, 2, &tTmVal, NULL );
	gettimeofday(&tTmVal, NULL);					/* 時間を取得								*/
	os_trcget2( D_MD_OS_ABORT, D_T_SYS_END, 0 );

													/* バイナリデータと時刻を					*/
													/* 要素別の時刻や ASCII に変換する			*/
	os_trcget2( D_MD_OS_ABORT, D_T_SYS_LOCALTIME, 1, &tTmVal.tv_sec );
	ptTm = localtime(&tTmVal.tv_sec);
	os_trcget2( D_MD_OS_ABORT, D_T_SYS_END, 0 );

													/* アボート情報タイトル設定					*/
	sprintf(tAbtInfo.acTitle, "%c%c%c%c %s \n", '@', '(', '#', ')', D_ABORTINFO_TITLE);
													/* アボート情報サブタイトル設定				*/
	sprintf(tAbtInfo.acSubTitle, "%c%c%c%c     %s  %02d-%02d-%02d %02d:%02d:%02d  %s  %08lx-%08lx",
			'@', '(', '#', ')', "DATE", (ptTm->tm_year-100), (ptTm->tm_mon+1), ptTm->tm_mday,
			ptTm->tm_hour, ptTm->tm_min, ptTm->tm_sec, "TERMCODE", termcode, detail);


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
    DbgDmp02( DLv04, ("ptMyEPRC in os_abort", ptMyEPRC, sizeof(TEprcTableInd), 1, 0));
	/****************************************/
	/*  プロセスの終了						*/
	/****************************************/
	//cSerious = ((termcode >> 16) & 0x000000ff);		/* 重大度取得							*/
	cSerious = ((termcode >> 16) & 0x0000000f);		// 20030305 修正
	DbgMsg01( DLv04, ( OutPut, "***** %s:cSerious = %02d \n", "os_abort", cSerious) );

	if (0 == coreflg)								/* core取得フラグが「0（未取得）」の場合	*/
	{
		exit(0);									/* プロセス終了								*/
	}
	else											/* core取得フラグが「1（取得）」の場合		*/
	{
		switch (cSerious)							/* 重大度の判定処理							*/
		{
			case	0:								/* coreファイルを取得しない					*/
			case	2:								/* 											*/
				exit(0);							/* プロセス終了								*/
				break;

			case	1:								/* coreファイルを取得する					*/
			case	3:								/* 											*/
				abort();							/* アボート									*/
				break;

			default	 :								/* その他（coreファイルを取得する）			*/
				abort();							/* アボート									*/
				break;
		}
	}

													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** %s: End  DbgSubFnc\n", "os_abort" ) );
	os_trcget2( D_MD_OS_ABORT, D_T_TRA_OUT, 0 );
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
