/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_DayTime2Date											*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* 作成者:梶原                                                               */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日:2002年10月3日                                                      */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 日付時刻を日時に変換																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_DayTime2Date.h>															*/
/*																								*/
/*	   	long	os_DayTime2Date( long day, long time, struct tm *ptDate)						*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long			day;		日付														*/
/*		long			time;		時刻														*/
/*		struct tm		*ptDate;	日時格納場所												*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		OSEEIVAL																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include "os_DayTime2Date_ins.h"
/*****************************************************************************/
/* 機能:日付時刻を日時に変換                                                 */
/* 作成日:2002年10月3日                                                      */
/* 変更日:                                                                   */
/* 作成者:梶原                                                               */
/* 呼出形式:                                                                 */
/*   long os_DayTime2Date( long day, long time, struct tm *ptDate )          */
/*     long day                       	// 日付                              */
/*     long time						// 時刻                              */
/*     struct tm *ptDate				// 日時格納場所                      */
/*                                                                           */
/*****************************************************************************/
long os_DayTime2Date( long day, long time, struct tm *ptDate )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	int iWeek;							// 曜日
	int iDay;							// 日
	int iMonth;							// 月
	int iYear;							// 年
	int iSec;							// 秒
	int iMin;							// 分
	int iHour;							// 時
	int iLoopCnt;						// ループカウンタ
	
	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_DAYTIME2DATE ) );
	
	for( iLoopCnt = 0; iLoopCnt < 32; iLoopCnt += 4 )
	{
		if( D_VAL_MAX < (( day >> iLoopCnt ) & 0x0000000f ))
										// 各桁が最大値を超えていた時
		{
			return( OSEEIVAL );			// OSEEIVALを返却
		}
		
		if( D_VAL_MAX < (( time >> iLoopCnt ) & 0x0000000f ))
										// 各桁が最大値を超えていた時
		{
			return( OSEEIVAL );			// OSEEIVALを返却
		}
	}
	
	iWeek = day & 0x0000000f;			// 曜日の取得
	
	iDay = ( day >> 8 ) & 0x0000000f;	// 日の1の位を取得
	
	iDay += ((( day >> 12 ) & 0x0000000f ) * 10);
										// 日の10の位を取得
    iMonth = ( day >> 16 ) & 0x0000000f;
    									// 月の1の位を取得
    iMonth += ((( day >> 20 ) & 0x0000000f ) * 10 );
    									// 月の10の位を取得
    iYear = ( day >> 24 ) & 0x0000000f;
    									// 年の1の位を取得
    iYear += ((( day >> 28 ) & 0x0000000f ) * 10 );
    									// 年の10の位を取得
    iSec = time & 0x0000000f;		// 秒の1の位を取得
    
    iSec += ((( time >> 4 ) & 0x0000000f ) * 10 );
    									// 秒の10の位を取得
    iMin = ( time >> 8 ) & 0x0000000f;
    									// 分の1の位を取得
    iMin += ((( time >> 12 ) & 0x0000000f ) * 10 );
    									// 分の10の位を取得
    iHour = ( time >> 16 ) & 0x0000000f;
    									// 時の1の位を取得
    iHour += ((( time >> 20 ) & 0x0000000f ) * 10 );
    									// 時の10の位を取得
    if( D_WEEK_MAX < iWeek )
    {									// 曜日の値が範囲外の時
    	DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_DAYTIME2DATE, OSEEIVAL ) );
		return( OSEEIVAL );				// OSEEIVALを返却
	}
	
	if( D_YEAR_MAX < iYear )
	{									// 年の値が範囲外の時
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_DAYTIME2DATE, OSEEIVAL ) );
		return( OSEEIVAL );				// OSEEIVALを返却
	}
	
	switch( iMonth )
	{
		case 1:							// 月が1の時
		case 3:							// 月が3の時
		case 5:							// 月が5の時
		case 7:							// 月が7の時
		case 8:							// 月が8の時
		case 10:						// 月が10の時
		case 12:						// 月が12の時
			if(( 1 > iDay ) || ( 31 < iDay ))
			{							// 日の値が範囲外の時
				DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n",
									                             D_PROC_DAYTIME2DATE, OSEEIVAL ) );
				return( OSEEIVAL );		// OSEEIVALを返却
			}
			break;
		
		case 4:							// 月が4の時
		case 6:							// 月が6の時
		case 9:							// 月が9の時
		case 11:						// 月が11の時
			if(( 1 > iDay ) || ( 30 < iDay ))
			{							// 日の値が範囲外の時
				DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n",
																 D_PROC_DAYTIME2DATE, OSEEIVAL ) );
				return( OSEEIVAL );		// OSEEIVALを返却
			}
			break;
			
		case 2:							// 月が1の時
			if( 0 == ( iYear % 4 ))		// 年が4で割り切れる時
			{
				if(( 1 > iDay ) || ( 29 < iDay ))
				{						// 日の値が範囲外の時
					DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n",
																 D_PROC_DAYTIME2DATE, OSEEIVAL ) );
					return( OSEEIVAL );	// OSEEIVALを返却
				}
			}
			else						// 年が4で割り切れない時
			{
				if(( 1 > iDay ) || ( 28 < iDay ))
				{						// 日の値が範囲外の時
					DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n",
																 D_PROC_DAYTIME2DATE, OSEEIVAL ) );
					return( OSEEIVAL );	// OSEEIVALを返却
				}
			}
			break;
			
		default:						// 月の値がその他の時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n",
																 D_PROC_DAYTIME2DATE, OSEEIVAL ) );
			return( OSEEIVAL );			// OSEEIVALを返却
	}
    
    if(( 0 > iHour ) || ( 23 < iHour ))	// 時の値が範囲外の時
    {
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_DAYTIME2DATE, OSEEIVAL ) );
		return( OSEEIVAL );				// OSEEIVALを返却
	}
	
	if(( 0 > iMin ) || ( 59 < iMin ))	// 分の値が範囲外の時
    {
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_DAYTIME2DATE, OSEEIVAL ) );
		return( OSEEIVAL );				// OSEEIVALを返却
	}
	
	if(( 0 > iSec ) || ( 59 < iSec ))	// 秒の値が範囲外の時
    {
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_DAYTIME2DATE, OSEEIVAL ) );
		return( OSEEIVAL );				// OSEEIVALを返却
	}
	
/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	if( D_YEAR_MID > iYear )			// 年が中間値未満の時
	{
		ptDate->tm_year = iYear + 100;	// 年の設定
	}
	else								// 年が中間値以上の時
	{
		ptDate->tm_year = iYear;		// 年の設定
	}
	
	ptDate->tm_mon = iMonth - 1;		// 月の設定
	
	ptDate->tm_mday = iDay;				// 日の設定
	
	ptDate->tm_wday = iWeek;			// 曜日の設定
	
	ptDate->tm_hour = iHour;			// 時間の設定
	
	ptDate->tm_min = iMin;				// 分の設定
	
	ptDate->tm_sec = iSec;				// 秒の設定
	
	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_DAYTIME2DATE ) );
	return( NORMAL );					// NORMALを返却し終了
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/

