/************************************************************************************************/
/*	著作権	２００２																			*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム	ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 リザルト・例外												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 デフォルトシグナルハンドラ２								*/
/* ＜モジュールＩＤ＞				 os_dflact2													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年０９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年０９月２７日 									*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０８月１１日     故障管理番号（ＴＢＣＳ０２７７）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*			デフォルトシグナルハンドラの登録を行い、終了処理をする。							*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_dflact2_ins.h>															*/
/*																								*/
/*		void	os_dflact2( int sig )															*/
/*																								*/
/* ＜仮引数＞																					*/
/*		int		sig;				シグナル													*/
/*																								*/
/* ＜返却値＞																					*/
/*		なし																					*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*		ＴＲＡＤＥエミュレート内のみ利用可能とする。											*/
/*		本処理はＴＲＡＤＥプロセス初期化処理にて各シグナルにシグナルハンドラとして登録される。	*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/

/************************************************************************************************/
/*  インクルードファイル                                                                        */
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/


/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_dflact_ins.h"
#include	"os_dflact2_ins.h"


void	os_dflact2(sig)
int		sig;										/* シグナル									*/
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	long	lEndCode;								/* 終了コード								*/
	long	lDetail;								/* 詳細情報									*/
//  struct sigaction	tAct;						/* シグナル用								*/
	struct sigaction	atAct[D_MAX_SIG_NUM];		/* シグナル用								*/
	long	lCnt;

	os_trcget2( D_MD_OS_DFLACT2, D_T_TRA_IN, 1, sig);
													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** %s:Start DbgSubFnc\n", "os_dflact2" ) );

	DbgMsg01(DLv04, (OutPut, "***** %s:sig = %d \n", "os_dflact2", sig));


	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	lEndCode = 0;									/* 終了コード クリア						*/
	lDetail = 0;									/* 詳細情報   クリア						*/
//	errno = 0;										/* errno      クリア						*/
	lCnt	= 0;


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	/****************************************/
	/*  デフォルトシグナルハンドラの登録	*/
	/****************************************/
													/* 20030228 修正							*/
	//tAct.sa_handler = os_dflact;					/* シグナルハンドラの設定					*/
	//tAct.sa_flags = 0;							/* シグナルフラグの設定						*/
	//sigaction(sig, &tAct, NULL);					/* シグナルの操作							*/

/*****  障害対応（TBCS0277）	Start									修正日：2003.08.11  *****/
																// 20030228 追加
	for(lCnt = 1; lCnt < D_MAX_SIG_NUM + 1; lCnt++)
//	for(lCnt = 0; lCnt < D_MAX_SIG_NUM; lCnt++)
	{
		switch(lCnt)
		{
			case SIGILL:
			case SIGBUS:
			case SIGFPE:
			case SIGSEGV:
			case SIGTERM:
			case 16:
				atAct[lCnt-1].sa_handler = os_dflact;	/* シグナルハンドラの設定					*/
//				atAct[lCnt].sa_handler = os_dflact;	/* シグナルハンドラの設定					*/
				break;
				
			default:
				atAct[lCnt-1].sa_handler = SIG_IGN;
//				atAct[lCnt].sa_handler = SIG_IGN;
				break;
		}
		atAct[lCnt-1].sa_flags = 0;					/* シグナルフラグの設定						*/
		sigaction(lCnt, &atAct[lCnt-1], NULL);		/* シグナルの操作							*/
//		atAct[lCnt].sa_flags = 0;					/* シグナルフラグの設定						*/
//		sigaction(lCnt + 1, &atAct[lCnt], NULL);	/* シグナルの操作							*/
	}
/*****  障害対応（TBCS0277）	End										修正日：2003.08.11  *****/

	/****************************************/
	/*  終了コード、詳細情報の作成			*/
	/****************************************/
	lEndCode = D_END_CODE3 & (0xffffff00 | sig);	/* 終了コードを設定							*/
													/* （シグナル番号でマスク）					*/

	lDetail = D_DETAIL_NON;							/* 詳細情報を設定（未使用）					*/

	DbgMsg01(DLv04, (OutPut, "***** %s:lEndCode = %08lx \n", "os_dflact2", lEndCode));


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
	/****************************************/
	/*  TRADEプロセス終了処理の呼び出し		*/
	/****************************************/
	os_endProcess();								/* TRADEプロセス終了処理の呼び出し			*/

	/****************************************/
	/*  プロセス終了手続き					*/
	/****************************************/
													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** %s: End  DbgSubFnc\n", "os_dflact2" ) );
	os_trcget2( D_MD_OS_DFLACT2, D_T_TRA_OUT, 0);
	
	os_abort(lEndCode, lDetail, 1);					/* アボート関数								*/
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
