/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_ErrirSetTimer											*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* 作成者：中野                                                             */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日：2002年10月8日                                                    */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 タイマーのエラー発行																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_ErrorSetTimer.h>														*/
/*																								*/
/*	   	long	os_ErrorSetTimer()																*/
/*																								*/
/* ＜仮引数＞																					*/
/*		なし																					*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了			NORMAL																*/
/*		異常終了			OSEEWKEX															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include "os_ErrorSetTimer_ins.h"
/****************************************************************************/
/* 機能：共通関数：タイマの発行エラー                                       */
/* 作成日：2002年10月8日                                                    */
/* 変更日：                                                                 */
/* 作成者：中野                                                             */
/* 呼出形式：                                                               */
/*   long os_ErrorSetTimer();                                               */
/****************************************************************************/
long os_ErrorSetTimer()
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
    TEtmcTableInd   *ptTEtmcTableInd;   // 発行エラーの個別部アドレス
    TEtmcTableInd   *ptTEtmcTableIndNext;
                                        // 次のタイマ
    long            lReqNum;            // タイマ管理テーブル個別部の
                                        // リクエスト番号
    TErdcTableInd   *ptTErdcTableInd;   // rd管理テーブル個別部アドレス
    long            lPCode;             // rd管理テーブル個別部のプロセス識別子
    long            lRet;               // 返却値処理用変数

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
//    DbgMsg01( DLv02, ( OutPut, "***** %s: Start Function\n", D_PROC_NAME ) );
    
    ptTErdcTableInd = ( TErdcTableInd * )( ptErdc + 1 );
                                        // rd管理テーブル個別部のアドレス
                                        // を取得する
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( ptTErdcTableInd=%p )\n",
    												D_PROC_NAME, ptTErdcTableInd ) );
    												
    ptTEtmcTableInd = ( TEtmcTableInd * )ptEtmc->ptNxtAdr;
                                        // タイマ管理テーブルの
                                        // 発行エラーの個別部アドレスを取得する
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( ptTEtmcTableInd=%p )\n",
    												D_PROC_NAME, ptTEtmcTableInd ) );
    												
    ptTEtmcTableIndNext = ( TEtmcTableInd * )ptTEtmcTableInd->ptNextAdr;
                                        // 次のタイマを取得する
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( ptTEtmcTableIndNext=%p )\n",
    												D_PROC_NAME, ptTEtmcTableIndNext ) );
    												
    lPCode = ( ptTErdcTableInd + ( ptTEtmcTableInd->lReqId - 1 ))->lPCode;  
                                        // rd管理テーブルの
                                        // タイマのリクエスト識別子番目の
                                        // プロセス識別子を取得する
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lPCode=%ld )\n",
    												D_PROC_NAME, lPCode ) );
    												
    lReqNum = ptTEtmcTableInd->lReqNum; // タイマ管理テーブルのリクエスト番号
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lReqNum=%ld )\n",
    												D_PROC_NAME, lReqNum ) );
    												
    lRet = os_SendTimeOutMsg( lPCode, lReqNum, D_RESULT_ERROR );
                                        // タイムアウトメッセージ送信
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lRet=0x%08lx )\n",
    												D_PROC_NAME, lRet ) );
    												
    if( lRet != NORMAL )                // タイムアウトメッセージのエラー
    {
        DbgMsg01( DLv05, ( OutPut, "***** %s: Err Function 01: 0x%08x\n",
    													D_PROC_NAME, OSEEWKEX ) );
        return( OSEEWKEX );
    }

    ptTEtmcTableInd->lReqNum = D_REQUESTNO_INI;
                                        // リクエスト番号の初期化
    DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( ptTEtmcTableInd->lReqNum=%ld )\n",
    												D_PROC_NAME, ptTEtmcTableInd->lReqNum ) );

//    DbgMsg01( DLv02, ( OutPut, "***** %s: End Function\n", D_PROC_NAME ) );
    return( NORMAL );                   // 正常終了 
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/

