/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_freeSG													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 ＳＧ設定ファイル用の共有メモリを削除する													*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_freeSG.h>																*/
/*																								*/
/*	   	long	os_freeSG()																		*/
/*																								*/
/* ＜仮引数＞																					*/
/*		なし																					*/
/*																								*/
/* ＜返却値＞																					*/
/*		NORMAL  ：正常終了																		*/
/*		-1      ：「SGFILEINF」データなし														*/
/*		その他  ：標準関数によるエラーはerrnoを返す												*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include	<stdio.h>
#include	<stdlib.h>
#include 	<string.h>
#include	<sys/types.h>
#include	<sys/stat.h>
#include	<fcntl.h>
#include	<unistd.h>
#include	<sys/ipc.h>
#include	<sys/shm.h>
#include	<errno.h>


/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_SG.h"
#include	"os_SG_ins.h"


long	os_freeSG()
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	FILE	*fp = NULL;								/* ファイルポインタの宣言 					*/
	char	acBuf[256];								/* ファイルリード領域						*/
	char	*pcTp = NULL;							/* トークン用ポインタ						*/
	long	lShmid;									/* 共有メモリID格納用						*/
	long	lRet;									/* 返却値									*/


													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgSubFnc\n", "os_freeSG" ) );

	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	lShmid = 0;
	lRet = 0;
	errno = 0;


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	/********************************************/
	/*  ＳＧ共有メモリＩＤ情報ファイルオープン	*/
	/********************************************/
	if ((fp = fopen(D_SG_FILE_INF, "r")) == NULL)	/* ファイルオープン							*/
	{
		os_trcget2(D_MD_OS_FREESG, D_T_SYS_FOPEN, 2, fp, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_freeSG", "fopen() Call Error!!", errno, strerror(errno)));
		return(errno);								/* 異常終了									*/
	}


	/********************************************/
	/*  ＳＧ共有メモリＩＤ情報ファイル読込み	*/
	/********************************************/
	if (NULL == fgets(acBuf, 256, fp))				/* ファイルリード（１行分リード）			*/
	{
		os_trcget2(D_MD_OS_FREESG, D_T_SYS_FGETS, 2, fp, errno );
													/* 該当データなしの場合						*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  %s \n", "os_freeSG",
				"処理異常!!", "該当するデータがありません"));
		return(-1);									/* 異常終了									*/
	}

	DbgMsg01(DLv04, (OutPut, "***** %s:acBuf=%s \n", "os_freeSG", acBuf));


	/********************************************/
	/*  読み込んだデータを変数に設定			*/
	/********************************************/
	pcTp = strtok( acBuf, " \n" );					/* ＳＧ共有メモリＩＤを抽出					*/
													/* 「=」を区切りに文字列を抽出				*/

	lShmid = atol(pcTp);							/* ＳＧ共有メモリＩＤを設定					*/
													/* （文字情報を整数値に変換して設定）		*/
	DbgMsg01(DLv04, (OutPut, "***** %s:pcTp=%s, lShmid=%#d \n", "os_freeSG", pcTp, lShmid));


	/********************************************/
	/*  ＳＧ共有メモリＩＤ情報ファイルクローズ	*/
	/********************************************/
	fclose(fp);										/* ファイルクローズ							*/


	/********************************************/
	/*  ＳＧ共有メモリＩの削除					*/
	/********************************************/
	lRet = shmctl(lShmid, IPC_RMID, 0);				/* 共有メモリ削除							*/
	if (-1 == lRet)
	{
		os_trcget2(D_MD_OS_FREESG, D_T_SYS_SHMCTL, 2, fp, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_freeSG", "shmctl() Call Error!!", errno, strerror(errno)));
		return(errno);								/* 異常終了									*/
	}


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "***** %s: End  DbgSubFnc\n", "os_freeSG" ) );
	return (NORMAL);								/* 正常終了									*/
}


/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
