/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_GetEbpcTableInd											*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* 作成者:五味                                                               */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日:2002年10月9日                                                      */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 バッファプール管理テーブル個別部の取得														*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_GetEbpcTableInd.h>														*/
/*																								*/
/*		long		os_GetEbpcTableInd( long poolid, void **bpinda )							*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long 		poolid;		プール識別子													*/
/*		void 		**bpinda;	バッファプール管理テーブル個別部アドレス格納域					*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了	NORMAL																		*/
/*		異常終了	OSEENEXS																	*/
/*					OSEEIPLI																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include "os_GetEbpcTableInd_ins.h"
/*****************************************************************************/
/* 機能:バッファプール管理テーブル個別部の取得                               */
/* 作成日:2002年10月9日                                                      */
/* 変更日:                                                                   */
/* 作成者:五味                                                               */
/* 呼出形式:                                                                 */
/*   long os_GetEbpcTableInd( long poolid, void **bpinda )                   */
/*     long poolid            プール識別子                                   */
/*     void **bpinda          バッファプール管理テーブル個別部アドレス格納域 */
/*                                                                           */
/*****************************************************************************/
long os_GetEbpcTableInd( long poolid, void **bpinda )
{
	long lAsso;							// 種別
	long lSerNum;						// 通番
	long lCmNum;						// バッファプールＣＭ数

	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_GETEBPCIND ) );

	lAsso = os_GetAsso(poolid);			// 種別の取得
	lSerNum = os_GetSerNum(poolid);		// 通番の取得

	if( lAsso == D_ASSO_LM )		// 種別がＬＭバッファプール識別子の時
	{
		if( (lSerNum < D_SERNUM_MIN) || (lSerNum > ptEbpc->lLmNum) )
		{								// 通番が範囲外である時
			DbgMsg01( DLv05, (OutPut, "***** %s:Err Function:%x\n", D_GETEBPCIND, OSEENEXS) );
			return( OSEENEXS );			// OSEENEXSを返却
		}
		*bpinda = (void *)ptEbpc + sizeof(TEbpcTable) + sizeof(TEbpcTableInd) * (lSerNum - 1);
										// 対象個別部アドレスの取得
	}
	else if( lAsso == D_ASSO_CM )	// 種別がＣＭバッファプール識別子の時
	{
		lCmNum = ptEbpc->lMaxNum - ptEbpc->lLmNum;
										// バッファプールＣＭ数の算出
		if( (lSerNum < D_SERNUM_MIN) || (lSerNum > lCmNum) )
		{								// 通番が範囲外である時
			DbgMsg01( DLv05, (OutPut, "***** %s:Err Function:%x\n", D_GETEBPCIND, OSEENEXS) );
			return( OSEENEXS );			// OSEENEXSを返却
		}
		*bpinda = (void *)ptEbpc + sizeof(TEbpcTable)
						+ sizeof(TEbpcTableInd) * (ptEbpc->lLmNum + lSerNum - 1);
										// 対象個別部アドレスの取得
	}
	else
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_GETEBPCIND, OSEEIPLI ) );
		return( OSEEIPLI );				// OSEEIPLIを返却
	}

	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_GETEBPCIND ) );
	return( NORMAL );					// NORMALを返却
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/

