/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＳＧ取得処理												*/
/* ＜モジュールＩＤ＞				 os_getSG													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月０４日		故障管理番号（ＴＢＣＳ０２０１）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		指定したキー情報でＳＧ設定ファイル（共有メモリ）を検索し、								*/
/*		該当するＳＧ設定情報のデータを取得する。                   								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_SG.h>																	*/
/*																								*/
/*	   	long	os_getSG( pcKey, pcStr )														*/
/*																								*/
/* ＜仮引数＞																					*/
/*		char	*pcKey;				SGキー情報の先頭アドレス									*/
/*		void	*pcStr;				SG値格納領域の先頭アドレス									*/
/*																								*/
/* ＜返却値＞																					*/
/*		NORMAL	：正常終了																		*/
/*		-1		：パラメータエラー																*/
/*		-2		：該当データなし																*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include	<stdio.h>
#include	<stdlib.h>
#include 	<string.h>
#include	<sys/types.h>
#include	<sys/stat.h>
#include	<fcntl.h>
#include	<unistd.h>
#include	<sys/ipc.h>
#include	<sys/shm.h>
#include	<errno.h>

/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_SG.h"
#include	"os_SG_ins.h"


/************************************ 外部変数宣言 **********************************************/
extern	char	*pcCmptr;							/* アタッチする仮想アドレスポインタ 		*/
extern	long	lCmSize;							/* 共有メモリサイズ							*/


long	os_getSG(pcKey, pcStr)
char	*pcKey;										/* 検索するＳＧ設定のキー情報				*/
void	*pcStr;										/* 該当するＳＧ設定を格納するアドレス		*/
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	char	*pcWorkptr = NULL;						/* ワークポインタ 							*/
	long	lCntMax;								/* ループの最大値							*/
	long	lCnt;									/* ループカウンタ							*/
	long	lLen1;									/* 文字数１（引数用）						*/
	long	lLen2;									/* 文字数２（共有メモリ用)					*/
	long	lRet;									/* 返却値									*/
	TSgFileInf	*ptSgptr = NULL;					/* ＳＧ設定ファイル情報ポインタ 			*/


													/* 関数入口									*/
//	DbgMsg01( DLv02, ( OutPut, "\n***** %s:Start DbgSubFnc\n", "os_getSG" ) );

	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	lCntMax = 0;
	lCnt = 0;
	lLen1 = 0;
	lLen2 = 0;
	lRet = 0;
	errno = 0;


	/********************************/
	/*  引数チェック                */
	/********************************/
	if ((0 == pcKey) || (0 == pcStr))				/* 引数が指定されてない場合は処理を終了する */
	{
		os_trcget2(D_MD_OS_GETSG, D_T_ERR_PRA, 2, pcKey, pcStr );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  %s \n", "os_getSG",
				"処理異常!!", "引数の指定に誤りがあります"));
		return (-1);								/* 異常終了									*/
	}

	/*  ＳＧ設定ファイル情報ポインタの先頭アドレスを定義	*/
	ptSgptr = (TSgFileInf *)pcCmptr;				/* 共有メモリ先頭アドレス設定				*/


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	/********************************/
	/*  指定されたキー情報の検索	*/
	/********************************/
	lCntMax = lCmSize / 2;							/* ループの最大値を設定						*/
	lLen1 = strlen(pcKey);							/* 文字列の長さを求める						*/

	DbgMsg01(DLv04, (OutPut, "***** %s:pcKey=%s, CntMax=%#d, lLen1=%#d \n",
									"os_getSG", pcKey, lCntMax, lLen1));

													/* ループ処理								*/
													/* カウント数×ＳＧ構造体サイズ < 最大値	*/
	for(lCnt = 0; (lCnt * sizeof(TSgFileInf)) < lCntMax; lCnt++, ptSgptr++)
	{
//		DbgMsg01(DLv04, (OutPut, "\n***** %s:Roop Count=%#d 回目  ", "os_getSG", lCnt));
//		DbgMsg01(DLv04, (OutPut, "ptSgptr=%08x, acSgKey=%s \n", ptSgptr, ptSgptr->acSgKey));

		lLen2 = strlen(ptSgptr->acSgKey);			/* 文字列の長さを求める                     */
		if (lLen1 != lLen2)							/* 文字数を比較して異なる場合は処理スキップ */
		{
			continue;
		}
													/* ＳＧ設定キーを比較する					*/
		lRet = strncmp(ptSgptr->acSgKey, pcKey, lLen1);
		if (0 == lRet)								/* 一致したキーがあった場合					*/
		{
			break;
		}
	}

/*****	故障管理番号TBCS0201の対応		Start							修正日：2003.07.04	*****/
	if ((lCnt * sizeof(TSgFileInf)) >= lCntMax)		/* ループの最大値を超えた場合はエラーを返す */
/*****	故障管理番号TBCS0201の対応		 End							修正日：2003.07.04	*****/
	{
		os_trcget2(D_MD_OS_GETSG, D_T_ERR_SYS, 0 );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  %s \n", "os_getSG",
				"処理異常!!", "該当するデータがありません"));
		return(-2);									/* 異常終了									*/
	}


	/********************************/
	/*  該当のＳＧを指定領域に設定  */
	/********************************/
	/*  属性を判別し文字列か整数値かを判断する	*/
	if ('S' == ptSgptr->cSgSts)						/* 文字列の場合								*/
	{
		pcWorkptr = (char *)ptSgptr->lSgValue;		/* ＳＧ設定ファイル情報の設定値を設定		*/
		strcpy(pcStr, pcWorkptr);					/* 文字情報格納領域に文字データをコピー		*/

	}
	else											/* 整数値の場合								*/
	{
		*(long *)pcStr = ptSgptr->lSgValue;			/* ＳＧ設定ファイル情報の設定値を設定		*/
	}


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
													/* 関数出口									*/
//	DbgMsg01( DLv02, ( OutPut, "\n***** %s: End  DbgSubFnc\n", "os_getSG" ) );
	return (NORMAL);								/* 正常終了									*/
}


/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
