/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_GstPrSep												*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* 作成者：高瀬                                                              */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日：2002年9月30日                                                     */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 プロセス情報の取得																			*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_GstPrSep.h>																*/
/*																								*/
/*	   	long	os_GstPrSep(long type,long inf)													*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long		type;		 		1.	プロセス識別子										*/
/*										2.	プロセスＩＤ										*/
/*		long		inf;		 		type 1.	 プロセス識別子									*/
/*											 2.  プロセスＩＤ 									*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		個別番号																*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
/*****************************************************************************/
#include <sys/types.h>
#include <sys/stat.h>
#include <unistd.h>
#include <errno.h>
#include "oscom_ins.h"

/*****************************************************************************/
/* 機能：プロセス情報の取得 　                                               */
/* 作成日：2002年9月27日                                                     */
/* 変更日：　　年　月　日                                                    */
/* 作成者：高瀬                                                              */
/* 呼出形式：                                                                */
/*   long os_GstPrSep( long type , long inf )                                */
/*       long type 　　　　１．プロセス識別子                                */
/*       　　　　　　　　　２．プロセスＩＤ　                                */
/*       long inf       tyep １．プロセス識別子                              */
/*       　　　　　　　　  　２．プロセス ＩＤ　                             */
/*                                                                           */
/*****************************************************************************/
long os_GstPrSep( long type , long inf  )
{
	int i;					/* ループカウンタ */
	TEprcTableInd  *ptprcAdr;		
                              /* メイルボックス管理テーブル個別部のアドレス */

DbgMsg01( DLv02, ( OutPut, "***** os_GstPrSep tyoe ID:%d inf :%d \n", type,inf));

/* 引数チェック */
    if ((type != 1) && (type  != 2)) {
	        return(-1);               /*　typeが不当　　　　　　　*/
    }
    ptprcAdr = (TEprcTableInd *)(ptEprc + 1 );                      
    if ((type == 1) && (inf ==0))
    {
        type =2;
    }
    if (type  == 1) {
            for( i=0;i<ptEprc->lIndPartNum;i++){
		if (ptprcAdr->lPCode == inf){
		    break;
		}
                ptprcAdr ++;
            } 
    }
    else {					/* プロセス　　　　 */
           for( i=0;i<ptEprc->lIndPartNum;i++){
		if (ptprcAdr->lPid == inf){
		    break;
        	}
                ptprcAdr ++;
            } 
    }
    if (i >= ptEprc->lIndPartNum) {
	 i= -1;
    }
DbgMsg01( DLv02, ( OutPut, "***** os_GstPrSep OUT :%d  \n", i));
    return(i);
}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
