/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_initEPBC												*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 プロセス管理テーブルの各項目の初期化を行う													*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_initEPBC.h>																*/
/*																								*/
/*	   	long	os_initEPBC(char *pcEpbcTableAdr)												*/
/*																								*/
/* ＜仮引数＞																					*/
/*		char	*pcEpbcTableAdr;	プロセス管理テーブル先頭アドレス							*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常戻り値	NORMAL																		*/
/*		異常戻り値	OSERRARG    引数異常                     									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	os_initSystem関数内でのみ使用する															*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <errno.h>
/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include "os_initEXXX.h"
#include "os_initEXXX_ins.h"

long os_initEPBC(char *pcEpbcTableAdr)
{
/****************************************/
/*	変数定義							*/
/****************************************/
	long lPbcKbt;								/*	EPBC個別部数:PB最大個数(128)*BP個別部数(128)	*/
	
	long lRes;
	
	DbgMsg01( DLv02, ( OutPut, "***** Start os_initEPBC\n") );
/****************************************/	
/*	初期処理							*/
/****************************************/
	//***** 引数の確認
	if(0 == pcEpbcTableAdr )
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s 01:Err Mess:%s\n", D_EPBC_TID, strerror(errno) ) );
		return( OSERRARG );						//引数異常 
	}
	
//	DbgMsg01( DLv04, ( OutPut, "***** pcEpbcTableAdr :%x\n", pcEpbcTableAdr));
	/****************************************/	
	/*	SGの読み込み						*/
	/****************************************/	
	
//	DbgMsg01( DLv04, ( OutPut, "***** SG読み込み開始\n"));
	lRes = os_getSG(D_SG_EPBC_NUM,&lPbcKbt);
	if(NORMAL != lRes)							//ＳＧ読込異常
	{
		DbgMsg01( DLv05, ( OutPut, "***** GetSG Err01%s\n", strerror(errno) ) );
		return( OSERRSG );						//ＳＧ読込処理を返却
	}
	
//	DbgMsg01( DLv04, ( OutPut, "***** SG読み込み終了\n"));
	
	/*	管理部領域の構造化						*/
	ptEpbc = (TEpbcTable *)pcEpbcTableAdr;
//	DbgMsg01( DLv04, ( OutPut, "***** ptEpbc:%x\n", ptEpbc) );
	
/****************************************/
/*	本処理								*/
/****************************************/

	/*	管理部情報の初期化						*/
	strncpy( ptEpbc->acTid, D_EPBC_TID, 4 );	/*	領域識別子にEPBCのを指定する	*/
//	DbgMsg01( DLv04, ( OutPut, "***** ptEpbc->acTid:%s\n", D_EPBC_TID) );

/****************************************/	
/*	終了処理							*/
/****************************************/	
	DbgMsg01( DLv02, ( OutPut, "***** End os_initEPBC\n") );
	return (NORMAL);
}
