/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_initEMBC												*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		メイルボックス管理テーブルの領域確保を共有メモリ内に確保して初期化を実施する。			*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_initEMBC.h>																*/
/*																								*/
/*	   	long	os_initEMBC( pcEmbcTableAdr )													*/
/*																								*/
/* ＜仮引数＞																					*/
/*      char    *pcEmbcTableAdr;			メイルボックス管理テーブル先頭アドレス				*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常			NORMAL																	*/
/*      異常			OSERRARG			引数異常											*/
/*						OSERRSG				ＳＧ読込失敗										*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*      os_initSystem関数内ののみ使用可能とする。                                               */
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <errno.h>

#include "os_initEXXX.h"
#include "os_initEXXX_ins.h"

long os_initEMBC(pcEmbcTableAdr)
char    *pcEmbcTableAdr;                            /* メイルボックス管理テーブル先頭アドレス	*/
{
    /********************************************************************************************/
    /*  ＳＧ設定ワーク領域                                                                      */
    /********************************************************************************************/
    long lEmbcpSu;                                  /* EMBC 個別部数                            */
    long lEmbcMsglen;                               /* EMBC 最大メッセージ長                    */
	TEmbcTableInd   *ptEmbcp;                       /* EMBC 個別部ポインタ                      */
    long lWorkMboxId;                               /* ワークメイルボックス識別子               */
    long lUserNum;                                  /* ユーザ個別部数                           */
    long lCnt;                                      /* ループカウンタ                           */
	long lRes;

													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** Start os_initEMBC\n") );

    /********************************************************************************************/
    /*  初期処理                                                                                */
    /********************************************************************************************/
    /********************************/
    /*  引数チェック                */
    /********************************/
    /*  メイルボックス管理テーブル先頭アドレスの値が「０」の場合は          */
    /*  処理を終了する                                                      */
    if (0 == pcEmbcTableAdr)
    {
    	return( OSERRARG );    				/* メイルボックス管理テーブル先頭アドレス不正 */
    }
        
    /********************************/
    /*  ＳＧ読み込み                */
    /********************************/
//	DbgMsg01( DLv04, ( OutPut, "***** SG読み込み開始\n"));
	
    lRes = os_getSG(D_SG_EMBC_NUM,&lEmbcpSu);			/* EMBC個別部数読み込み*/
	if(NORMAL != lRes)
	{
		DbgMsg01( DLv05, ( OutPut, "***** GetSG Err01%s\n", strerror(errno) ) );
		return( OSERRSG );								/*	ＳＧ読込失敗　*/
	}
    
    lRes = os_getSG(D_SG_EMBC_MSG_LEN,&lEmbcMsglen);	/* EMBC最大メッセージ長読み込み*/
	if(NORMAL != lRes)
	{
		DbgMsg01( DLv05, ( OutPut, "***** GetSG Err01%s\n", strerror(errno) ) );
		return( OSERRSG );                              /*  ＳＧ読込失敗　*/
	}
    
    lRes = os_getSG(D_SG_EMBC_USER_NUM,&lUserNum);	/* ユーザ個別部数読み込み*/
	if(NORMAL != lRes)
	{
		DbgMsg01( DLv05, ( OutPut, "***** GetSG Err01%s\n", strerror(errno) ) );
		return( OSERRSG );                              /*  ＳＧ読込失敗　*/
	}
    
//    DbgMsg01( DLv04, ( OutPut, "***** SG読み込み終了\n"));
    /********************************/
    /*  設定領域の構造化            */
    /********************************/
//	DbgMsg01(DLv04, (OutPut, "***** %s:pcEmbcTableAdr = %08x\n", "os_initEMBC", pcEmbcTableAdr));

    /* 管理部情報の定義 */
    ptEmbc = (TEmbcTable *)pcEmbcTableAdr;
//	DbgMsg01( DLv04, ( OutPut, "***** %s:ptEmbc  = %08x\n", "os_initEMBC", ptEmbc) );

    /* 個別部情報の定義 */
	ptEmbcp = (TEmbcTableInd *)(ptEmbc + 1);
//	DbgMsg01( DLv04, ( OutPut, "***** %s:ptEmbcp = %08x\n", "os_initEMBC", ptEmbcp) );


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
    /********************************/
    /*  管理部情報の初期化          */
    /********************************/
//    DbgMsg01( DLv04, ( OutPut, "***** EMBC管理部情報初期化\n"));
    
    strncpy( ptEmbc->acTid, D_EMBC_TID,4); 			/* EMBC領域識別子を設定                     */
    
    ptEmbc->lIndPartNum = lEmbcpSu;					/* 最大個別部数を設定                       */
    
    ptEmbc->lUserIndNum = lUserNum;					/* ユーザ個別部数を設定                     */
    
    ptEmbc->lMaxMsgLng = lEmbcMsglen;   			/* EMBC最大メッセージ長を設定               */
    
//	DbgMsg01( DLv04, ( OutPut, "***** %s:acTid    = %s\n", "os_initEMBC", ptEmbc->acTid) );
//	DbgMsg01( DLv04, ( OutPut, "***** %s:lEmbcpSu = %d\n", "os_initEMBC", ptEmbc->lIndPartNum) );
//	DbgMsg01( DLv04, ( OutPut, "***** %s:lUserNum = %d\n", "os_initEMBC", ptEmbc->lUserIndNum) );
//	DbgMsg01( DLv04, ( OutPut, "***** %s:MsgLng   = %08x\n", "os_initEMBC", ptEmbc->lMaxMsgLng) );


    /********************************/
    /*  個別部情報の初期化          */
    /********************************/
//    DbgMsg01( DLv04, ( OutPut, "***** EMBC個別部初期化\n"));
    
    lWorkMboxId = D_MBOX_ID_MIN;          			/* ワークメイルボックス識別子設定           */
//	DbgMsg01( DLv04, ( OutPut, "***** %s:MboxId  = %08x\n", "os_initEMBC", lWorkMboxId) );

    /* EMBC 個別部数分ループ */
    for( lCnt = 0; lCnt< lEmbcpSu; lCnt++)
    {
//		DbgMsg01( DLv04, ( OutPut, "***** %s:lCnt = %08x, lEmbcpSu = %08x\n",
//												"os_initEMBC", lCnt, lEmbcpSu) );
        /* EMBC 個別部メイルボックス識別子設定 */
		(ptEmbcp + lCnt)->lMBoxId = lWorkMboxId;
//		DbgMsg01(DLv04, (OutPut, "***** %s:ptEmbcp(%04d) = %08x, lMBoxId = %08x\n\n", 
//						"os_initEMBC", lCnt, (ptEmbcp + lCnt), (ptEmbcp + lCnt)->lMBoxId));

        /* カウントアップ */
        lWorkMboxId = lWorkMboxId + 1;
    }


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "***** End os_initEMBC\n") );
	return (NORMAL);
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
