/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＳＧ初期処理												*/
/* ＜モジュールＩＤ＞				 os_initSG													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０８月１１日     故障管理番号（ＴＢＣＳ０２７５）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 ＳＧ設定ファイルをリードし共有メモリ内に確保する。											*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_SG.h>																	*/
/*																								*/
/*	   	long	os_initSG() 																	*/
/*																								*/
/* ＜仮引数＞																					*/
/*		なし																					*/
/*																								*/
/* ＜返却値＞																					*/
/*		NORMAL	：正常終了																		*/
/*		-1		：システムコールエラー															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include	<stdio.h>
#include	<stdlib.h>
#include 	<string.h>
#include	<sys/types.h>
#include	<sys/stat.h>
#include	<fcntl.h>
#include	<unistd.h>
#include	<sys/ipc.h>
#include	<sys/shm.h>
#include	<errno.h>
#include	<ctype.h>



/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_SG.h"
#include	"os_SG_ins.h"


/************************************ 外部関数宣言 **********************************************/
long	BlpMpf_ntok(char *name, int id);			/* 富士通提供関数							*/


long	os_initSG()
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	FILE	*fp = NULL;								/* ファイルポインタの宣言 					*/
	char	acBuf[256];								/* ファイルリード領域						*/
	char	*pcTp = NULL;							/* トークン用ポインタ						*/
	char	*pcCmptr = NULL;						/* アタッチする仮想アドレスポインタ 		*/
	char	*pcWorkptr = NULL;						/* ワークポインタ 							*/
	long    lShmKey;                                /* 共有メモリKey情報                        */
	long 	lShmid;									/* 共有メモリID格納用						*/
	long	lCmSize;								/* 共有メモリサイズ							*/
	long	lCnt;									/* ループカウンタ							*/
	long	lAdr;									/* ポインタ位置								*/
	long	lLen;									/* 文字数									*/
	long	lRet;									/* 返却値									*/
	TSgFileInf	*ptSgptr = NULL;					/* ＳＧ設定ファイル情報ポインタ 			*/
	struct stat	fStr;								/* ファイルのステータス情報					*/
	long	lCcnt = 0;


													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgSubFnc\n", "os_initSG" ) );

	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	lShmKey = 0; 
	lShmid = 0;
	lCmSize = 0;
	lCnt = 0;
	lRet = 0;
	lAdr = 0;
	errno = 0;


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	/********************************/
	/*  共有メモリサイズの算出		*/
	/********************************/
	lRet = stat(D_SG_FILE, &fStr);					/* SG設定ファイルの状態を取得				*/
	if (-1 == lRet)
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_FSTAT, 2, lRet, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "stat() Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}

	/*  算出：「ETMC 管理部情報」 + 「ETMC 個別部情報」 *  個別部数		*/
	lCmSize = sizeof(TSgFileInf) * fStr.st_size ;	/* ＳＧ設定情報×ＳＧ設定ファイルサイズ		*/

	DbgMsg01(DLv04, (OutPut, "***** %s:lRet=%08x, fStr.st_size=%d, lCmSize=%d \n",
											"os_initSG", lRet, fStr.st_size, lCmSize));

	/********************************/
	/*  共有メモリの確保            */
	/********************************/
													/*  富士通提供関数(ntok)を発行              */
	lShmKey = BlpMpf_ntok(D_SG_NTOK_KEY, D_NTOK_ID);
													/*  共有メモリ確保                          */
	lShmid = shmget(lShmKey, lCmSize, D_SEM_ACCESS | IPC_CREAT | IPC_EXCL);

	if (-1 == lShmid)
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_SHMGET, 2, lShmid, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "shmget() Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}

	DbgMsg01(DLv04, (OutPut, "***** %s:lShmKey=%#d, lShmid=%#d \n", "os_initSG", lShmKey, lShmid));


	/********************************/
	/*  共有メモリのアタッチ        */
	/********************************/
	//  暫定版
													/* 共有メモリのアッタチ						*/
	pcCmptr = shmat(lShmid, (char *)0x46000000, SHM_RND);
/*****  障害対応（TBCS0275）    Start                                   修正日：2003.08.11  *****/
/************************************************************************************************/
/*  返却値判定を「−１」でするように修正                                                        */
/************************************************************************************************/
	if ( D_ERR_SYS == (long)pcCmptr )
/*****  障害対応（TBCS0275）    End                                     修正日：2003.08.11  *****/
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_SHMAT, 2, pcCmptr, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "shmat() Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}

	/*  ＳＧ設定ファイル情報ポインタの先頭アドレスを定義	*/
	ptSgptr = (TSgFileInf *)pcCmptr;				/* 共有メモリ先頭アドレス設定				*/

	/*  ＳＧ値（文字列情報）を格納する先頭アドレスを定義	*/
	pcWorkptr = pcCmptr + (lCmSize / 2);			/* 文字列情報格納用先頭アドレス設定			*/
													/* 共有メモリアドレス＋共有メモリサイズ÷２ */

	DbgMsg01(DLv04, (OutPut, "***** %s:pcCmptr=%08x, ptSgptr=%08x, pcWorkptr=%08x \n",
											"os_initSG", pcCmptr, ptSgptr, pcWorkptr));


	/********************************/
	/*  ＳＧ設定ファイルオープン	*/
	/********************************/
	if ((fp = fopen(D_SG_FILE, "r")) == NULL)		/* ファイルオープン							*/
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_FOPEN, 2, fp, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "fopen() No.1 Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}


	/********************************/
	/*  ファイルの終了までループ    */
	/********************************/
	while(1)
	{
		/*  クリア						*/
		lLen = 0;
		memcpy(acBuf, "\0", sizeof(acBuf));


		/********************************/
		/*  ＳＧ設定ファイル読込み		*/
		/********************************/
		if (NULL == fgets(acBuf, 256, fp))			/* ファイルリード（１行分リード）			*/
		{
			break;									/* データが終了したらループを抜ける			*/
		}

		lCnt++;										/* ループカウンタ  カウントアップ			*/
		DbgMsg01(DLv04, (OutPut, "***** %s:Roop Count=%#d 回目\n", "os_initSG", lCnt));
		DbgMsg01(DLv04, (OutPut, "***** %s:ptSgptr=%08x \n", "os_initSG", ptSgptr));


		/********************************************/
		/*  ＳＧ設定ファイル情報を共有メモリに設定  */
		/********************************************/
													/*  ＳＧ設定キーを抽出						*/
        //pcTp = strtok( acBuf, "= " );				/* 「=」を区切りに文字列を抽出				*/
        pcTp = strtok( acBuf, "=" );				// 20030307 修正

		//DbgMsg01(DLv04, (OutPut, "***** pcTp:%s\n", pcTp ));
													// 20030312 追加
													// スペース以外の文字が来るまで
													// 先頭ポインタを動かす
		while( isblank( pcTp[0] ) )
			pcTp += 1;

		switch( pcTp[0] )
		{
			case '#':
			case '\n':
			case '\0':
													// 「#」 「\n」 「\0」 は読み飛ばす
				DbgMsg01(DLv04, (OutPut, "***** %s:処理スキップ \n", "os_initSG"));
				continue;
				
			default:
				break;
		}
													// 文字列が続く限り読み続ける
		lCcnt = 0;
		while( isgraph(pcTp[lCcnt]) )
			lCcnt++;

		pcTp[lCcnt] = '\0';
		
													// 20030312 修正
//		if ('#' == *pcTp)							/* 先頭に「#」がある場合は読み飛ばす		*/
//		{
//			DbgMsg01(DLv04, (OutPut, "***** %s:処理スキップ \n", "os_initSG"));
//			continue;
//		}
													/* ＳＧ設定ファイル情報のキー情報に設定		*/
		memcpy(ptSgptr->acSgKey, pcTp, sizeof(ptSgptr->acSgKey));
		DbgMsg01(DLv04, (OutPut, "***** %s:ptTp=%s, acSgKey=%s \n",
										"os_initSG", pcTp, ptSgptr->acSgKey));

													/*  ＳＧ値を抽出							*/
		pcTp = strtok( NULL,"\n #" );				/* （残り）ＳＧ値を抽						*/
		if ( pcTp != NULL )
		{
			lLen = strlen(pcTp);					/* 文字列の長さを求める						*/

			/************************************/
			/*  ＳＧの設定値が文字かチェック	*/
			/*  （"  〜  "の場合は文字）		*/
			/************************************/
			if ('"' == *(pcTp+0))					/* 先頭の値が「"」かチェック				*/
			{
				if ('"' != *(pcTp + lLen - 1))		/* 最後の値が「"」かチェック				*/
				{
													/* 障害発生									*/
					DbgMsg01(DLv05, (OutPut, "***** %s:%s  %#d 行目の%s \n", "os_initSG",
						"処理異常!!", lCnt, "ＳＧ設定ファイルの設定値に誤りがあります"));

					goto Error;						/* エラー終了								*/
				}
				else								/* 文字列データが正常な場合					*/
				{
													/* 文字情報格納用ポインタアドレス位置算出	*/
					pcWorkptr = pcWorkptr + lAdr;
													/* 文字情報格納領域に文字データをコピー		*/
													/* （「"」を除いた文字列情報をコピー）		*/
					strncpy(pcWorkptr, pcTp + 1, lLen - 2);
					ptSgptr->lSgValue = (long)pcWorkptr;
					ptSgptr->cSgSts = 'S';			/* ＳＧ設定ファイル情報の属性を設定         */

					DbgMsg01(DLv04, (OutPut, "***** %s:pcTp=%s, lLen=%#d, lSgValue=%08x\n",
												"os_initSG", pcTp, lLen, ptSgptr->lSgValue));
					DbgMsg01(DLv04, (OutPut, "***** %s, cSgSts=%c \n", pcWorkptr, ptSgptr->cSgSts));

					lAdr = lAdr + lLen;				/* 設定した文字数分カウントアップ			*/
					ptSgptr++;						/* ＳＧ設定ファイル情報をインクリメント		*/
				}
			}
			else									/* 整数値の場合								*/
			{
													/* ＳＧ設定ファイル情報の設定値を設定		*/
													/* （文字情報を整数値に変換して設定）		*/
				//ptSgptr->lSgValue = atol(pcTp);
													// 20030307 追加修正
				ptSgptr->lSgValue = strtol(pcTp, NULL, 0);
				ptSgptr->cSgSts = 'N';				/* ＳＧ設定ファイル情報の属性を設定         */

				DbgMsg01(DLv04, (OutPut, "***** %s:pcTp=%s, lLen=%#d, lSgValue=%#d\n",
												"os_initSG", pcTp, lLen, ptSgptr->lSgValue));
				DbgMsg01(DLv04, (OutPut, "***** %s:cSgSts=%c \n", "os_initSG", ptSgptr->cSgSts));

				ptSgptr++;							/* ＳＧ設定ファイル情報をインクリメント		*/
			}
		}
	}

	/********************************/
	/*  ＳＧ設定ファイルクローズ	*/
	/********************************/
	fclose(fp);										/* ファイルクローズ							*/


	/********************************/
	/*  ファイルへ情報を書き出す	*/
	/********************************/
													/* ＳＧ設定ファイル情報ファイル設定			*/
	if ((fp = fopen(D_SG_FILE_INF, "w")) == NULL)	/* ファイルオープン							*/
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_FOPEN, 2, fp, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "fopen() No.2 Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}
	
	fprintf(fp, "%ld %ld \n", lShmid, lCmSize);		/* ファイル出力								*/

	fclose(fp);										/* ファイルクローズ							*/


	/********************************/
	/*  共有メモリのデタッチ		*/
	/********************************/
	lRet = shmdt(pcCmptr);							/* 共有メモリのデッタチ						*/
	if (-1 == lRet)
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_SHMDT, 2, lRet, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "shmdt() Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}

	DbgMsg01(DLv05, (OutPut, "***** %s:shmdt() Call lRet=%08x \n", "os_initSG", lRet));


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "***** %s: End  DbgSubFnc\n", "os_initSG" ) );

	return (NORMAL);								/* 正常終了									*/


Error :
	fclose(fp);										/* ファイルクローズ							*/

	lRet = shmdt(pcCmptr);							/* 共有メモリのデッタチ						*/
	if (-1 == lRet)
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_SHMDT, 2, lRet, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "shmdt() Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}

	lRet = shmctl(lShmid, IPC_RMID, 0);				/* 共有メモリ削除							*/
	if (-1 == lRet)
	{
		os_trcget2(D_MD_OS_INITSG, D_T_SYS_SHMCTL, 2, lRet, errno );
													/* 障害発生									*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
				"os_initSG", "shmctl() Call Error!!", errno, strerror(errno)));
		return(-1);									/* 異常終了									*/
	}

	os_trcget2(D_MD_OS_INITSG, D_T_ERR_SYS, 0 );
	return (-1);									/* 異常終了									*/
}


/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
