/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_initESMC												*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 共有メモリ管理テーブルの領域確保を共有メモリ内に確保して初期化を実施する					*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_initESMC.h>																*/
/*																								*/
/*	   	long	os_initESMC(char *pcEsmcTableAdr)												*/
/*																								*/
/* ＜仮引数＞																					*/
/*		char		*pcEsmcTableAdr;	共有メモリ管理テーブル先頭アドレス						*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常戻り値	NORMAL																		*/
/*		異常戻り値	OSERRARG			引数異常												*/	
/*					OSERRSG				ＳＧ読込異常											*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	os_initSystem関数内でのみ使用可能とする														*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/sem.h>
/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include "os_initEXXX.h"
#include "os_initEXXX_ins.h"

long os_initESMC(char *pcEsmcTableAdr)
{
/****************************************/
/*	変数定義							*/
/****************************************/
	TEsmcTableInd	*ptEsmcTableInd;			// 共有メモリ個別テーブル
	
	long lESMCKbt;			//SG	ESMC個別部数
	long lSgShikibetuMin;	//SG	共有メモリ識別子最小値
	long lSgShikibetuMax;	//SG	共有メモリ識別子最大値
	
	long lCnt;
	long lRes;

/****************************************/
/*	初期処理							*/
/****************************************/
	DbgMsg01( DLv02, ( OutPut, "***** Start os_initESMC\n") );

	if( pcEsmcTableAdr == 0){		// 引数の確認
		DbgMsg01( DLv05, ( OutPut, "***** %s 01:Err Mess:%s\n", "os_initESMC", strerror(errno) ) );
		return( OSERRARG );			// 共有メモリ管理テーブル先頭アドレス異常
	}
		
	/****************************************/
	/*	SGの読み込み						*/
	/****************************************/

	
	lRes = os_getSG(D_SG_ESMC_NUM,&lESMCKbt);	// EPRC個別部読み込み
	if(NORMAL != lRes)
	{
		DbgMsg01( DLv05, ( OutPut, "***** GetSG Err01:%s\n", strerror(errno) ) );
		return( OSERRSG );						//ＳＧ読込異常
	}
	
	lSgShikibetuMin = D_ESMC_SEM_MIN;	// 共有メモリ識別子最小値読み込み

	lSgShikibetuMax = D_ESMC_SEM_MAX;	// 共有メモリ識別子最大値読み込み

/****************************************/
/*	本処理								*/
/****************************************/
	ptEsmc = (TEsmcTable *)pcEsmcTableAdr;		// 共有メモリ管理テーブル管理部情報を割り当て
//	DbgMsg01( DLv04, ( OutPut, "***** ptEsmc 管理部先頭アドレス:%x\n", ptEsmc) );
	
	ptEsmcTableInd = (TEsmcTableInd *) ( (long)(ptEsmc) + sizeof(TEsmcTable) );
	// 個別部の先頭アドレスを求め、ESMC個別部情報に当てる
//	DbgMsg01( DLv04, ( OutPut, "***** ptEsmcTableInd 個別部先頭アドレス:%x\n", ptEsmcTableInd) );
	
	//***** 管理部情報の初期化
	strncpy( ptEsmc->acTid, D_ESMC_TID, 4);	// 領域識別子にESMC識別子を指定
//	DbgMsg01( DLv04, ( OutPut, "***** 領域識別子 :%s\n", ptEsmc->acTid) );
	
	ptEsmc->lIndPartNum = lESMCKbt;
//	DbgMsg01( DLv04, ( OutPut, "***** ptEsmc->lIndPartNum :%ld\n", ptEsmc->lIndPartNum) );
	
	//***** 個別部情報の初期化
	// 共有メモリ識別子の設定でESMC個別部にに指定する

	for(lCnt = 0; lCnt < lESMCKbt ; lCnt++){
		(ptEsmcTableInd + lCnt)->lShmKey = lSgShikibetuMin++;
//		DbgMsg01( DLv04, ( OutPut, "*****  共有メモリ識別子[%04d]:%08x\n", lCnt, (ptEsmcTableInd + lCnt)->lShmKey ) );
	}

/****************************************/
/*	終了処理							*/
/****************************************/
	DbgMsg01( DLv02, ( OutPut, "***** End os_initESMC\n") );
	return (NORMAL);
}

