/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_KeyGen													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	SGKeyをプロセス固有のKey値にする															*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<oscreat.h>																	*/
/*																								*/
/*		long os_KeyGen( const char *in, char *out )												*/
/*																								*/
/* ＜仮引数＞																					*/
/*		char *in	SGファイルから得たntok用のKey文字列											*/
/*		char *out	変換された値格納用															*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常戻り値	NORMAL																		*/
/*		異常戻り値	未決定																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/************************************************************************************************/
/* ＜呼出形式＞ 																				*/
/*		#include	"os_KeyGen.h"																*/
/*																								*/
/*		long os_KeyGen( const char *in, char *out )												*/
/*																								*/
/* ＜仮引数＞																					*/
/*		char *in	SGファイルから得たntok用のKey文字列											*/
/*		char *out	変換された値格納用															*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常戻り値	NORMAL																		*/
/*		異常戻り値	未決定																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*																								*/
/*																								*/
/*																								*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>

#include "os_KeyGen.h"
#include "os_KeyGen_ins.h"

/* これでos_getSGから取って来た文字列に処理を加えることにより */
/* プロセス毎で異なるSGKeyを取得することになる                */

long os_KeyGen(const char *in, char *out)
{
    long lTemp = 0;
    long lIndat = 0;
    long lOutdat = 0;
    long lMyPrc = 0;								// 自プロセス識別子用
    TEprcTableInd *ptMyEprcInd = NULL;				// 自プロセス個別部用

	DbgMsg01(DLv02, (OutPut, "***** Start os_KeyGen *****\n"));
//	DbgMsg01(DLv04, (OutPut, "***** in : %s\n", in));
	if( (NULL == in) || (NULL == out) )
	{
		DbgMsg01(DLv05, (OutPut, "***** 01 Err:引数 エラー\n"));
		return(D_RESULT_ERROR);
	}
	
    lIndat = strtol(in, NULL, 16);
//	DbgMsg01(DLv04, (OutPut, "***** Indat : %08lx\n", lIndat));

	ptMyEprcInd = (TEprcTableInd *)(ptEsys->tMyPrcInfo.ptMyEPRC);	// 自プロセス個別部取得
	lMyPrc = ptMyEprcInd->lPCode;		// 自プロセス識別子取得
	
		// 自プロセス識別子を使用してプロセス固有のntok用Keyを作成
		// 下位３桁を使用
    lTemp = ( (lMyPrc & 0x0000ffff) << 4 );
//	DbgMsg01(DLv04, (OutPut, "***** lTemp : %08lx\n", lTemp));
    
    lOutdat = lIndat | lTemp;
//	DbgMsg01(DLv04, (OutPut, "***** lOutdat : %08lx\n", lOutdat));
    sprintf(out, "%08lx", lOutdat);
    
	DbgMsg01(DLv02, (OutPut, "***** End os_KeyGen *****\n"));
    return(NORMAL);
}
/************************************************************************************************/
/*	END																							*/
/************************************************************************************************/
