static char LSid[] = "@(#) LALa-SMP libmtre.so  V/R = 2/1-0052 2003.08.18 ";
void	os_libmtre()
{
/*********************************************************************/
/*  通番を変更した場合には日付も更新すること！！！				 	 */
/*********************************************************************/
/*********************************************************************/
/*  0002 : 	                                                         */
/*********************************************************************/
/*  0003 : 2002/12/09                                                */
/*         osmsgqget.c,os_CheckRCode.c,osioctl1.cをlibmtre.soに追加  */
/*********************************************************************/
/*********************************************************************/
/*  0004 : 2002/12/12                                                */
/*         osstdtim.c,ossttim.c,oscrepr.cを修正,osioctl1.o,os_tcpex.o*/
/*         osconn2.o,osdconn2.o,osiioctl2.o,osioctl2.o,osireadd2.o   */
/*         osiwritd2.o を追加, oscom_ins.hを修正                     */
/*********************************************************************/
/*********************************************************************/
/*  0005 : 2002/12/13                                                */
/*         oscrepr.cに暫定処理を追加                                 */
/*         os_MainMsgQ.c, os_MsgRcvEdit.c, os_SubMsgQ.c, 			 */	
/*         osgtnrl.c, osanyrl.c, os_MsgRcvEdit_ins.h,    			 */
/*         os_SubMsgQ_ins.hを修正                        			 */
/*********************************************************************/
/*********************************************************************/
/*  0006 : 2002/12/16                                                */
/*         oscrepr.cにシグナル送受信関連を追加                    	 */
/*         osanyrl.cでプールバッファメッセージ受信を可能とする       */
/*********************************************************************/
/*********************************************************************/
/*  0007 : 2002/12/20                                                */
/*         os_initEPRC.c strcpy()がstrncpy()を変えました			 */
/*		   os_MyEMBC.c strcpy()がstrncpy()を変えました				 */
/*		   oscrepr.c strcpy()がstrncpy()を変えました				 */
/*		   osgtpin.c strcpy()がstrncpy()を変えました				 */
/*		   osconn2.c strcpy()がstrncpy()を変えました				 */
/*		   oscremb.c文字コードを修正した							 */
/*		   osdelay.c引数timesが0の場合,正常終了する処理を追加した    */
/*		   osrcvms.c ：故障処理票S00017の対応					     */
/*		   osrcvmsp.c：故障処理票S00017の対応						 */
/*********************************************************************/
/*********************************************************************/
/*  0008 : 2002/12/24                                                */
/*         ossenms.c 故障処理票S00018の対応                          */
/*         デバグオプションの設定の変更                              */
/*         デバグ文出力のファイル化、PIDと時間の付与                 */
/*         (ログファイルは/tmp配下に作成される)                      */
/*		   osrcvms.c 故障処理票S00016の対応							 */
/*         サブメッセージキューからの受信処理に						 */
/*         サブメッセージの削除機能を追加しました。				     */	
/*         osrcvmsp.c  同上 										 */
/*         osfrpbf.c 返却値に「OSEENFND 0x80800063」が返却されます。 */
/*********************************************************************/
/*********************************************************************/
/*  0009 : 2003/01/07                                                */
/*         osiioctl2.c  故障処理票KL0003の対応                       */
/*********************************************************************/
/*********************************************************************/
/*  0010 : 2003/01/08                                                */
/*         os_initEMMC,oswrite1が新規追加                            */
/*********************************************************************/
/*********************************************************************/
/*  0011 : 2003/01/14                                                */
/*         SIGALRMによるタイムアウト通知に対応                       */
/*         oswrite1.c  故障対応                                      */
/*********************************************************************/
/*********************************************************************/
/*  0012 : 2003/01/15                                                */
/*		   os_CheckRCode.c  故障処理票KL0003の対応					 */
/*         os_tcpex.c       故障処理票KL0003の対応					 */
/*         osiioctl2.c      故障処理票KL0003の対応					 */
/*         osrcvms.c        故障処理票KL0003の対応					 */
/*         osrcvmspr.c      故障処理票KL0003の対応					 */
/*         osrcvmsr.c       故障処理票KL0003の対応					 */
/*         osstdtim.c       故障処理票KL0003の対応					 */
/*         ossttim.c        故障処理票KL0003の対応 					 */
/*********************************************************************/
/*  0013 : 2003/01/16                                                */
/*         os_initProcess.c タイムアウト通知に対応                   */
/*         osfrpbf.c 仕様変更に対応                                  */
/*********************************************************************/
/*********************************************************************/
/*  0014 : 2003/01/21                                                */
/*         os_tcpex.c       スレッド処理の仕様変更に対応			 */
/*         os_timex.c       シグナルの大量受信に対応                 */
/*         oswrite1.c       故障処理票S00028に対応                   */
/*********************************************************************/
/*  0015 : 2003/01/22                                                */
/*         osatshm.c        共有メモリシステムコールの仕様変更に対応 */
/*         osdtshm.c        共有メモリシステムコールの仕様変更に対応 */
/*         osgtshm.c        共有メモリシステムコールの仕様変更に対応 */
/*********************************************************************/
/*  0016 : 2003/01/31                                                */
/*         osrcvms.c        故障処理票S00024の対応                   */
/*         os_tcpex.c       仕様変更に対応                           */
/*         os_trcget.c      トレース機能を新規追加                   */
/*********************************************************************/
/*  0017 : 2003/02/07                                                */
/*         os_initETMC.c    仕様変更に対応                           */
/*         os_initERDC.c    仕様変更に対応                           */
/*         os_initEFLC.c    仕様変更に対応                           */
/*********************************************************************/
/*  0018 : 2003/02/10                                                */
/*         os_MsgRcvEdit.c	故障処理票KL00013に対応                  */
/*         oswrite1.c		仕様変更に対応                           */
/*********************************************************************/
/*  0019 : 2003/02/14                                                */
/*         oswrite1.c       仕様変更に対応                           */
/*         終了処理正常系   新規対応                                 */
/*         oscrepr.c        シグナル障害暫定対処                     */
/*********************************************************************/
/*  0020 : 2003/02/17                                                */
/*         osgttrmcod.c     親プロセスへの終了通知を暫定で無効化     */
/*********************************************************************/
/*  0021 : 2003/02/18                                                */
/*         os_tcpex.c       故障処理票KL0016に対応（暫定対処）       */
/*         osiioctl2.c      故障処理票KL0016に対応（暫定対処） 	     */
/*         oscrepr.c        シグナル障害対処                         */
/*********************************************************************/
/*  0022 : 2003/02/19                                                */
/*         故障処理表KL0015 KL0017 KL0018に対応                      */
/*********************************************************************/
/*  0023 : 2003/02/21                                                */
/*         ossnstm.c        故障処理票KL0019に対応                   */
/*         ossnstm.c        仕様変更に対応                           */
/*********************************************************************/
/*********************************************************************/
/*  0024 : 2003/02/27                                                */
/*         osiioctl2.c      SSLA0012の仕様変更に対応                 */
/*         osioctl2.c       SSLA0012の仕様変更に対応                 */
/*         osfrpbf.c        SSLA0013の仕様変更に対応                 */
/*         osrcvmsp.c       故障処理票KL0020に対応                   */
/*********************************************************************/
/*  0025 : 2003/02/28                                                */
/*         os_tcpex.c       故障処理票KL0023に対応                   */
/*         oacanrq.c        故障処理票KL0024に対応                   */
/*********************************************************************/
/*  0026 : 2003/03/07                                                */
/*         osstdtim.c       仕様変更SSLA0015に対応                   */
/*         os_tmctl.c       故障処理票KL0026に対応                   */
/*                          故障処理票KL0027に対応                   */
/*                          仕様変更SSLA0014に対応                   */
/*********************************************************************/
/*  0027 : 2003/03/10                                                */
/*         osioctl2.c       故障処理票KL0025に対応                   */
/*         osiioctl2.c      故障処理票KL0025に対応                   */
/*         os_tmctl.c       故障処理票KL0026に対応                   */
/*         os_initEPRC.c    故障処理票KL0028に対応                   */
/*********************************************************************/
/*  0028 : 2003/03/14                                                */
/*         osslpun.c        仕様変更SSLA0017に対応                   */
/*         os_gttrmcod.c    仕様変更SSLA0018に対応                   */
/*                          故障処理票KL0027に対応                   */
/*         os_initTrade.c   故障処理票SU0057に対応                   */
/*********************************************************************/
/*  0029 : 2003/03/20                                                */
/*         osfrpbf.c        仕様変更SSLA0016に対応                   */
/*         oswaitsp.c       故障処理票KL0035に対応                   */
/*         osiioctl2.c      故障処理票KL0029に対応                   */
/*         osiioctl2.c      故障処理票KL0036に対応                   */
/*********************************************************************/
/*  0030 : 2003/03/24                                                */
/*         os_tmctl.c       故障処理票KL0026に対応                   */
/*         os_sigact.c      故障処理票KL0033に対応                   */
/*         osiioctl2.c      故障処理票KL0031に対応                   */
/*         osiioctl2.c      故障処理票KL0040に対応                   */
/*********************************************************************/
/*  0031 : 2003/03/25                                                */
/*         ossenmsp.c       故障処理票KL0041に対応                   */
/*********************************************************************/
/*  0032 : 2003/04/06                                                */
/*         oswaitsp.c       故障処理票KL0043に対応                   */
/*         oswaitsp.c       故障処理票KL0044に対応                   */
/*         os_initProcess.c 故障処理票KL0046に対応                   */
/*         osiioctl2.c      仕様変更SSLA0019に対応                   */
/*         osireadd2.c      仕様変更SSLA0019に対応                   */
/*         osiwritd2.c      仕様変更SSLA0019に対応                   */
/*********************************************************************/
/*  0033 : 2003/04/14                                                */
/*         os_tcpex.c       故障処理票KL0051に対応                   */
/*********************************************************************/
/*  0034 : 2003/05/02                                                */
/*         osdtshm.c        仕様変更SSLA0025に対応                   */
/*         osireadd2.c      故障処理票KL0048に対応                   */
/*         osiwritd2.c      故障処理票KL0048に対応                   */
/*         os_tcpex.c       故障処理票TBCA0029に対応                 */
/*         ossnstm.c        故障処理票TBCS0065に対応                 */
/*         ossenms.c        故障処理票TBCS0067に対応                 */
/*********************************************************************/
/*  0035 : 2003/05/12                                                */
/*         oscanrq.c        故障処理票TBCS0078に対応				 */
/*********************************************************************/
/*  0036 : 2003/05/13                                                */
/*         osatshm.c        故障処理票TBCA0027に対応				 */
/*         osdtshm.c        故障処理票TBCA0027に対応				 */
/*         osgtshm.c        故障処理票TBCA0027に対応				 */
/*********************************************************************/
/*  0037 : 2003/05/16                                                */
/*         os_initProcess.c 故障処理票S00080に対応				 	 */
/*         ossenmsp.c       故障処理票TBCS0088に対応				 */
/*         ossnsms.c        故障処理票TBCS0088に対応				 */
/*********************************************************************/
/*  0038 : 2003/05/28                                                */
/*         osevent.c        故障処理票TBCS0098に対応				 */
/*********************************************************************/
/*  0039 : 2003/06/05                                                */
/*         os_gttrmcod.c    故障処理票TBCS0085に対応				 */
/*         os_gttrmcod.c    故障処理票TBCS0087に対応				 */
/*         oswrite1.c       故障処理票TBCS0123に対応				 */
/*         oswrite1_ins.h   故障処理票TBCS0123に対応				 */
/*********************************************************************/
/*  0039 : VR=2/0に変更　修正番号は変更しない           2003.06.09   */
/*********************************************************************/
/*  0040 : 2003/06/12                                                */
/*         osrcvms.c        故障処理票TBCS0118に対応				 */
/*         osrcvmsp.c       故障処理票TBCS0118に対応				 */
/*         osdelmb.c        故障処理票TBCS0118に対応				 */
/*         osdelmb.c        故障処理票TBCS0144に対応				 */
/*         os_SubMsgAtc2.c  故障処理票TBCS0118の対応のため新規に追加 */
/*         oscom_ins.h      故障処理票TBCS0118に対応				 */
/*         osrcvms_ins.h    故障処理票TBCS0118に対応				 */
/*         osrcvmsp_ins.h   故障処理票TBCS0118に対応				 */
/*         osdelmb_ins.h    故障処理票TBCS0118に対応				 */
/*         os_SubMsgAtc2_ins.h                                       */
/*                          故障処理票TBCS0118の対応のため新規に追加 */
/*         os_tcpex.c       故障処理票TBCS0126に対応				 */
/*********************************************************************/
/*  0041 : 2003/06/17                                                */
/*         osstdtim.c       仕様変更SSLA0031に対応					 */
/*         oscanrq.c        故障処理票TBCS0120に対応				 */
/*         os_MainMsgQ.c    故障処理票TBCS0143に対応				 */
/*         os_MsgRcv.c      故障処理票TBCS0143に対応				 */
/*         osrcvms.c        故障処理票TBCS0143に対応				 */
/*         osrcvmsp.c       故障処理票TBCS0143に対応				 */
/*         oswaitsp.c       故障処理票TBCS0143に対応				 */
/*         oscom_ins.h      故障処理票TBCS0143に対応				 */
/*********************************************************************/
/*  0042 : 2003/06/19                                                */
/*         osrcvms.c        故障処理票TBCS0154に対応				 */
/*         oswrite1.c       故障処理票TBCS0153に対応				 */
/*							故障処理票TBCS0155に対応				 */
/*********************************************************************/
/*  0043 : 2003/06/27                                                */
/*         osconn.c			仕様変更SSLA0034に対応				 	 */
/*********************************************************************/
/*  0044 : 2003/07/02                                                */
/*         oswrite1.c       故障処理票TBCS0172に対応                 */
/*         os_sigact.c      故障処理票TBCS0178に対応                 */
/*         os_getSG.c       故障処理票TBCS0201に対応                 */
/*         os_SetTimer.c    故障処理票TBCS0202に対応                 */
/*         os_timex.c       故障処理票TBCS0202に対応                 */
/*         os_tmcan.c       故障処理票TBCS0202に対応                 */
/*         os_tmctl.c       故障処理票TBCS0202に対応                 */
/*         os_sigact.c		仕様変更SSLA0032に対応				 	 */
/*         os_sigact_ins.h	仕様変更SSLA0032に対応				 	 */
/*         os_oscom_ins.h	仕様変更SSLA0032に対応				 	 */
/*         osdespr.c		仕様変更SSLA0033に対応				 	 */
/*         osgtpbf.c		仕様変更SSLA0035に対応				 	 */
/*         os_EBPC.h		仕様変更SSLA0035に対応				 	 */
/*********************************************************************/
/*  0045 : 2003/07/09                                                */
/*         ossenmsp.c       故障処理票TBCS0180に対応                 */
/*         os_tcpex.c       故障処理票TBCS0185に対応				 */
/*							故障処理票TBCS0194に対応				 */
/*							故障処理票TBCS0195に対応				 */
/*							故障処理票TBCS0206に対応				 */
/*		   osiioctl2.c		故障処理票TBCS0205に対応				 */
/*********************************************************************/
/*  0046 : 2003/07/18                                                */
/*         os_systim.c      仕様変更SSLA0042に対応                   */
/*         ossttim.c        仕様変更SSLA0042に対応                   */
/*         oswrite1.c       仕様変更SSLA0043に対応                   */
/*         oswrite1_ins.h   仕様変更SSLA0043に対応                   */
/*         ossnsfu.c        故障処理票TBCS0192に対応				 */
/*         os_tmcan.c       故障処理票TBCS0203に対応				 */
/*							故障処理票TBCS0235に対応				 */
/*         os_tmctl.c       故障処理票TBCS0203に対応				 */
/*							故障処理票TBCS0235に対応				 */
/*         osatshm.c        故障処理票TBCS0210に対応				 */
/*         osdtshm.c        故障処理票TBCS0210に対応				 */
/*         osgtshm.c        故障処理票TBCS0210に対応				 */
/*         os_tcpex.c       故障処理票TBCS0211に対応				 */
/*********************************************************************/
/*  0047 : 2003/07/24                                                */
/*         osdelmb.c        故障処理票TBCS0221に対応				 */
/*         oswaitsp.c       故障処理票TBCS0234に対応				 */
/*         ossigsp.c        故障処理票TBCS0234に対応				 */
/*         os_MsgQIng.c     故障処理票TBCS0234に対応				 */
/*********************************************************************/
/*  0048 : 2003/07/31                                                */
/*         oscrepr.c        故障処理票TBCS0231に対応				 */
/*							故障処理票TBCS0232に対応				 */
/*							故障処理票TBCS0233に対応				 */
/*         oscom_ins.h      故障処理票TBCS0231に対応				 */
/*         os_initEPRC.c    故障処理票TBCS0246に対応				 */
/*********************************************************************/
/*  0049 : 2003/08/07                                                */
/*		   osdelmb.c		故障処理票TBCS0261に対応				 */
/*         os_ChkPB.c       故障処理票TBCS0263に対応				 */
/*********************************************************************/
/*  0050 : 2003/08/07                                                */
/*         oscrepr.c        故障処理票TBCS0157に対応				 */
/*		   os_gttrmcod.c	故障処理票TBCS0157に対応				 */
/*********************************************************************/
/*  0051 : 2003/08/14                                                */
/*         oswrite1.c       故障処理票TBCS0267に対応                 */
/*                          故障処理票TBCS0276に対応                 */
/*         osclose.c        故障処理票TBCS0271に対応                 */
/*         osprgmd.c        故障処理票TBCS0272に対応                 */
/*         osioctl1.c       故障処理票TBCS0273に対応                 */
/*         os_endProcess.c  故障処理票TBCS0274に対応                 */
/*                          故障処理票TBCS0276に対応                 */
/*         os_initSG.c      故障処理票TBCS0275に対応                 */
/*         os_startSG.c     故障処理票TBCS0275に対応                 */
/*         osgtnrl.c        故障処理票TBCS0276に対応                 */
/*         os_MsgRcv.c      故障処理票TBCS0276に対応                 */
/*         oswaitev.c       故障処理票TBCS0276に対応                 */
/*         ossigsp.c        故障処理票TBCS0276に対応                 */
/*         osdelmb.c        故障処理票TBCS0276に対応                 */
/*         ossenms.c        故障処理票TBCS0276に対応                 */
/*         ossenmsp.c       故障処理票TBCS0276に対応                 */
/*         osrcvms.c        故障処理票TBCS0276に対応                 */
/*         osrcvmsp.c       故障処理票TBCS0276に対応                 */
/*         osdelbp.c        故障処理票TBCS0276に対応                 */
/*         osiread2.c       故障処理票TBCS0276に対応                 */
/*         osiwritd2.c      故障処理票TBCS0276に対応                 */
/*         os_dflact2.c     故障処理票TBCS0277に対応                 */
/*********************************************************************/
/*  0052 : 2003/08/15                                                */
/*         oscrepr.c        0050前に戻し							 */
/*		   os_gttrmcod.c	0050前に戻し							 */
/*********************************************************************/
/*  0052 : VR=2/1に変更　修正番号は変更しない           2003.08.18   */
/*********************************************************************/
}
