/************************************************************************************************/
/*	著作権	２００２																			*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_MBISearch												*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカ:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞	 															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 ＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ						*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<XXXXX.h>																	*/
/*																								*/
/*	   	void	XXXXXXX(XXXXXXX, XXXXXXXX)														*/
/*																								*/
/* ＜仮引数＞																					*/
/*		XXXXXX		XXXXX;		 		<XXXXXXXXXX>											*/
/*		XXXXXX		XXXXX;		 		<XXXXXXXXXX>											*/
/*																								*/
/* ＜返却値＞																					*/
/*	   0L																						*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/

/************************************************************************************************/
/*								共通ヘッダ・ファイル                							*/
/*																								*/
/************************************************************************************************/
#include <string.h>
#include <stdio.h>
#include <errno.h>

/************************************************************************************************/
/*								利用者作成ヘッダ・ファイル             							*/
/*																								*/
/************************************************************************************************/

#include "os_debug.h"
#include "osexpcode.h"
#include "oscom_ins.h"


/************************************************************************************************/
/*																								*/
/*	＜関数名＞ long os_MBISearch(TEmbcTableInd* ptr, long lStart, long lEnd, long lTarget)  	*/
/*                                	     			    										*/
/*																								*/
/*	＜機能概要＞ メイルボックス管理テーブルの検索                                               */
/*				** 種別が2の場合                                                                */
/* 				   - メイルボックス管理テーブルの個別部情報の先頭から、メイルボックス識別子		*/
/*					と変数とmpidが合致する個別部を検索する			  							*/
/*																								*/
/************************************************************************************************/
long os_MBISearch(TEmbcTableInd* ptr, long lStart, long lEnd, long lTarget)
{
	
	long lBinCnt;							// カウンタ
	
	if (lStart == lEnd)						// 最初の位置が最後の位置と一緒の場合
	{
		if (lTarget == (ptr + lStart)->lMBoxId) // 目標が存在する時
		{
			//DbgMsg01(DLv01, (OutPut, "###### (CCC) lStart==%d\n", lStart));
		
			return lStart;					// 目標が存在する位置を返却
		}
		else
		{
			return (-1);
		}
	}
	else
	{
		lBinCnt = (lStart + lEnd) / 2;		// 領域の長さは半分を分けます
				
		if (lTarget == (ptr + lBinCnt)->lMBoxId) // 目標が存在する時
		{
			//	DbgMsg01(DLv01, (OutPut, "###### (DDD) lBinCnt==%d\n", lBinCnt));
				
			return lBinCnt;				// 目標が存在する位置を返却	
		}
		else
		{
			if (lTarget > (ptr + lBinCnt)->lMBoxId)  // 目標がメイルボックスIDより大きい場合
			{
				return os_MBISearch(ptr, lBinCnt+1, lEnd, lTarget);  // 自分をも一回呼びます,
			}														 // 但し右へ
			else
			{
				return os_MBISearch(ptr, lStart, lBinCnt-1, lTarget); // 自分をも一回呼びます
			}														   // 但し左へ
		}
	}
	
}
