/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 メッセージ受信処理											*/
/* ＜モジュールＩＤ＞				 os_MsgRcv													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０６月１３日		故障管理番号（ＴＢＣＳ０１４３）*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０８月１１日     故障管理番号（ＴＢＣＳ０２７６）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	メッセージ受信処理																			*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_MsgRcv_ins.h>															*/
/*																								*/
/*		long		os_MsgRcv(long lMsgqID,														*/
/*							 TMsgHed *lMsgqPtr,													*/
/*							 long lMsgSize,														*/
/*							 long lMsgType,														*/
/*							 long lLimit)														*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long			lMsgqID;				メッセージキューＩＤ							*/
/*		TMsgHed			*lMsgqPtr;				メッセージ格納領域ポインタ						*/
/*		long			lMsgSize;				メッセージサイズ								*/
/*		long			lMsgType;				メッセージタイプ								*/
/*		long			lLimit;					制限時間										*/
/* ＜返却値＞																					*/
/*		正常終了		システムコール関数（msgrcv）の返却値を返す。							*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/

/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_MsgRcv_ins.h"


long	os_MsgRcv(lMsgqID, lMsgqPtr, lMsgSize, lMsgType, lLimit)
long	lMsgqID;									/* メッセージキューＩＤ						*/
TMsgHed	*lMsgqPtr;									/* メッセージ格納領域ポインタ				*/
long	lMsgSize;									/* メッセージサイズ							*/
long	lMsgType;									/* メッセージタイプ							*/
long	lLimit;										/* 制限時間									*/
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	long	lRet;									/* 返却値									*/

	os_trcget2( D_MD_OS_MSGRCV, D_T_TRA_IN, 5, lMsgqID, lMsgqPtr, lMsgSize, lMsgType, lLimit );
													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** %s:Start DbgSubFnc\n", "os_MsgRcv" ) );


	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	lRet  = 0;										/* 返却値									*/
	errno = 0;										/* errno クリア								*/


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	DbgMsg01(DLv04, (OutPut, "***** %s:lMsgqID  = %d \n", "os_MsgRcv", lMsgqID));
	DbgMsg01(DLv04, (OutPut, "***** %s:lMsgqPtr = %08x \n", "os_MsgRcv", lMsgqPtr));
	DbgMsg01(DLv04, (OutPut, "***** %s:lMsgSize = %d \n", "os_MsgRcv", lMsgSize));
	DbgMsg01(DLv04, (OutPut, "***** %s:lMsgType = %02x \n", "os_MsgRcv", lMsgType));
	DbgMsg01(DLv04, (OutPut, "***** %s:lLimit   = %d \n", "os_MsgRcv", lLimit));


	/****************************************/
	/*  制限時間のチェック					*/
	/****************************************/
	if (0 == lLimit)								/* 制限時間が０の場合						*/
	{
		os_trcget2( D_MD_OS_MSGRCV, D_T_SYS_MSGRCV, 5,
					lMsgqID, lMsgqPtr, lMsgSize, lMsgType, IPC_NOWAIT );
													/* メッセージ受信							*/
		lRet = msgrcv(lMsgqID, lMsgqPtr, lMsgSize, lMsgType, IPC_NOWAIT);
		
		os_trcget2( D_MD_OS_MSGRCV, D_T_SYS_END, 2, lRet, errno );
//		printf("errno = %d\n", errno);
	}
	else if (0 < lLimit)							/* 制限時間が０以上の場合					*/
	{
/*****	故障管理番号TBCS0143の対応		Start							修正日：2003.06.13	*****/
/************************************************************************************************/
/*	システムコールタイマー発行処理の移動により削除												*/
/*	（os_MsgRcv → os_MainMsgQ）																*/
/************************************************************************************************/
/*****	故障管理番号TBCS0143の対応 		 End							修正日：2003.06.13	*****/
		os_trcget2( D_MD_OS_MSGRCV, D_T_SYS_MSGRCV, 5,
					lMsgqID, lMsgqPtr, lMsgSize, lMsgType, MSG_NOERROR);
													/* メッセージ受信							*/
		lRet = msgrcv(lMsgqID, lMsgqPtr, lMsgSize, lMsgType, MSG_NOERROR);
		
		os_trcget2( D_MD_OS_MSGRCV, D_T_SYS_END, 2, lRet, errno );
//		printf("errno = %d\n", errno);
	}
	else										/* 上記以外の場合							*/
	{
		os_trcget2( D_MD_OS_MSGRCV, D_T_SYS_MSGRCV, 5,
					lMsgqID, lMsgqPtr, lMsgSize, lMsgType, MSG_NOERROR);
													/* メッセージ受信							*/
		lRet = msgrcv(lMsgqID, lMsgqPtr, lMsgSize, lMsgType, MSG_NOERROR);
		
		os_trcget2( D_MD_OS_MSGRCV, D_T_SYS_END, 2, lRet, errno );
//		printf("errno = %d\n", errno);
	}


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "***** %s: End  DbgSubFnc\n", "os_MsgRcv" ) );
	os_trcget2( D_MD_OS_MSGRCV, D_T_TRA_OUT, 1, lRet );
	
	return (lRet);									/* 正常終了									*/
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
