/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_MyEPRC													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		ファイルの生成																			*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	"os_MyEPRC.h"																*/
/*																								*/
/*		long os_MyEPRC(void)																	*/
/*																								*/
/* ＜仮引数＞																					*/
/*		なし																					*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常戻り値	NORMAL																		*/
/*		異常戻り値	未決定																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	os_initProcess関数内でのみ使用可能とする。													*/
/*	プロセス管理テーブル内に当該関数プロセスに対応した個別部情報が存在すること。				*/
/*	TRADEシステムコール(oscresp)によってプロセス生成されたもののみ対象とする					*/
/*																								*/
/*																								*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/*																								*/
/*	＜機能概要＞  																				*/
/*	当該プロセス内で使用するプロセス管理テーブルの個別部情報の位置を検索してシステムテーブル	*/
/*	管理テーブル内の自プロセス情報に設定する。													*/
/*	この処理の実施以降では当該プロセスに対応したプロセス管理テーブルの個別部情報を検索するこ	*/
/*	となく利用可能になる。																		*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/sem.h>
/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include "os_initEXXX.h"
#include "os_initEXXX_ins.h"

long os_MyEPRC(void)
{
/****************************************/
/*	変数定義							*/
/****************************************/
	TEprcTable *ptEprcTbl = NULL;
	TEprcTableInd *ptEprcTblInd = NULL;
	
	long lCnt;
	long lTargetId;
	long lTempId;
	long lLimit;

/****************************************/
/*	初期処理							*/
/****************************************/
	DbgMsg01( DLv02, ( OutPut, "***** Start os_MyEPRC \n") );
	
	ptEprcTbl = ptEsys->tMstEPRC.pvAdr;			/*	プロセス管理情報を割り当て	*/
//	DbgMsg01( DLv04, ( OutPut, "***** ptEprcTbl:%x\n", ptEprcTbl) );
	
	ptEprcTblInd = (TEprcTableInd *)(ptEprcTbl + 1);	/*	EPRC個別部情報を割り当て	*/
//	DbgMsg01( DLv04, ( OutPut, "***** ptEprcTblInd :%x\n", ptEprcTblInd) );

/****************************************/
/*	本処理								*/
/****************************************/
//	DbgMsg01( DLv04, ( OutPut, "***** MyEPRC本処理\n"));
	lLimit = ptEprcTbl->lIndPartNum;			/*	個別部数取得	*/
//	DbgMsg01( DLv04, ( OutPut, "***** lLimit:%d\n", lLimit));
	
	lTargetId = ptEsys->tMyPrcInfo.lMyPid;		/*	検索対象ID(自プロセスID)取得	*/
//	DbgMsg01( DLv04, ( OutPut, "***** lTargetId:%d\n", lTargetId));
	
	
	ptEsys->tMyPrcInfo.ptMyEPRC = NULL;
	
	for(lCnt = 0;lCnt < lLimit;lCnt++)
	{
		lTempId = (ptEprcTblInd + lCnt)->lPid;	/*	個別部プロセスID取得	*/
//		DbgMsg01( DLv04, ( OutPut, "***** ptEprcTblInd[%d].lPid:%d\n", lCnt, lTempId) );
		
		if(lTargetId == lTempId)				/*	該当プロセスIDならば	*/
		{
//			DbgMsg01( DLv04, ( OutPut, "***** 該当プロセスID発見\n"));
			(TEprcTableInd *)(ptEsys->tMyPrcInfo.ptMyEPRC) = (ptEprcTblInd + lCnt);	/*	該当個別部アドレスを格納*/
//			DbgMsg01( DLv04, ( OutPut, "***** ptMyEPRC :%x\n", ptEsys->tMyPrcInfo.ptMyEPRC) );
			lCnt = lLimit;						/*	ループを終わらせる	*/
		}
	}
	
	if(NULL == ptEsys->tMyPrcInfo.ptMyEPRC)		/*	該当するIDが見つからなかったら	*/
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s 01:Err 該当するプロセスID無し\n", "os_MyEPRC") );
		return( OSERRMYEPRC );					/* 	自プロセス管理情報異常　*/
	}
	
	ptEprcTblInd = (TEprcTableInd *)(ptEsys->tMyPrcInfo.ptMyEPRC);
	
	ptEprcTblInd->cLaunchFlg = 'S';
//	DbgMsg01( DLv04, ( OutPut, "***** 自プロセス立ち上げ状態 :%c\n", ptEprcTblInd->cLaunchFlg));

/****************************************/
/*	終了処理							*/
/****************************************/
	DbgMsg01( DLv02, ( OutPut, "***** End os_MyEPRC \n") );
	return (NORMAL);
}

