/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＸＸＸＸＸＸＸ												*/
/* ＜モジュールＩＤ＞				 os_MyEMBC													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		ファイルの生成																			*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	"os_MyEMBC.h"																*/
/*																								*/
/*      long os_MyEMBC(long lMBoxId)                                                            */
/*																								*/
/* ＜仮引数＞																					*/
/*		long lMBoxId	自メールボックス識別子													*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常戻り値	NORMAL																		*/
/*		異常戻り値	未決定																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	os_initProcess関数内でのみ使用可能とする。													*/
/*	当該関数発行前にos_MyEPRC関数を発行すること。(自プロセス管理情報の初期化が完了していること)	*/
/*																								*/
/*																								*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/*																								*/
/*	＜機能概要＞  																				*/
/*	当該プロセス内で使用するプロセス管理テーブルの個別部情報の位置を検索してシステムテーブル	*/
/*	管理テーブル内の自プロセス情報に設定する。													*/
/*	この処理の実施以降では当該プロセスに対応したプロセス管理テーブルの個別部情報を検索するこ	*/
/*	となく利用可能になる。																		*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/sem.h>
/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include "os_initEXXX.h"
#include "os_initEXXX_ins.h"

long os_MyEMBC(long lMBoxId)
{
/****************************************/
/*	変数定義							*/
/****************************************/
	TEprcTableInd *ptEprcTblInd = NULL;			// EPRC個別部ポインタ
	TEmbcTable *ptEmbcTbl = NULL;				// EMBC管理部ポインタ
	TEmbcTableInd *ptEmbcTblInd = NULL;			// EMBC個別部ポインタ
	
	TEmbcTableInd *ptTempEmbcInd = NULL;		// EMBC個別部ポインタ作業用

	long lCnt;
	long lTargetId;
	long lTempId;
	long lLimit;

/****************************************/
/*	初期処理							*/
/****************************************/
	DbgMsg01( DLv02, ( OutPut, "***** Start os_MyEMBC \n") );
	//引数チェック
	if( 0 == lMBoxId)							// 自プロセスメイルボックス識別子異常
	{
		DbgMsg01( DLv05, ( OutPut, "***** Err 01:os_MyEMBC\n"));
		return( OSERRARG );						//引数異常を返却
	}
	
	ptEprcTblInd = (TEprcTableInd *)(ptEsys->tMyPrcInfo.ptMyEPRC);			// EPRC個別部情報を割り当て
//	DbgMsg01( DLv04, ( OutPut, "***** ptEprcTblInd:%x\n", ptEprcTblInd) );
	
	ptEmbcTbl = ptEsys->tMstEMBC.pvAdr;					//　EMBC管理部割当て
//	DbgMsg01( DLv04, ( OutPut, "***** ptEmbcTbl:%x\n", ptEmbcTbl) );
	
	ptEmbcTblInd = (TEmbcTableInd *)(ptEmbcTbl + 1);	//　EMBC個別部割当て
//	DbgMsg01( DLv04, ( OutPut, "***** ptEmbcTblInd:%x\n", ptEmbcTblInd) );

/****************************************/
/*	本処理								*/
/****************************************/
	//　自メールボックス管理テーブルの検索
	lTargetId = lMBoxId;						// 自メールボックス識別子格納
//	DbgMsg01( DLv04, ( OutPut, "***** lTargetId:%x\n", lTargetId));
	
	lLimit = ptEmbcTbl->lIndPartNum;			// EMBC最大個別部数格納
//	DbgMsg01( DLv04, ( OutPut, "***** lLimit:%x\n", lLimit));

	for(lCnt = 0;lCnt < lLimit;lCnt++)			// 自メールボックス識別子と合致する
	{											// メールボックス識別子を検索する
		ptTempEmbcInd = (ptEmbcTblInd + lCnt);
//		DbgMsg01( DLv04, ( OutPut, "***** ptEmbcTblInd[%d]:%x", lCnt, ptTempEmbcInd));
		
		lTempId = ptTempEmbcInd->lMBoxId;
//		DbgMsg01( DLv04, ( OutPut, "->lMBoxId:%x\n", lTempId));
		
		if(lTargetId == lTempId)				// 合致する識別子を見つけたら
		{
//			DbgMsg01( DLv04, ( OutPut, "***** 該当メールボックス識別子発見\n"));
			
			ptTempEmbcInd->lPCode = ptEprcTblInd->lPCode;	// プロセス識別子を格納
//			DbgMsg01( DLv04, ( OutPut, "***** ptTempEmbcInd->lPCode:%x\n",ptTempEmbcInd->lPCode));
			
			//strcpy((ptTempEmbcInd->acPName), (ptEprcTblInd->acPName));   // 20021218修正
			strncpy((ptTempEmbcInd->acPName), (ptEprcTblInd->acPName), 16);
//			DbgMsg01( DLv04, ( OutPut, "***** ptTempEmbcInd->acPName:%s\n",ptTempEmbcInd->acPName));
			
			(TEmbcTableInd *)(ptEsys->tMyPrcInfo.ptMyEMBC) = ptTempEmbcInd;	// 自メールボックス管理情報に格納
//			DbgMsg01( DLv04, ( OutPut, "***** ptEsys->tMyPrcInfo.ptMyEMBC :%x\n", ptTempEmbcInd));
			
			lCnt = lLimit;						// ループを終わらせ
		}
	}
	
	if(NULL == ptEsys->tMyPrcInfo.ptMyEMBC)		// 該当するメールボックス識別子が無かった時
	{
		DbgMsg01( DLv05, ( OutPut, "***** Err 02:os_MyEMBC\n"));
		return(OSERRMYEMBC);
	}
/****************************************/
/*	終了処理							*/
/****************************************/
	DbgMsg01( DLv02, ( OutPut, "***** End os_MyEMBC \n") );
	return (NORMAL);
}

