/************************************************************************************************/
/*	著作権	２００２																			*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共通関数													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 サブメッセージのアタッチ									*/
/* ＜モジュールＩＤ＞				 os_SubMsgAtc2												*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ新保)				*/
/* ＜設計修正年月日及び修正ＩＤ＞	 ２００３年０６月０９日     故障管理番号（ＴＢＣＳ０１１８）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ新保)				*/
/* ＜ソース作成年月日＞ 			 ２００３年０６月０９日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		メイルボックス管理テーブルのサブメッセージを検索し、該当するサブメッセージがある場合、	*/
/*		サブメッセージに対して共有メモリのアタッチ処理を行う。									*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_SubMsgAtc2_ins.h>														*/
/*																								*/
/*		long os_SubMsgAtc2( TEmbcTableInd *ptEmbcInd )											*/
/*																								*/
/* ＜仮引数＞																					*/
/*		TEmbcTableInd	*ptEmbcInd 																*/
/*																								*/
/* ＜返却値＞																					*/
/*		NORMAL	: 正常終了																		*/
/*		-1		: 異常終了																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <errno.h>									/* errno用ヘッダファイル					*/
#include <string.h>
#include <sys/shm.h>

/*****************************  利用者作成ヘッダ・ファイル  *************************************/
#include "os_SubMsgAtc2_ins.h"

/************************************************************************************************/
/*                                                                                              */
/*  ＜関数名＞                                                                                  */
/*      os_SubMsgAtc2                                                                           */
/*                                                                                              */
/*  ＜機能概要＞                                                                                */
/*      メイルボックス管理テーブルのサブメッセージを検索し、該当するサブメッセージがある場合、  */
/*      サブメッセージに対して共有メモリのアタッチ処理を行う。                                  */
/*                                                                                              */
/*  パラメータ                                                                                  */
/*      TEmbcTableInd	*ptEmbcInd                                                              */
/*                                                                                              */
/*  返却値                                                                                      */
/*      NORMAL  : 正常終了                                                                      */
/*      -1      : 異常終了                                                                      */
/*                                                                                              */
/************************************************************************************************/
long os_SubMsgAtc2( TEmbcTableInd *ptEmbcInd )
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	char 		*pcCmptr  = NULL;					/* アタッチする仮想アドレスポインタ 		*/
	TMsgInfo	*ptMsgNxt = NULL;					/* 次メッセージ情報ポインタ					*/

	/********************************************************************************************/
	/*  本処理                                                                                  */
	/********************************************************************************************/
	os_trcget2(D_MD_OS_SUBMSGATC2, D_T_TRA_IN, 0);
	DbgMsg01(DLv04, (OutPut, "\n***** %s: os_SubMsgAtc2() Start \n", "os_SubMsgAtc2"));

	/************************************/
	/*  サブメッセージ検索				*/
	/************************************/
	while(1)
	{
													/* 受信メッセージのアドレスチェック			*/
		if (NULL == ptEmbcInd->tSubMsgQ.ptNxtAdr)	/* サブメッセージキューの次アドレスがNULL	*/
		{
			DbgMsg01(DLv04, (OutPut, "\n***** %s:ptEmbcInd->tSubMsgQ.ptNxtAdr=%08x\n",
							"os_SubMsgAtc2", ptEmbcInd->tSubMsgQ.ptNxtAdr));
			break;									/* ループを抜ける							*/
		}

		if (NULL == ptMsgNxt)						/* 次メッセージ情報ポインタがNULLの場合		*/
		{
			/****************************************/
			/*  共有メモリのアタッチ				*/
			/****************************************/
													/* 共有メモリのアタッチ						*/
			os_trcget2( D_MD_OS_SUBMSGATC2, D_T_SYS_SHMAT, 3, ptEmbcInd->tSubMsgQ.lShmId, 0, 0);
			pcCmptr = (char *)shmat(ptEmbcInd->tSubMsgQ.lShmId,ptEmbcInd->tSubMsgQ.ptNxtAdr,SHM_RND);
			os_trcget2( D_MD_OS_SUBMSGATC2, D_T_SYS_END, 2, pcCmptr, errno);

			if (D_ERR_SYS == pcCmptr)				/* 異常終了の場合							*/
			{
				DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
							"os_SubMsgAtc2", "shmat() Call Error!!", errno, strerror(errno)));
				return(-1);							/* 異常終了									*/
			}

													/* サブメッセージキューの次アドレスを設定	*/
			ptMsgNxt = ptEmbcInd->tSubMsgQ.ptNxtAdr;
			DbgMsg01(DLv04, (OutPut, "***** %s:ptMsgNxt = %08x \n", "os_SubMsgAtc2", ptMsgNxt));
		}
		else
		{
			if (NULL == ptMsgNxt->ptNxtAdr)			/* 次メッセージ情報の次アドレスがNULLの場合 */
			{
				DbgMsg01(DLv04, (OutPut, "***** %s:ptMsgNxt->ptNxtAdr = %08x \n", 
							"os_SubMsgAtc2", ptMsgNxt->ptNxtAdr));
				break;								/* ループを抜ける							*/
			}

			DbgMsg01(DLv04, (OutPut, "\n***** %s:ptMsgNxt=%08x\n", "os_SubMsgAtc2", ptMsgNxt));
			DbgMsg01(DLv04, (OutPut, "\n***** %s:ptMsgNxt->lShmId=%08x\n",
							"os_SubMsgAtc2", ptMsgNxt->lShmId));

			/****************************************/
			/*  共有メモリのアタッチ				*/
			/****************************************/
													/* 共有メモリのアタッチ						*/
			os_trcget2( D_MD_OS_SUBMSGATC2, D_T_SYS_SHMAT, 3, ptMsgNxt->lShmId, 0, 0);
			pcCmptr = (char *)shmat(ptMsgNxt->lShmId, ptMsgNxt->ptNxtAdr, SHM_RND);
			os_trcget2( D_MD_OS_SUBMSGATC2, D_T_SYS_END, 2, pcCmptr, errno);

			if (D_ERR_SYS == pcCmptr)				/* 異常終了の場合							*/
			{
				DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
							"os_SubMsgAtc2", "shmat() Call Error!!", errno, strerror(errno)));
				return(-1);							/* 異常終了									*/
			}

													/* 次メッセージ情報の次アドレスを設定		*/
			ptMsgNxt = (TMsgInfo *)ptMsgNxt->ptNxtAdr;
			DbgMsg01(DLv04, (OutPut, "***** %s:ptMsgNxt = %08x \n", "os_SubMsgAtc2", ptMsgNxt));
		}
	}

	/********************************************************************************************/
	/*  終了処理                                                                                */
	/********************************************************************************************/
	os_trcget2(D_MD_OS_SUBMSGATC2, D_T_TRA_OUT, 1, NORMAL);
	DbgMsg01(DLv04, (OutPut, "\n***** %s: os_SubMsgAtc2()  End  \n", "os_SubMsgAtc2"));
	return(NORMAL);									/* 正常終了									*/
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/

