/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 リザルト・例外												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 共通シグナルハンドラ										*/
/* ＜モジュールＩＤ＞				 os_sigact													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月０２日		故障管理番号（ＴＢＣＳ０１７８）*/
/*																仕様変更番号（ＳＳＬＡ００３２）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*      シグナルハンドラの再設定を行い、終了処理をする。                                        */
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_sigact_ins.h>															*/
/*																								*/
/*      void    os_sigact()                                                                     */
/*																								*/
/* ＜仮引数＞																					*/
/*      int     signum                                                                          */
/*																								*/
/* ＜返却値＞																					*/
/*      なし                                                                                    */
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*      ＴＲＡＤＥエミュレート内のみ利用可能とする。                                            */
/*      本処理はＴＲＡＤＥプロセス初期化処理にて各シグナルにシグナルハンドラとして登録される。  */
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/************************************************************************************************/
/*  インクルードファイル                                                                        */
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/


/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"os_sigact_ins.h"

void os_Zantei(void);

void	os_sigact(signum)
int		signum;										/* シグナル番号								*/
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	char	acPara1[128];							/* exec起動パラメータ1						*/
	char	acPara2[128];							/* exec起動パラメータ2						*/
	/*****	暫定対処				Start								修正日：2003.04.07	*****/
	/********************************************************************************************/
	/*	gcoreの起動方法をfork->execlp → systemに変更											*/
	/********************************************************************************************/
	char	acCmdLine[256];							/* sytem起動パラメータ						*/
	/*****	暫定対処				 End								修正日：2003.04.07	*****/
/*****	仕様変更番号SSLA0032の対応		Start							修正日：2003.07.02	*****/
	char	acGcorePath[128];						/* gcoreパス名格納域（SG用）				*/
/*****	仕様変更番号SSLA0032の対応	 	 End							修正日：2003.07.02	*****/
	char	cSerious;								/* 重大度									*/
	long	lRet;									/* 返却値									*/
	long	lPid;									/* プロセスＩＤ								*/
	long	lExClass;								/* 例外種別									*/
	long	lExCode;								/* 例外コード								*/
	long	lEndCode;								/* 終了コード								*/
	long	lDetail;								/* 詳細情報									*/
	long	lCoreFlg;								/* core取得フラグ							*/
	long	lCnt = 0;
	struct sigaction	tOldSig;
	struct sigaction	tAct;						/* シグナル用								*/
	struct	timeval		tTmVal;						/* 時間取得用構造体							*/
	struct	tm			*ptTm;						/* 日付時刻変換用構造体						*/
	TAbortInfo			tAbtInfo;					/* アボート情報構造体						*/


	os_trcget2( D_MD_OS_SIGACT, D_T_TRA_IN, 1, signum );

													/* 関数入口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** %s:Start DbgSubFnc\n", "os_sigact" ) );

//	DbgMsg01(DLv04, (OutPut, "***** %s:signum = %d \n", "os_sigact", signum));


	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	cSerious = 0;									/* 重大度 クリア							*/
	lPid = 0;										/* プロセスＩＤ クリア						*/
	lExClass = 0;									/* 例外種別 クリア							*/
	lExCode  = 0;									/* 例外コード クリア						*/
	lEndCode = 0;									/* 終了コード クリア						*/
	lDetail = 0;									/* 詳細情報 クリア							*/
	lCoreFlg = 0;									/* core取得フラグ クリア					*/
	errno = 0;										/* errno クリア								*/

	memset(acPara1, 0, sizeof(acPara1));			/* exec起動パラメータ1 クリア				*/
	
	memset(acPara2, 0, sizeof(acPara2));			/* exec起動パラメータ2 クリア				*/

													/* アボート情報タイトル クリア				*/
	memset(tAbtInfo.acTitle, 0, sizeof(tAbtInfo.acTitle));
													/* アボート情報サブタイトル クリア          */
	memset(tAbtInfo.acSubTitle, 0, sizeof(tAbtInfo.acSubTitle));

/*****	仕様変更番号SSLA0032の対応		Start							修正日：2003.07.02	*****/
	memset(acGcorePath, 0, sizeof(acGcorePath));	/* gcoreパス名格納域 クリア					*/
/*****	仕様変更番号SSLA0032の対応		 End							修正日：2003.07.02	*****/


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
/*****	故障管理番号TBCS0178の対応		Start							修正日：2003.07.02	*****/
	/****************************************/
	/*  シグナルハンドラの再設定			*/
	/****************************************/
	for(lCnt = 1; lCnt < 32; lCnt++)
	{
		switch(lCnt)
		{
			case	SIGILL	:						/* 不正な命令								*/
			case	SIGBUS	:						/* バスエラー								*/
			case	SIGFPE	:						/* 浮動小数点例外							*/
			case	SIGSEGV	:						/* 不正なメモリ								*/
			case	SIGTERM	:						/* 終了シグナル								*/
			case	16		:						/* 空き（Stack falut）						*/
				tAct.sa_handler = os_dflact2;		/* シグナルハンドラの設定					*/
				break;

			default			:						/* その他									*/
				tAct.sa_handler = SIG_IGN;			/* シグナルハンドラの設定                   */
				break;
		}
		tAct.sa_flags = 0;							/* シグナルフラグの設定						*/
		sigaction(lCnt, &tAct, NULL);				/* シグナルの操作                           */
	}

	/****************************************/
	/*  変換用の例外種別、例外コードの設定	*/
	/****************************************/
	switch (signum)									/* シグナル番号で振り分け					*/
	{
		case	SIGILL  :							/* 不正な命令								*/
			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
			lExClass = OSEXIILL;					/* 例外種別を設定							*/
			lExCode  = OSEXILLI;					/* 例外コードを設定							*/
			break;

		case	SIGBUS  :							/* バスエラー								*/
			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
			lExClass = OSEXIBUS;					/* 例外種別を設定							*/
			lExCode  = OSEXMMBEB;					/* 例外コードを設定							*/
			break;

		case	SIGFPE  :							/* 浮動小数点例外							*/
			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
			lExClass = OSEXIFPE;					/* 例外種別を設定							*/
			lExCode  = OSEXOPERR;					/* 例外コードを設定							*/
			break;

		case	SIGSEGV :							/* 不正なメモリ								*/
			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
			lExClass = OSEXIADR;					/* 例外種別を設定							*/
			lExCode  = OSEXADERR;					/* 例外コードを設定							*/
			break;

//		case	SIGPIPE :							/* パイプ破壊：読み手の無いパイプへの書出し */
//			tAct.sa_handler = os_dflact2;			/* シグナルハンドラの設定					*/
//			tAct.sa_flags = 0;						/* シグナルフラグの設定						*/
//			sigaction(signum, &tAct, NULL);			/* シグナルの操作							*/

			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
//			lExClass = OSEXIILL;					/* 例外種別を設定							*/
//			lExCode  = OSEXILLI;					/* 例外コードを設定							*/
//			break;

		case	SIGTERM :							/* 終了シグナル								*/
			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
			lExClass = OSEXITRM;					/* 例外種別を設定							*/
			lExCode  = ptMyEPRC->lEndCode;			/* 例外コードを設定							*/

			DbgMsg01(DLv04, (OutPut, "***** %s:ptMyEPRC->lEndCode = %08lx \n", "os_sigact",
					ptMyEPRC->lEndCode));
			break;

		case	16      :							/* 空き（Stack falut）						*/
			/****************************************/
			/*  受信シグナルの例外種別、例外コード  */
			/*  へのコード変換						*/
			/****************************************/
			lExClass = OSEXISTK;					/* 例外種別を設定							*/
			lExCode  = OSEXSTACK;					/* 例外コードを設定							*/
			break;

		default			:							/* その他									*/
			break;
	}
/*****	故障管理番号TBCS0178の対応		 End							修正日：2003.07.02	*****/


	DbgMsg01(DLv04, (OutPut, "***** %s:lExClass = %08lx \n", "os_sigact", lExClass));
	DbgMsg01(DLv04, (OutPut, "***** %s:lExCode  = %08lx \n", "os_sigact", lExCode));


	/****************************************/
	/*  coreファイルの取得					*/
	/*  （gcoreコマンドの実行）				*/
	/****************************************/
	/****************************************/
	/*  終了コードの作成					*/
	/****************************************/
	if (SIGTERM == signum)							/* シグナル番号が「SIGTERMの場合」			*/
	{
		lEndCode = ptMyEPRC->lEndCode;				/* 自プロセス管理テーブルの終了コードを設定 */
		lDetail = ptMyEPRC->lDetailCode;			/* 自プロセス管理テーブルの詳細情報を設定	*/

		//cSerious = ((lEndCode >> 16) & 0x000000ff); /* 重大度取得								*/
		cSerious = ((lEndCode >> 16) & 0x0000000f);	// 20030305 修正
		DbgMsg01( DLv04, ( OutPut, "***** %s:cSerious = %02d \n", "os_sigact", cSerious) );
	}
	else											/* シグナル番号が「SIGTERM以外の場合」		*/
	{
													/* 終了コードを設定							*/
													/* （シグナル番号でマスク）					*/
		lEndCode = D_END_CODE1 & (0xffffff00 | signum);
		lDetail = D_DETAIL_NON;						/* 詳細情報を設定（未使用）					*/
	}

	/****************************************/
	/*  gcoreの取得判定						*/
	/****************************************/
													/* SIGTERMかつ重大度が「0」又は「2」の場合	*/
	if ((SIGTERM == signum) && ((0 == cSerious) || (2 == cSerious)))
	{
		lCoreFlg = 1;								/* core取得フラグに「core取得(1)」を設定	*/
	}
	else											/* gcoreを取得する							*/
	{
		/****************************************/
		/*  アボート情報の記録					*/
		/****************************************/
		os_trcget2( D_MD_OS_SIGACT, D_T_SYS_GETTIMEOFDAY, 2, &tTmVal, NULL );
		
		gettimeofday(&tTmVal, NULL);				/* 時間を取得								*/
		
		os_trcget2( D_MD_OS_SIGACT, D_T_SYS_END, 0);


		os_trcget2( D_MD_OS_SIGACT, D_T_SYS_LOCALTIME, 1, &tTmVal.tv_sec );
		ptTm = localtime(&tTmVal.tv_sec);			/* バイナリデータと時刻を					*/
													/* 要素別の時刻や ASCII に変換する			*/
		os_trcget2( D_MD_OS_SIGACT, D_T_SYS_END, 0);

													/* アボート情報タイトル設定					*/
		sprintf(tAbtInfo.acTitle, "%c%c%c%c %s \n", '@', '(', '#', ')', D_ABORTINFO_TITLE);

													/* アボート情報サブタイトル設定				*/
		sprintf(tAbtInfo.acSubTitle,
				"%c%c%c%c     %s  %02d-%02d-%02d %02d:%02d:%02d  %s  %08lx-%08lx",
				'@', '(', '#', ')', "DATE",
				(ptTm->tm_year-100), (ptTm->tm_mon+1), ptTm->tm_mday,
				ptTm->tm_hour, ptTm->tm_min, ptTm->tm_sec, "TERMCODE", lEndCode, lDetail);

		/*****	暫定対処				Start							修正日：2003.04.07	*****/
		/****************************************************************************************/
		/*	gcoreの起動方法をfork->execlp → systemに変更										*/
		/****************************************************************************************/
													/* 自プロセス名を設定						*/
		for(lCnt = 0; (lCnt < sizeof(ptMyEPRC->acPName)) &&
					( (' ' != (ptMyEPRC->acPName)[lCnt]) &&
					  ('\0' != (ptMyEPRC->acPName)[lCnt]) ); lCnt++ )
		{
		}

		strncpy(acPara1, ptMyEPRC->acPName, lCnt);
		sprintf(acPara1 + lCnt, "%s", "_core");
		sprintf(acPara2, "%ld", lMyPid);			/* 自プロセスＩＤを設定						*/

/*****	仕様変更番号SSLA0032の対応		Start							修正日：2003.07.02	*****/
													/* ＳＧからデータを取得する                 */
		lRet = os_getSG(D_SG_GCORE_PATH, acGcorePath);
		if (-2 == lRet)                             /* 返却値が「-2」の場合						*/
		{
			os_trcget2( D_MD_OS_SIGACT, D_T_ERR_SYS, 1, lRet );
			sprintf(acGcorePath, "/usr/bin/gcore");	/* gcoreパス名格納域にデフォルトを設定		*/
		}

													/* sytem起動パラメータ設定					*/
		sprintf(acCmdLine, "%s -f -o %s %s", acGcorePath, acPara1, acPara2);
/*****	仕様変更番号SSLA0032の対応		 End							修正日：2003.07.02	*****/

		lRet = system(acCmdLine);					/* gcoreコマンド実行						*/
		DbgMsg01(DLv04, (OutPut, "***** %s:system lRet = %ld \n", "os_sigact", lRet));

		if (D_ERR_SYS == lRet)						/* 返却値が異常の場合						*/
		{
			DbgMsg01(DLv04, (OutPut, "***** %s:system lRet = %ld \n", "os_sigact", lRet));
			DbgMsg01(DLv05, (OutPut, "***** %s:%s  ERRNO:%08x  %s \n",
					"os_sigact", "system() Call Error!!", errno, strerror(errno)));

			lCoreFlg = 1;							/* core取得フラグに「core取得(1)」を設定	*/
		}
		/*****	暫定対処				 End							修正日：2003.04.07	*****/
	}

	/****************************************/
	/*  シグナル値に対応した登録ルーチン	*/
	/*  の起動								*/
	/****************************************/
													/* 自プロセス管理テーブル個別部に			*/
													/* 例外ハンドラが登録されている場合			*/
	if (D_ADR_INI != (long)ptMyEPRC->func[signum -1])
	{
													/* 例外ハンドラを起動						*/
		lRet = ptMyEPRC->func[signum -1](lExClass, lExCode);
		lEndCode = lRet;							/* 終了コード設定							*/
		ptMyEPRC->lEndCode = lEndCode;				/* 自プロセス管理テーブルの終了コードを更新 */
		lDetail = ptMyEPRC->lDetailCode;			/* 自プロセス管理テーブルの詳細情報を設定	*/
	}
	else
	{
		/****************************************/
		/*  終了コードの作成					*/
		/****************************************/
		if (SIGTERM == signum)						/* シグナル番号が「SIGTERMの場合」			*/
		{
			lEndCode = ptMyEPRC->lEndCode;			/* 終了コードを設定							*/
			lDetail = ptMyEPRC->lDetailCode;		/* 自プロセス管理テーブルの詳細情報を設定	*/
		}
		else										/* シグナル番号が「SIGTERM以外の場合」		*/
		{
													/* 終了コードを設定							*/
													/* （シグナル番号でマスク）					*/
			lEndCode = D_END_CODE1 & (0xffffff00 | signum);
			ptMyEPRC->lEndCode = lEndCode;			/* 自プロセス管理テーブルの終了コードを更新 */
			lDetail = ptMyEPRC->lDetailCode;		/* 自プロセス管理テーブルの詳細情報を設定	*/
		}
	}


	DbgMsg01(DLv04, (OutPut, "***** %s:lEndCode = %08lx \n", "os_sigact", lEndCode));
	DbgMsg01(DLv04, (OutPut, "***** %s:ptMyEPRC->lEndCode = %08lx \n", "os_sigact",
			ptMyEPRC->lEndCode));
	DbgMsg01(DLv04, (OutPut, "***** %s:lDetail  = %08lx \n", "os_sigact", lDetail));
	DbgMsg01(DLv04, (OutPut, "***** %s:lCoreFlg = %ld \n", "os_sigact", lCoreFlg));


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
	/****************************************/
	/*  TRADEプロセス終了処理の呼び出し		*/
	/****************************************/
	DbgMsg01( DLv04, ( OutPut, "\n***** %s: os_endProcess IN \n", "os_sigact" ) );
	os_endProcess();								/* TRADEプロセス終了処理の呼び出し			*/
	DbgMsg01( DLv04, ( OutPut, "\n***** %s: os_endProcess OUT\n", "os_sigact" ) );

	/****************************************/
	/*  プロセス終了手続き					*/
	/****************************************/
	if (0 == lCoreFlg)								/* gcoreでのcoreファイル取得正常時			*/
	{
		os_abort(lEndCode, lDetail, lCoreFlg);		/* アボート（core未取得で発行）				*/
	}
	else											/* gcoreでのcoreファイル取得異常時			*/
	{
		os_abort(lEndCode, lDetail, lCoreFlg);		/* アボート（core取得で発行）				*/
	}


													/* 関数出口									*/
	DbgMsg01( DLv02, ( OutPut, "\n***** %s: End  DbgSubFnc\n", "os_sigact" ) );
	os_trcget2( D_MD_OS_SIGACT, D_T_TRA_OUT, 0);
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
