/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 タイマ制御													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 システムコールタイマの設定									*/
/* ＜モジュールＩＤ＞				 os_systim													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年０９月３０日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月１５日		仕様変更番号（ＳＳＬＡ００４２）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 システムコールタイマの設定																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_systim.h>																*/
/*																								*/
/*	   	long	os_systim( long time, long unit, long uptm ) 									*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	time		時間																*/
/*		long	unit		単位時間															*/
/*		long	uptm		切上区分  															*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		OSEEITIM																*/
/*						OSEEIUNI																*/
/*						-1																		*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdio.h>
#include <stdlib.h>
#include <errno.h>
/*****************************  利用者作成ヘッダ・ファイル  *************************************/
#include "os_systim.h"
#include "os_systim_ins.h"				// 内部参照用（個別）
#include "os_tmctl.h"					// タイマ制御

/****************************************************************************/
/* 機能：システムコールタイマの設定                                         */
/* 作成日：2002年9月30日                                                    */
/* 変更日：2002年10月12日                                                   */
/* 作成者：梶原                                                             */
/* 呼出形式：                                                               */
/*   long os_systim( long time, long unit, long uptm )                      */
/*     long time         時間                                               */
/*     long unit         単位時間                                           */
/*     long uptm         切上区分                                           */
/*                                                                          */
/****************************************************************************/
long os_systim( long time, long unit, long uptm )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
    long lMicroSec = 0;					// マイクロ秒
    long lSec = 0;						// 秒
    long lRet = 0;						// 関数の結果返却値
/*****	仕様変更番号SSLA0042の対応		Start							修正日：2003.07.15	*****/
	long lMilliSec = 0;					// ミリ秒
/*****	仕様変更番号SSLA0042の対応		 End							修正日：2003.07.15	*****/

	os_trcget2( D_MD_OS_SYSTIM, D_T_TRA_IN, 3, time, unit, uptm );
	
//    DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
    
    if( D_TIME_MIN > time )				// 時間が最小値より小さい時
    {
		os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_PRA, 1, OSEEITIM );
		
//		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEITIM ) );
		return( OSEEITIM );				// OSEEITIMを返却
	}
	
/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	/************************************************/
	/*	タイムアウト時間の算出						*/
	/************************************************/
	switch( unit )
	{
		case D_UNIT_MSEC:				// 単位時間がミリ秒の時
			switch( uptm )
			{
				case D_UPTIME_TEN:		// 切上区分が10の時
/*****	仕様変更番号SSLA0042の対応		Start							修正日：2003.07.15	*****/
/************************************************************************************************/
/*	仕様変更により時間の最大値チェック処理を削除												*/
/************************************************************************************************/
					/********************************/
					/*	時間算出					*/
					/********************************/
//					lMicroSec = ((( long )(( time + ( D_UPTIME_TEN - 1 )) / D_UPTIME_TEN )) 
//					                                              * D_UPTIME_TEN * 1000 );
										// マイクロ秒の設定（値の切上げ処理）
//					lSec = 0;			// 秒の設定

					lSec      = time / 1000;		// 秒の算出
					lMilliSec = time % 1000;		// ミリ秒の算出
													// マイクロ秒の設定（値の切上げ処理）
					lMicroSec = ((lMilliSec + ( D_UPTIME_TEN - 1 )) / D_UPTIME_TEN)
																	* D_UPTIME_TEN * 1000;

					DbgMsg01(DLv04,(OutPut, "***** %s:lSec=%ld, lMilliSec=%ld, lMicroSec= %ld\n",
									D_PROC_NAME, lSec, lMilliSec, lMicroSec));
/*****	仕様変更番号SSLA0042の対応		 End							修正日：2003.07.15	*****/
					
					break;
					
				case D_UPTIME_HUNDRED:	// 切上区分が100の時
/*****	仕様変更番号SSLA0042の対応		Start							修正日：2003.07.15	*****/
/************************************************************************************************/
/*	仕様変更により時間の最大値チェック処理を削除												*/
/************************************************************************************************/
					/********************************/
					/*	時間算出					*/
					/********************************/
//					lMicroSec = ((( long )(( time + ( D_UPTIME_HUNDRED - 1 )) / D_UPTIME_HUNDRED ))
//					                                                  * D_UPTIME_HUNDRED * 1000 );
										// マイクロ秒の設定（値の切上げ処理）
//					lSec = 0;			// 秒の設定

					lSec      = time / 1000;		// 秒の算出
					lMilliSec = time % 1000;		// ミリ秒の算出
													// マイクロ秒の設定（値の切上げ処理）
					lMicroSec = ((lMilliSec + ( D_UPTIME_HUNDRED - 1 )) / D_UPTIME_HUNDRED)
																		* D_UPTIME_HUNDRED * 1000;

					DbgMsg01(DLv04,(OutPut, "***** %s:lSec=%ld, lMilliSec=%ld, lMicroSec= %ld\n",
									D_PROC_NAME, lSec, lMilliSec, lMicroSec));
/*****	仕様変更番号SSLA0042の対応		 End							修正日：2003.07.15	*****/
					
					break;
					
				default:				// 切上区分がその他の時
//					DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n",
//															 D_PROC_NAME, OSEEIUNI ) );
															 
					os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_SYS, 1, OSEEIUNI );  										 
															 
        			return( OSEEIUNI );	// OSEEIUNIを返却
			}
			break;
			
		case D_UNIT_SEC:				// 単位時間が秒の時
			lMicroSec = 0;				// マイクロ秒の設定
			
			lSec = time;				// 秒の設定
			
			break;
			
		case D_UNIT_MINUTE:				// 単位時間が分の時
			/****************************************/
			/*	オーバーフローチェック				*/
			/****************************************/
			if( D_MIN_MAX < time )		// 時間が最大値を超えている時
			{
//				DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEITIM ) );
				
				os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_SYS, 1, OSEEITIM );  
				
				return( OSEEITIM );		// OSEEITIMを返却
			}
			
			lMicroSec = 0;				// マイクロ秒の設定
			
			lSec = time * 60;			// 秒の設定（分を秒に変換）
			
			break;
			
		case D_UNIT_HOUR:				// 単位時間が時の時
			/****************************************/
			/*	オーバーフローチェック				*/
			/****************************************/
			if( D_HOUR_MAX < time )		// 時間が最大値を超えている時
			{
//				DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEITIM ) );
				
				os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_SYS, 1, OSEEITIM ); 
				
				return( OSEEITIM );		// OSEEITIMを返却
			}
			
			lMicroSec = 0;				// マイクロ秒の設定
			
			lSec = time * 60 * 60;		// 秒の設定（時を秒に変換）
			
			break;
			
		default:						// 単位時間がその他の時
//			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEIUNI ) );
			
			os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_SYS, 1, OSEEIUNI ); 
			
			return( OSEEIUNI );			// OSEEIUNIを返却
	}

	/************************************************/
	/*  タイマ制御の起動							*/
	/************************************************/
	lRet = os_tmctl( D_RID_NONE, D_RNUM_NONE, lMicroSec, lSec );
										// タイマ発行	
	if( NORMAL != lRet )				// 返却値が正常値でない時
	{
		goto err_os_systim;				// 異常処理に遷移
	}
	
//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
	
	os_trcget2( D_MD_OS_SYSTIM, D_T_TRA_OUT, 1, NORMAL ); 
	
	return( NORMAL );					// NORMALを返却
	
/****************************************************************************/
/* 異常処理                                                                 */
/****************************************************************************/
err_os_systim:
	switch( lRet )
	{
		case OSEEITIM:					// OSEEITIMの時
//			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEITIM ) );
			
			os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_SYS, 1, OSEEITIM ); 
			
			return( OSEEITIM );			// OSEEITIMを返却
			break;
				
		default:						// その他の時
//			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, -1 ) );
	
			os_trcget2( D_MD_OS_SYSTIM, D_T_ERR_SYS, 1, -1 ); 
			
			return( -1 );				// アボート処理
	}
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/

