/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 タイマ制御													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 タイムアウトキャンセル										*/
/* ＜モジュールＩＤ＞				 os_tmcan													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月０４日		故障管理番号（ＴＢＣＳ０２０２）*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０７月１５日     故障管理番号（ＴＢＣＳ０２０３）*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０７月１７日     故障管理番号（ＴＢＣＳ０２３５）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 タイマをキャンセルする																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_tmcan.h>																*/
/*																								*/
/*	   	long	os_tmcan( long rd )																*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long		rd;					リクエスト識別子										*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		-1																		*/
/*						OSEEIVRD																*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <sys/time.h>                   // settimer用

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "os_tmcan_ins.h"               // 内部参照用（個別）
#include "os_tmcan.h"

/****************************************************************************/
/*                                                                          */
/*  ＜関数名＞    os_tmcan                                                  */
/*                                                                          */
/*  ＜機能概要＞  タイマをキャンセルする                                    */
/*                                                                          */
/****************************************************************************/
long os_tmcan( long rd )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
    TEtmcTable *ptTEtmcTable = ptEtmc;  // タイマ管理テーブル先頭アドレス
    TEtmcTableInd *ptTEtmcTableInd = ( void * )ptEtmc + sizeof( TEtmcTable );
                                        // タイマ管理テーブル個別部アドレス

    TEtmcTableInd *ptTEtmcTableIndNext = NULL; // キャンセル対象アドレスの次のアドレス
    TEtmcTableInd *ptTEtmcTableIndCancel = NULL;
                                        // キャンセル対象アドレス
    TEtmcTableInd *ptTEtmcTableIndIssue = NULL;// 発行中個別部アドレス

    long lReqId = 0;                        // 作業用変数
    int iSetitimerRet = 0;                  // setitimerの返却値
    struct itimerval tOvalue;           // 残り時間
    

	os_trcget2( D_MD_OS_TMCAN, D_T_TRA_IN, 1, rd);
    
/*****	故障管理番号TBCS0202の対応		Start							修正日：2003.07.04	*****/
	memset(&tOvalue, 0, sizeof(struct itimerval));	// 残り時間 クリア
/*****	故障管理番号TBCS0202の対応		 End							修正日：2003.07.04	*****/

//    DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
/*****  障害対応（TBCS0203）    Start                                   修正日：2003.07.15  *****/
//    if( rd < D_REQID_MIN || rd >= ptTEtmcTable->lTimeMaxCnt )
    if( rd < D_REQID_MIN || rd > ptMyEPRC->lMaxReqNum )
/*****  障害対応（TBCS0203）    End                                     修正日：2003.07.15  *****/
                                       // リクエスト識別子の確認
    {
		os_trcget2( D_MD_OS_TMCAN, D_T_ERR_PRA, 1, OSEEIVRD);
		
        DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", 
                                              D_PROC_NAME, OSEEIVRD ) );
        return( OSEEIVRD );
    }

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	/************************************************/
	/*	キャンセル対象の検索						*/
	/************************************************/
    for( lReqId = 0; lReqId < ptTEtmcTable->lTimeMaxCnt; lReqId++ )
                                        // リクエスト識別子がrdと一致する
                                        // 個別部を検索
    {
        if( ptTEtmcTableInd[ lReqId ].lReqId == rd )
                                        // キャンセル対象が見つかった時
        {
            ptTEtmcTableIndCancel = &ptTEtmcTableInd[ lReqId ];
                                        // 変数「キャンセル対象アドレス」に設定
            break;
        }
    }
    if( lReqId == ptTEtmcTable->lTimeMaxCnt )
                                        // キャンセル対象が見つからなかった時
    {
//        DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", 
//                                              D_PROC_NAME, OSEEIVRD ) );
                                              
       	os_trcget2( D_MD_OS_TMCAN, D_T_ERR_SYS, 1, OSEEIVRD);                                      
                                              
        return( OSEEIVRD );
    }

	/********************************************/
	/*  タイマのキャンセル                      */
	/********************************************/
    os_trcget2( D_MD_OS_TMCAN, D_T_SYS_SETITIMER, 3, ITIMER_REAL, NULL, &tOvalue );
    
    iSetitimerRet = setitimer( ITIMER_REAL, NULL, &tOvalue );
                                        // タイマのキャンセル
    
    //os_trcget2( D_MD_OS_TMCAN, D_T_SYS_END, 1, iSetitimerRet );
	os_trcget2( D_MD_OS_TMCAN, D_T_SYS_END, 4,
			iSetitimerRet, errno, tOvalue.it_value.tv_sec, tOvalue.it_value.tv_usec  );
                                        
    if( iSetitimerRet == D_ERR_SYS )    // タイマセット失敗
    {
//        DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", 
//                                              D_PROC_NAME, -1 ) );
                                           
        os_trcget2( D_MD_OS_TMCAN, D_T_ERR_SYS, 2, -1 , errno);                                  
                                              
        return( -1 );                   // アボード処理
    }
/*****  障害対応（TBCS0235）    Start                                   修正日：2003.07.17  *****/
	if( ptTEtmcTable->ptNxtAdr != NULL )
	{
/*****  障害対応（TBCS0235）    End                                     修正日：2003.07.17  *****/
    ptTEtmcTableIndIssue = ( TEtmcTableInd * )ptTEtmcTable->ptNxtAdr;
                                        // 「発行中アドレス」に管理部の次タイマ
                                        // を設定
    ptTEtmcTableIndIssue->dTimer = 
              tOvalue.it_value.tv_sec + ( tOvalue.it_value.tv_usec * D_USEC );
                                        // 現発行中のアドレスのタイマを設定
    ptTEtmcTableIndNext = ( TEtmcTableInd * )ptTEtmcTableIndCancel->ptNextAdr;
                                        // 「キャンセル対象の次アドレス」に
                                        // 「キャンセル対象アドレス」の
                                        // 次タイマを設定
    if( ptTEtmcTableIndNext != ( void * )ptTEtmcTable )
                                        // 「キャンセル対象の次アドレス」が
                                        // 管理部でない時
    {
        ptTEtmcTableIndNext->dTimer += ptTEtmcTableIndCancel->dTimer;
                                        // 「キャンセル対象の次アドレス」の
                                        // タイマ値に「キャンセル対象アドレス」
                                        // のタイマ値を追加する
    }

	/************************************************/
	/*	タイマの発行								*/
	/************************************************/
    ptTEtmcTableIndCancel->lReqNum = D_REQUESTNO_INI;
                                        // 「キャンセル対象アドレス」の
                                        // リクエスト番号をクリア
    os_SetTimer( ptTEtmcTableIndCancel );
                                        // タイマのキャンセル
//    DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
    
/*****  障害対応（TBCS0235）    Start                                   修正日：2003.07.17  *****/
	}
/*****  障害対応（TBCS0235）    End                                     修正日：2003.07.17  *****/
   	
	os_trcget2( D_MD_OS_TMCAN, D_T_TRA_OUT, 1, NORMAL);
   	
    return( NORMAL );
}
/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
