/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 タイマ制御													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 タイムアウト受信											*/
/* ＜モジュールＩＤ＞				 os_timex													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月０４日		故障管理番号（ＴＢＣＳ０２０２）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		タイムアウトにより通知されるシグナル「SIGNAL」のハンドラ。								*/
/*		次タイマが存在する場合はsetitimerを発行し、タイマのスタートを行う。						*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<os_timex.h>																*/
/*																								*/
/*	   	void	os_timex( int sig )																*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long		sig					シグナル												*/
/*																								*/
/* ＜返却値＞																					*/
/*		なし																					*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <sys/time.h>                   // settimer用

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "os_timex.h"
#include "os_timex_ins.h"               // 内部参照用（個別）

/****************************************************************************/
/*                                                                          */
/*  ＜関数名＞    os_timex                                                  */
/*                                                                          */
/*  ＜機能概要＞  タイムアウトにより通知されるシグナル「SIGNAL」の          */
/*                ハンドラ。                                                */
/*                次タイマが存在する場合はsetitimerを発行し、               */
/*                タイマのスタートを行う。                                  */
/*                                                                          */
/****************************************************************************/
void os_timex( int sig )
{
	long	lRet;
	struct itimerval    tValue;         			// タイマ値構造体
    TEtmcTable	*ptTEtmcTable = ptEtmc;  			// タイマ管理テーブル先頭アドレス
    TEtmcTableInd	*ptTEtmcTableIndIssue = NULL;	// 現発行中アドレス


    DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
	os_trcget2( D_MD_OS_TIMEX, D_T_TRA_IN, 1, sig);


/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	/************************************/
	/*  発行中のタイマを止める			*/
	/************************************/
/*****	故障管理番号TBCS0202の対応		Start							修正日：2003.07.04	*****/
	memset(&tValue, 0, sizeof(struct itimerval));   // タイマ値構造体 クリア
/*****	故障管理番号TBCS0202の対応		 End							修正日：2003.07.04	*****/
	tValue.it_value.tv_sec = 0;
	tValue.it_value.tv_usec = 0;

	os_trcget2( D_MD_OS_TIMEX, D_T_SYS_SETITIMER, 3, ITIMER_REAL, &tValue, NULL );    
	lRet = setitimer( ITIMER_REAL, &tValue, NULL );	// タイマキャンセル
    os_trcget2( D_MD_OS_TIMEX, D_T_SYS_END, 1, lRet );                                    
	
	DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lRet=%d )\n", D_PROC_NAME, lRet ) );

	if (D_ERR_SYS == lRet)							// 処理異常の場合
	{
		lRet = os_ErrorSetTimer();					// タイマ発行エラー処理をする
		DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lRet=%ld )\n", D_PROC_NAME, lRet ) );

		if( lRet != NORMAL )
		{
			DbgMsg01( DLv05, ( OutPut, "***** %s: Err Function 02: 0x%08x\n", D_PROC_NAME, -1 ) );
		}
	}


/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
    if( ptTEtmcTable->ptNxtAdr == NULL )
                                        // 発行中アドレスがなかった時
    {
        DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", 
                                                             D_PROC_NAME ) );
		
		os_trcget2( D_MD_OS_TIMEX, D_T_ERR_PRA, 0);
                                                             
        return;                         // 処理を終了する
    }
    else                                // 発行中のアドレスがあった時
    {
        ptTEtmcTableIndIssue = ( TEtmcTableInd * )ptTEtmcTable->ptNxtAdr;
                                        // 現発行中アドレスを取得する
    }

                                        // os_SetTimerでタイムアウト判定で使用
    ptTEtmcTableIndIssue->dTimer = D_TIMEOUT; 

    os_SetTimer( ptTEtmcTableIndIssue );

    DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
    
   	os_trcget2( D_MD_OS_TIMEX, D_T_TRA_OUT, 0);
    
    return;                             // 正常終了
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/
