/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共用メモリ管理												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 共用メモリのマッピング										*/
/* ＜モジュールＩＤ＞				 osatshm													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)							*/
/*									 サプライ　梶原												*/
/* ＜ソース作成年月日＞ 			 ２００２年１０月　３日 									*/
/* ＜ソース修正者＞ 				 サプライ　中村												*/
/* ＜ソース正年月日及び修正ＩＤ＞	 ２００３年　１月２２日		仕様変更番号（ＳＳＬＡ０００５）*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース正年月日及び修正ＩＤ＞	 ２００３年　５月　９日		故障管理番号（ＴＢＣＡ００２７）*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０７月１５日     故障管理番号（ＴＢＣＳ０２１０）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 共有メモリのマッピング 																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<osatshm.h>																	*/
/*																								*/
/*	   	long osatshm( long shmid, long *addr, long *size )										*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	shmid;		共有メモリ識別子													*/
/*		long	*addr;		マッピングを行う先頭論理アドレス									*/
/*		long	*size;		サイズ返却域														*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了			共有メモリセグメントアドレス										*/
/*		異常終了			OSEEISHM		共有メモリ識別子不正								*/
/*							OSEENEXS		共有メモリ未確保									*/
/*							OSEENACC															*/
/*							OSEEISHM															*/
/*							OSEENRPG															*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/shm.h>
#include <errno.h>


/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include "osatshm.h"
#include "osatshm_ins.h"							// 内部参照用（個別）


/************************************************************************************************/
/* 機能		：共有メモリのマッピング															*/
/* 作成日	：2002年10月 3日																	*/
/* 変更日	：2002年11月29日																	*/
/* 作成者	：梶原																				*/
/* 呼出形式	：																					*/
/*	long osatshm( long shmid, long *addr, long *size )											*/
/*		long	shmid	共有メモリ識別子														*/
/*		long	*addr	マッピングを行う先頭論理アドレス										*/
/*		long	*size	サイズ返却域															*/
/*																								*/
/************************************************************************************************/
long osatshm( long shmid, long *addr, long *sizea )
{

	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
//	long lAsso;										// 種別
	long lSerNum;									// 通番
	int iShmId = 0;									// 共有メモリID
	long lIndNum;									// 個別部数
	void *pvSegAddr;								// 共有メモリセグメントアドレス
	TEsmcTableInd *ptIndAdr;						// 共有メモリ管理テーブル個別部のアドレス


	/********************************************************************************************/
	/*	初期処理																				*/
	/********************************************************************************************/
    os_trcget2(D_MD_OSATSHM,D_T_TRA_IN,3,shmid,addr,sizea);

//    DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
//    DbgMsg01( DLv04, ( OutPut, "***** %s: shmid:%08lx\n", D_PROC_NAME, shmid) );
//    DbgMsg01( DLv04, ( OutPut, "***** %s: addr :%08lx\n", D_PROC_NAME, addr) );
//    DbgMsg01( DLv04, ( OutPut, "***** %s: sizea :%ld\n", D_PROC_NAME, sizea) );


//	lAsso = os_GetAsso( shmid );					// 種別の取得
	lSerNum = os_GetSerNum( shmid );				// 通番の取得

	DbgMsg01( DLv04, ( OutPut, "***** %s: 通番:%lx\n", D_PROC_NAME, lSerNum) );


    lIndNum = ptEsmc->lIndPartNum;					// 個別部数取得

													// 通番が不正の時
/*****  障害対応（TBCS0210）    Start                                   修正日：2003.07.15  *****/
    if(( D_SHMKEY_MIN > lSerNum ) || ( lIndNum <= lSerNum ))
//    if(( D_SHMKEY_MIN > lSerNum ) || ( lIndNum < lSerNum ))
/*****  障害対応（TBCS0210）    End                                     修正日：2003.07.15  *****/
    {

    	DbgMsg01( DLv05, ( OutPut, "***** %s: Err Function: %x\n", D_PROC_NAME, OSEEISHM ) );
        os_trcget2(D_MD_OSATSHM,D_T_ERR_PRA,1,OSEEISHM);
        return( OSEEISHM );							// OSEEISHMを返却
    }


	/********************************************************************************************/
	/*	本処理																					*/
	/********************************************************************************************/

	/*****	障害対応（TBCA0027）	Start								修正日：2003.05.09	*****/
	/********************************************************************************************/
	/*	個別部のアドレス算出処理を修正（取得した通番で指定する）								*/
	/********************************************************************************************/
    												// 指定個別部のアドレス取得
//	ptIndAdr = ((TEsmcTableInd *)( ptEsmc + 1 )) + ( lSerNum - 1 );
	ptIndAdr = ((TEsmcTableInd *)( ptEsmc + 1 )) + lSerNum;
	/*****	障害対応（TBCA0027）	 End								修正日：2003.05.09	*****/

    iShmId = ptIndAdr->lShmId;						// 共有メモリID取得

    if( D_SHMID_NONE == iShmId )					// 共有メモリが未確保の時
    {
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEENEXS ) );
		os_trcget2(D_MD_OSATSHM,D_T_ERR_SYS,1,OSEENEXS);
		return( OSEENEXS );							// OSEENEXSを返却
	}

													// 共有メモリのアタッチ
    os_trcget2(D_MD_OSATSHM,D_T_SYS_SHMAT,3,iShmId, addr, D_SHMAT_FLG);
    pvSegAddr = shmat( iShmId, addr, D_SHMAT_FLG );
    os_trcget2(D_MD_OSATSHM,D_T_SYS_END,1,pvSegAddr);

    if( D_ERR_SYS == ( long )pvSegAddr )			// 共有メモリのアタッチに失敗した時
    {
		goto err_osatshm;							// 異常処理に遷移
	}

	*sizea = ptIndAdr->lShmSize;					// 共有メモリサイズ設定
	ptIndAdr->lAttach++;							// 利用状況インクリメント 20030122 追加

	DbgMsg01( DLv04, ( OutPut, "***** %s: ptIndAdr->lAttach:%ld\n",
			D_PROC_NAME, ptIndAdr->lAttach ) );


	/********************************************************************************************/
	/*	終了処理																				*/
	/********************************************************************************************/
//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
	os_trcget2(D_MD_OSATSHM,D_T_TRA_OUT,1,pvSegAddr);
	return( ( long )pvSegAddr );		// pvSegAddrを返却


	/********************************************************************************************/
	/*	異常処理																				*/
	/********************************************************************************************/
err_osatshm:
	switch( errno )									// エラー判定処理
	{
		case EACCES:								// EACCESの時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEENACC ) );
			os_trcget2(D_MD_OSATSHM,D_T_ERR_SYS,1,OSEENACC);
			return( OSEENACC );						// OSEENACCを返却
			break;

		case EINVAL:								// EINVALの時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEISHM ) );
			os_trcget2(D_MD_OSATSHM,D_T_ERR_SYS,1,OSEEISHM);
			return( OSEEISHM );						// OSEEISHMを返却
			break;

		case ENOMEM:								// ENOMEMの時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEENRPG ) );
			os_trcget2(D_MD_OSATSHM,D_T_ERR_SYS,1,OSEENRPG);
			return( OSEENRPG );						// OSEENRPGを返却
			break;

		default:									// その他の時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, -1 ) );
			os_trcget2(D_MD_OSATSHM,D_T_ERR_SYS,2,-1, errno );
            os_treterm(os_EndCod(D_END_TYPE1), (D_MD_OSATSHM << 16) | D_T_ERR_SYS );
//			return( -1 );							// -1を返却
	}
}
/************************************************************************************************/
/*	End																							*/
/************************************************************************************************/
