/****************************************************************************/
/*  著作権  ２００２                                                        */
/*            株式会社ＮＴＴデータ                                          */
/*              金融ビジネス事業本部                                        */
/*                                                                          */
/*                                                                          */
/*  収容物  ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ              */
/****************************************************************************/
/* ＜対象業務名＞                  ＴＲＡＤＥエミュレータ                   */
/* ＜対象業務ＩＤ＞                ＴＲＥ                                   */
/* ＜サービス項目名＞              ファイル管理                             */
/* ＜サービス項目ＩＤ＞            ＸＸＸＸＸＸＸ                           */
/* ＜モジュール名＞                ファイルとプロセスの連結                 */
/* ＜モジュールＩＤ＞              osconn2                                  */
/* ＜モジュール通番＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜適用機種名＞                  汎用サーバ                               */
/* ＜適用ＯＳ＞                    Ｌｉｎｕｘ                               */
/* ＜開発環境＞                    ＲＨＡＳ２．１                           */
/* ＜記述言語＞                    Ｃ言語                                   */
/* ＜モジュール形態＞              関数                                     */
/* ＜機能区分＞                                                             */
/* ＜対象データ＞                                                           */
/* ＜工程・階層区分＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞              ＬＡＬａ−ＳＭＰシステム                 */
/* ＜開発システム番号＞            ＰＰ４０Ｂ００１２２０                   */
/*--------------------------------------------------------------------------*/
/* ＜開発担当名＞                  ＣＢ事ビジネス企画担当(メ−カ：サプライ) */
/* ＜電話番号＞                    148-1457(03-5437-1457)                   */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞                    ＣＢ事ビジネス企画担当                   */
/* ＜設計年月日＞                  ２００２年　９月２７日                   */
/* ＜設計修正者名＞                                                         */
/* ＜設計修正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者＞                ＣＢ事ビジネス企画担当(メ−カ:ＸＸＸＸ)  */
/* ＜ソース作成年月日＞            ２００２年　９月２７日                   */
/* ＜ソース修正者＞                                                         */
/* ＜ソース正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ数＞              ステップ                                 */
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞                                                             */
/*   TCP/IP特殊ファイルコネクト                                             */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞                                                             */
/*      long osconn2( char *path )                                          */
/*                                                                          */
/* ＜仮引数＞                                                               */
/*      char        *path              ファイルパス名 （使用しない）        */
/*                                                                          */
/* ＜返却値＞                                                               */
/*     1L                                                                   */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構造＞                                                     */
/* ＜制限事項＞                                                             */
/*     特になし                                                             */
/* ＜使用外部モジュールＩＤ＞                                               */
/* ＜呼出元のモジュールＩＤ＞                                               */
/*                                                                          */
/*                                                                          */
/****************************************************************************/
/******************************** 標準ヘッダ・ファイル **********************/
#include <stdlib.h> 					// malloc用
#include <string.h> 					// memset用

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "osconn2.h"
#include "osconn2_ins.h"				// 内部参照用（個別）
#include "os_SG.h"						// os_getSG用

/****************************************************************************/
/*                                                                          */
/*  ＜関数名＞    osconn2                                                   */
/*                                                                          */
/*  ＜機能概要＞  TCP/IP特殊ファイルコネクト                                */
/*                                                                          */
/****************************************************************************/
long osconn2( char *path )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	int  iCommonRet;					// 共通関数リターン値
	long lEcncNum;						// 個別部数格納用ワーク
	long lEcncSize; 					// コネクション管理テーブルサイズ設定

	os_trcget2( D_MD_OSCONN2, D_T_TRA_IN, 1, path );
	
//	DbgMsg01( DLv02, ( OutPut, "***** %s: Start Function\n", D_PROC_NAME ) );

	if( ptEcnc != NULL )				// コネクション管理テーブルが作成済の時
	{
		DbgMsg01( DLv02, ( OutPut, "***** %s: End Function\n", D_PROC_NAME ) );
		os_trcget2( D_MD_OSCONN2, D_T_TRA_OUT, 1, D_TCPIP_NORMAL );
		return( D_TCPIP_NORMAL ); 		// 正常値リターン：1L
	}

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	iCommonRet = os_getSG( D_SG_ECNC_NUM, &lEcncNum);
										// コネクション管理テーブル個別部数の取得
	if( iCommonRet == D_ERR_SYS )		// コネクション管理テーブル個別部数の取得に失敗した時
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s: Err Function 01: 0x%08x\n", D_PROC_NAME, OSEEWKEX ) );
		os_trcget2( D_MD_OSCONN2, D_T_ERR_SYS, 1, OSEEWKEX );
		return( OSEEWKEX );				// OSEEWKEXを返却
	}
	DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lEcncNum=%ld )\n", D_PROC_NAME, lEcncNum ) );
	
	lEcncSize = sizeof(TEcncTable) + ( sizeof(TEcncTableInd) * lEcncNum );
										// コネクション管理テーブルサイズ設定
	DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( lEcncSize=%ld )\n", D_PROC_NAME, lEcncSize ) );

	os_trcget2( D_MD_OSCONN2, D_T_SYS_MALLOC, 1, lEcncSize );
	ptEcnc = ( TEcncTable * )malloc( lEcncSize );
										// コネクション管理テーブルの領域確保
	os_trcget2( D_MD_OSCONN2, D_T_SYS_END, 1, ptEcnc );
										
	if( ptEcnc == NULL )				// コネクション管理テーブルの領域確保に失敗した時
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s: Err Function 02: 0x%08x ( %s: %s )\n",
						D_PROC_NAME, OSEEWKEX, "malloc", strerror(errno) ) );
		os_trcget2( D_MD_OSCONN2, D_T_ERR_SYS, 1, OSEEWKEX );
		return( OSEEWKEX ); 			// OSEEWKEXを返却
	}
	DbgMsg01( DLv04, ( OutPut, "***** %s: Display ( ptEcnc=%p )\n", D_PROC_NAME, ptEcnc ) );

	memset( ptEcnc, 0, lEcncSize );		// 動的メモリのクリア

										// -- コネクション管理テーブル設定 --
//	strcpy( ptEcnc->acTid, D_ECNC_TID );// 20021218 修正
	strncpy( ptEcnc->acTid, D_ECNC_TID, 4 );// 領域識別子の設定
	ptEcnc->lMaxIndNum = lEcncNum;		// 個別部数の設定

										// -- システムテーブル管理テーブル設定 --
	ptEsys->tMstECNC.pvAdr = ptEcnc;
										// システムテーブル管理テーブルのコネクション管理情報の
										// 先頭アドレスにコネクション管理テーブルアドレスを設定
	ptEsys->tMstECNC.lSize = lEcncSize;
										// システムテーブル管理テーブルのコネクション管理情報の
										// サイズにコネクション管理テーブルサイズを設定

//	DbgMsg01( DLv02, ( OutPut, "***** %s: End Function\n", D_PROC_NAME ) );
	os_trcget2( D_MD_OSCONN2, D_T_TRA_OUT, 1, D_TCPIP_NORMAL );
	return( D_TCPIP_NORMAL ); 			// 正常値リターン：1L
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/
