/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 実行管理													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ＣＭバッファプールの作成									*/
/* ＜モジュールＩＤ＞				 oscrecbp													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* 作成者：五味                                                             */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日：2002年10月9日                                                    */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 ＣＭバッファプールの作成 																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<oscrecbp.h>																*/
/*																								*/
/*	   	long	oscrecbp( long poolid, long size, long unit, long access ) 						*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	poolid;		プール識別子														*/
/*		long	size;		バッファプールサイズ												*/
/*		long	unit;		ユニットサイズ														*/
/*		long	access;		アクセス権															*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		oscrelbpの返却値														*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include "oscrecbp.h"
#include "oscrecbp_ins.h"				// 内部参照用（個別）
#include "oscrelbp.h"

/****************************************************************************/
/* 機能：ＣＭバッファプールの作成                                           */
/* 作成日：2002年10月9日                                                    */
/* 変更日：                                                                 */
/* 作成者：五味                                                             */
/* 呼出形式：                                                               */
/*   long oscrecbp( long poolid, long size, long unit, long access )        */
/*     long poolid         プール識別子                                     */
/*     long size           バッファプールサイズ                             */
/*     long unit           ユニットサイズ                                   */
/*     long access         アクセス権                                       */
/*                                                                          */
/****************************************************************************/
long oscrecbp( long poolid, long size, long unit, long access )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	long lRet;							// 返却値

	
	os_trcget2( D_MD_OSCRECBP, D_T_TRA_IN, 4, poolid, size, unit, access );

//	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	lRet = oscrelbp( poolid, size, unit, access );
										// oscrelbpシステムコールを呼び出す
	if( lRet != NORMAL )				// 返却値がNORMAL以外の時
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, lRet ) );
    
        os_trcget2(D_MD_OSCRECBP, D_T_TRA_OUT,1,lRet);
	
		return( lRet );					// oscrelbpシステムコールの返却値を返却
	}

//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
    
    os_trcget2(D_MD_OSCRECBP, D_T_TRA_OUT,1,NORMAL);
	
	return( NORMAL );					// NORMALを返却
}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
