/****************************************************************************/
/*  著作権  ２００２                                                        */
/*            株式会社ＮＴＴデータ                                          */
/*              金融ビジネス事業本部                                        */
/*                                                                          */
/*                                                                          */
/*  収容物  ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ              */
/****************************************************************************/
/* ＜対象業務名＞                  ＴＲＡＤＥエミュレータ                   */
/* ＜対象業務ＩＤ＞                ＴＲＥ                                   */
/* ＜サービス項目名＞              ファイル管理                             */
/* ＜サービス項目ＩＤ＞            ＸＸＸＸＸＸＸ                           */
/* ＜モジュール名＞                ファイルとプロセスの連結を切る           */
/* ＜モジュールＩＤ＞              osdconn2                                 */
/* ＜モジュール通番＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜適用機種名＞                  汎用サーバ                               */
/* ＜適用ＯＳ＞                    Ｌｉｎｕｘ                               */
/* ＜開発環境＞                    ＲＨＡＳ２．１                           */
/* ＜記述言語＞                    Ｃ言語                                   */
/* ＜モジュール形態＞              関数                                     */
/* ＜機能区分＞                                                             */
/* ＜対象データ＞                                                           */
/* ＜工程・階層区分＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞              ＬＡＬａ−ＳＭＰシステム                 */
/* ＜開発システム番号＞            ＰＰ４０Ｂ００１２２０                   */
/*--------------------------------------------------------------------------*/
/* ＜開発担当名＞                  ＣＢ事ビジネス企画担当(メ−カ：サプライ) */
/* ＜電話番号＞                    148-1457(03-5437-1457)                   */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞                    ＣＢ事ビジネス企画担当                   */
/* ＜設計年月日＞                  ２００２年　９月２７日                   */
/* ＜設計修正者名＞                                                         */
/* ＜設計修正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者＞                ＣＢ事ビジネス企画担当(メ−カ:ＸＸＸＸ)  */
/* ＜ソース作成年月日＞            ２００２年　９月２７日                   */
/* ＜ソース修正者＞                                                         */
/* ＜ソース正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ数＞              ステップ                                 */
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞                                                             */
/*   TCP/IP特殊ファイルディスコネクト                                       */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞                                                             */
/*      long osdconn2( long fildes )                                        */
/*                                                                          */
/* ＜仮引数＞                                                               */
/*      long        fildes              ファイル記述子（使用しない）        */
/*                                                                          */
/* ＜返却値＞                                                               */
/*     0                                                                    */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構造＞                                                     */
/* ＜制限事項＞                                                             */
/*     特になし                                                             */
/* ＜使用外部モジュールＩＤ＞                                               */
/* ＜呼出元のモジュールＩＤ＞                                               */
/*                                                                          */
/*                                                                          */
/****************************************************************************/
/******************************** 標準ヘッダ・ファイル **********************/
#include <stdlib.h> 					// free用

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "osdconn2.h"
#include "osdconn2_ins.h"				// 内部参照用（個別）

/****************************************************************************/
/*                                                                          */
/*  ＜関数名＞    osdconn2                                                  */
/*                                                                          */
/*  ＜機能概要＞  TCP/IP特殊ファイルディスコネクト                          */
/*                                                                          */
/****************************************************************************/
long osdconn2( long fildes )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	os_trcget2( D_MD_OSDCONN2, D_T_TRA_IN, 1, fildes );
	
//	DbgMsg01( DLv02, ( OutPut, "***** %s: Start Function\n", D_PROC_NAME ) );

	if( ptEcnc == NULL )				// コネクション管理テーブルが未作成の時
	{
		DbgMsg01( DLv02, ( OutPut, "***** %s: End Function\n", D_PROC_NAME ) );
		os_trcget2( D_MD_OSDCONN2, D_T_TRA_OUT, 1, NORMAL );
		return( NORMAL );				// 正常値リターン
	}

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	os_trcget2( D_MD_OSDCONN2, D_T_SYS_FREE, 1, ptEcnc );
	free( ptEcnc );						// コネクション管理テーブルの領域解放
	os_trcget2( D_MD_OSDCONN2, D_T_SYS_END, 0 );
	
	ptEsys->tMstECNC.pvAdr = NULL; 		// システムテーブル管理テーブル
										// コネクション管理情報先頭アドレスクリア
	ptEsys->tMstECNC.lSize = 0;    		// システムテーブル管理テーブル
										// コネクション管理情報サイズクリア
	ptEcnc = NULL;						// コネクション管理テーブル先頭アドレスクリア

//	DbgMsg01( DLv02, ( OutPut, "***** %s: End Function\n", D_PROC_NAME ) );
	os_trcget2( D_MD_OSDCONN2, D_T_TRA_OUT, 1, NORMAL );
	return( NORMAL );					// 正常値リターン
}

/****************************************************************************/
/* End                                                                      */
/****************************************************************************/
