/************************************************************************************************/
/*	著作権	２００２																			*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム	ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 例外制御													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 プロセスの強制終了											*/
/* ＜モジュールＩＤ＞				 osdespr													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年０９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年１１月０６日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月０２日		仕様変更番号（ＳＳＬＡ００３３）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		プロセスを強制的に終了させる。															*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<osdespr.h>																	*/
/*																								*/
/*		long	osdespr( long pid , long code )													*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	pid				プロセス識別子													*/
/*		long	code			終了コード														*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		OSEEIPID		プロセス識別子異常										*/
/*						OSEENEXS		対象プロセスが存在しない。								*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*		特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include<sys/types.h>                  //kill用ヘッダー 
#include<signal.h>                  

/*****************************  利用者作成ヘッダ・ファイル  *************************************/
#include "osdespr.h"
#include "osdespr_ins.h"

/*****************************************************************************/
/* 機能：プロセスの強制終了                                                  */
/* 作成日：2002年11月06日                                                    */
/* 変更日：　　年　月　日                                                    */
/* 作成者：大野　正喜                                                        */
/* 呼出形式：long osdespr(long pid,long code)                                */
/*                                                                           */
/*           long pid;    プロセス識別子                                     */
/*           long code;   終了コード                                         */
/*                                                                           */
/*****************************************************************************/
long osdespr(long pid,long code)
{
/********************************************************************************/
/*	変数定義																	*/
/********************************************************************************/
	TEprcTableInd *ptTableInd = NULL;           //プロセス管理テーブル個別部のアドレス
	long lPinf = 0;                             //プロセス情報
	int iRet = 0;                               //killの返却値
/*****	仕様変更番号SSLA0033の対応		Start							修正日：2003.07.02	*****/
	long lEndCode = 0;							// 終了コード
/*****	仕様変更番号SSLA0033の対応		 End							修正日：2003.07.02	*****/

/********************************************************************************/
/*	初期処理																	*/
/********************************************************************************/
	os_trcget2( D_MD_OSDESPR, D_T_TRA_IN, 2, pid, code  );
	
//	DbgMsg01(DLv02,(OutPut,"**** osdespr: Start DbgMainFunc\n")); 
	//プロセス識別子妥当性チェック
//	DbgMsg01(DLv04,(OutPut,"**** osdespr: pid=%x code=%x\n",pid,code)); 

	if((pid & 0x00ff0000)!=0x00010000 &&    //種別が1でない
	   (pid & 0x00ffffff)!=0x0)             //種別、通番のうちどちらかは0でない
	{
		os_trcget2( D_MD_OSDESPR, D_T_ERR_PRA, 1, OSEEIPID );
		
		DbgMsg01(DLv05,(OutPut,"**** osdespr: Err osdespr:Ret=%x\n",OSEEIPID));
		return(OSEEIPID);
	}

/********************************************************************************/
/*	本処理																		*/
/********************************************************************************/
											// 20030303 追加
	if( (pid & 0x00ffffff) == 0x0 )			// 種別通番共に0の時自プロセス終了
	{
		ptTableInd = ptMyEPRC;
	}
	else
	{
	
		//プロセス起動済チェック
		DbgMsg01(DLv02,(OutPut,"**** osdespr: Stsrt os_GstPrSep\n"));
		lPinf=os_GstPrSep(1,pid);			//プロセス識別子からプロセス管理テーブルを検索
		DbgMsg01(DLv02,(OutPut,"**** osdespr: End os_GstPrSep Pinf=%ld\n",lPinf));
		if(lPinf==-1)						//プロセス情報が得られない
		{
			os_trcget2( D_MD_OSDESPR, D_T_ERR_SYS, 0 );

			DbgMsg01(DLv05,(OutPut,"**** osdespr:Err os_GstPrSep: Pinf=%ld\n",lPinf)); 
			return(OSEENEXS);
		}
		ptTableInd=(TEprcTableInd *)(ptEprc+1); //プロセス管理テーブル個別部の
		                                        //先頭アドレスを設定
		ptTableInd += lPinf;                    //該当プロセス管理テーブル個別部の
		                                        //アドレスを設定
	}
	
	DbgMsg01(DLv04,(OutPut,"**** osdespr: Pid=%ld\n",ptTableInd->lPid));
	if(!ptTableInd->lPid)                   //プロセスＩＤが0
	{
		DbgMsg01(DLv04,(OutPut,"**** osdespr: invalid Pid=%ld\n",ptTableInd->lPid));
		DbgMsg01(DLv04,(OutPut,"**** osdespr: Err osdespr:Ret=%ld\n",OSEENEXS));
		
		os_trcget2( D_MD_OSDESPR, D_T_ERR_PRA, 1, OSEENEXS );
		
		return(OSEENEXS);
	}
	
	/************************************************/
	/*	プロセスの強制終了							*/
	/************************************************/
/*****	仕様変更番号SSLA0033の対応		Start							修正日：2003.07.02	*****/
	lEndCode = (code | 0x80000000);				// （引数）終了コードの先頭ビットを立てる
/*****	仕様変更番号SSLA0033の対応		 End							修正日：2003.07.02	*****/
	ptTableInd->lEndCode = lEndCode;			// 終了コードを設定
	DbgMsg01(DLv04,(OutPut,"**** osdespr: EndCode=%08lx\n",ptTableInd->lEndCode));
	
	os_trcget2( D_MD_OSDESPR, D_T_SYS_KILL, 2, ptTableInd->lPid, SIGTERM );
	
    iRet=kill(ptTableInd->lPid,SIGTERM);
    
    os_trcget2( D_MD_OSDESPR, D_T_SYS_END, 1, iRet );
    
    DbgMsg01(DLv04,(OutPut,"**** osdespr: End kill: Ret=%d\n",iRet));
	if(iRet==D_ERR_SYS)                      //kill異常終了
	{
		os_trcget2( D_MD_OSDESPR, D_T_ERR_SYS, 0 );
		
		DbgMsg01(DLv05,(OutPut,"**** osdespr: Err kill:Ret=%d\n",iRet));
		//errnoによるエラー処理（内容未定）
	}
//	DbgMsg01(DLv02,(OutPut,"**** osdespr:End DbgMainFunc:Ret=%x\n",NORMAL));
	
	os_trcget2( D_MD_OSDESPR, D_T_TRA_OUT, 1, NORMAL );

	return(NORMAL);
}
/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
