/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 共用メモリ管理												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 共用メモリの開放											*/
/* ＜モジュールＩＤ＞				 osdtshm													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)							*/
/*									 サプライ　梶原												*/
/* ＜ソース作成年月日＞ 			 ２００２年１０月０３日 									*/
/* ＜ソース修正者＞ 				 サプライ　中村												*/
/* ＜ソース正年月日及び修正ＩＤ＞	 ２００３年　１月２２日		仕様変更番号（ＳＳＬＡ０００５）*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース正年月日及び修正ＩＤ＞	 ２００３年　５月０２日		仕様変更番号（ＳＳＬＡ００２５）*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース正年月日及び修正ＩＤ＞	 ２００３年　５月０９日		故障管理番号（ＴＢＣＡ００２７）*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０７月１５日     故障管理番号（ＴＢＣＳ０２１０）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 共有メモリの無効化 																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<osdtshm.h>																	*/
/*																								*/
/*	   	long	osdtshm( long shmid )															*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	shmid;					共有メモリ識別子										*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了			NORMAL																*/
/*		異常終了			OSEEISHM															*/
/*							OSEENMAP															*/
/*							OSEENACC															*/
/*							OSEEISHM															*/
/*							OSEENRPG															*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/shm.h>
#include <errno.h>

/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include "osdtshm.h"
#include "osdtshm_ins.h"							// 内部参照用（個別）


/************************************************************************************************/
/* 機能：共有メモリの無効化                                                                     */
/* 作成日：2002年10月03日                                                                       */
/* 変更日：2003年04月24日                                                                       */
/* 作成者：梶原                                                                                 */
/* 呼出形式：                                                                                   */
/*		long osdtshm( long shmid )                                                              */
/*			long shmid		共有メモリ識別子                                                    */
/*                                                                                              */
/************************************************************************************************/
long osdtshm( long shmid )
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
//	long lAsso;										// 種別
	long lSerNum;									// 通番
    int iShmId;										// 共有メモリID
    long lIndNum;									// 個別部数
    int iRet;										// 関数の結果返却値
    TEsmcTableInd *ptIndAdr;						// 共有メモリ管理テーブル個別部のアドレス


	/********************************************************************************************/
	/* 初期処理                                                                                 */
	/********************************************************************************************/
	os_trcget2(D_MD_OSDTSHM,D_T_TRA_IN,1,shmid);
//    DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );

//	lAsso = os_GetAsso( shmid );					// 種別の取得
	lSerNum = os_GetSerNum( shmid );				// 通番の取得

    lIndNum = ptEsmc->lIndPartNum;					// 個別部数取得

/*****  障害対応（TBCS0210）    Start                                   修正日：2003.07.15  *****/
    if(( D_SHMKEY_MIN > lSerNum ) || ( lIndNum <= lSerNum ))
//    if(( D_SHMKEY_MIN > lSerNum ) || ( lIndNum < lSerNum ))
/*****  障害対応（TBCS0210）    End                                     修正日：2003.07.15  *****/
    {												// 通番が不正の時
    	DbgMsg01( DLv05, ( OutPut, "***** %s: Err Function: %x\n", D_PROC_NAME, OSEEISHM ) );

        os_trcget2(D_MD_OSDTSHM,D_T_ERR_PRA,1,OSEEISHM);
        return( OSEEISHM );							// OSEEISHMを返却
    }

	/*****	障害対応（TBCA0027）	Start								修正日：2003.05.09	*****/
	/********************************************************************************************/
	/*	個別部のアドレス算出処理を修正（取得した通番で指定する）								*/
	/********************************************************************************************/
//	ptIndAdr = ((TEsmcTableInd *)( ptEsmc + 1 )) + ( lSerNum - 1 );
	ptIndAdr = ((TEsmcTableInd *)( ptEsmc + 1 )) + lSerNum;
    												// 指定個別部のアドレス取得
	/*****	障害対応（TBCA0027）	 End								修正日：2003.05.09	*****/

    iShmId = ptIndAdr->lShmId;						// 共有メモリID取得

    if( D_SHMID_NONE == iShmId )					// 共有メモリが未確保の時
    {
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEENMAP ) );

		os_trcget2(D_MD_OSDTSHM,D_T_ERR_SYS,1,OSEENMAP);
		return( OSEENMAP );							// OSEENMAPを返却
	}


	/********************************************************************************************/
	/* 本処理                                                                                   */
	/********************************************************************************************/

	/*****	仕様変更（SSLA0025）	Start								修正日：2003.05.02	*****/
	/********************************************************************************************/
	/*	共有メモリの無効化の処理を削除															*/
	/********************************************************************************************/
	/*****	仕様変更（SSLA0025）	 End								修正日：2003.05.02	*****/

	/********** 20030122 修正		Start		**********/
	ptIndAdr->lAttach--;							// 利用状況デクリメント

	/*****	仕様変更（SSLA0025）	Start								修正日：2003.05.02	*****/
//	if(0 >= ptIndAdr->lAttach)						// クリアはlAttachが０の時のみ
//	{
//		ptIndAdr->lShmId = D_SHMID_NONE;			// 共有メモリIDクリア
//		ptIndAdr->lShmSize = 0;						// 共有メモリサイズクリア
//		ptIndAdr->lAttach = 0;						// 利用状況クリア
//	}
	/*****	仕様変更（SSLA0025）	 End								修正日：2003.05.02	*****/

	DbgMsg01( DLv04, ( OutPut, "***** %s: ptIndAdr->lAttach:%ld\n",
				D_PROC_NAME, ptIndAdr->lAttach ) );
	/********** 20030122 修正		 End		**********/


	/********************************************************************************************/
	/* 終了処理                                                                                 */
	/********************************************************************************************/
    os_trcget2(D_MD_OSDTSHM,D_T_TRA_OUT,1,NORMAL);
	return( NORMAL );								// NORMALを返却
}
/************************************************************************************************/
/* End                                                                                          */
/************************************************************************************************/
