/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 イベント制御												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 イベントの通知												*/
/* ＜モジュールＩＤ＞				 osevent													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 サプライ　藤里												*/
/* ＜ソース正年月日及び修正ＩＤ＞    ２００３年　５月２２日		故障管理番号（ＴＢＣＳ００９８）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		メイルボックス管理テーブル（EMBC）より指定された値に対応するメッセージキューIDを取得し、*/
/*		msgsndにメッセージキューIDを設定してメッセージの送信を行う。							*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<osevent_ins.h>																*/
/*																								*/
/*   	long osevent( long pid, long evn, long count )                                          */
/*																								*/
/* ＜仮引数＞																					*/
/*     long pid            プロセス識別子                                                       */
/*     long evn            イベント番号(0〜1024)                                                */
/*     long count          加算値（未使用：0を指定）                                            */
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		OSEEIEVN			イベント番号の値が不当である。						*/
/*						OSEENEXS			プロセス識別子で指定したプロセスが存在しない。		*/
/*						OSEEWKEX			システム作業域が確保できない。						*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/types.h>
#include <sys/msg.h>
#include <sys/ipc.h>
#include <sys/time.h>
#include <errno.h>
#include <time.h>

/*****************************  利用者作成ヘッダ・ファイル  *************************************/
#include "osevent.h"
#include "osevent_ins.h"                          // 内部参照用（個別）

/*************************************************************************************************/
/* 機能：イベントの通知                                                                          */
/* 作成日：2002年8月30日                                                                         */
/* 変更日：                                                                                      */
/* 作成者：江川                                                                                  */
/* 呼出形式：                                                                                    */
/*   long osevent( long pid, long evn, long count )                                              */
/*     long pid            プロセス識別子                                                        */
/*     long evn            イベント番号(0〜1024)                                                 */
/*     long count          加算値（未使用：0を指定）                                             */
/*                                                                                               */
/*************************************************************************************************/
long osevent( long pid, long evn, long count )
{
	/********************************************************************************************/
	/*	変数定義																				*/
	/********************************************************************************************/
    int  iGetTmDay = 0;                             // gettimeofday返却値
    int  iMsgSnd = 0;                               // msgsnd返却値
    int  iMsgQIdFlg = 0;                            // MsgQId存在チェック
    long lMsgQId = 0;                               // メッセージキューID
    int  iMsgCnt = 0;
    
    TEmbcTableInd *ptEmbcInd = NULL;                // EMBC個別部ポインタ
    TEmbcTableInd *ptEmbcIndTemp = NULL;            // 作業用EMBC個別部ポインタ

    struct msgbuf  tSndMsg;                         // 送信バッファ設定情報
    struct timeval tTmVal;                          // 取得時間設定情報


	/********************************************************************************************/
	/*	初期処理																				*/
	/********************************************************************************************/
	os_trcget2( D_MD_OSEVENT, D_T_TRA_IN, 3, pid, evn, count );


//	DbgMsg01( DLv02, ( OutPut, "***** Start osevent\n"));
//	DbgMsg01( DLv04, ( OutPut, "***** pid : %lx\n", pid));
//	DbgMsg01( DLv04, ( OutPut, "***** evn : %ld\n", evn));

	/************************************************/
    /*	引数チェック								*/
	/************************************************/
													// イベント番号が０より小さい、又は
													// イベント番号が１０２４を超過する場合
    if(( D_VALUE_MIN > evn ) || ( D_VALUE_MAX < evn ))
    {
		DbgMsg01( DLv05, ( OutPut, "***** 01: Parameter Err env\n"));
		
		os_trcget2( D_MD_OSEVENT, D_T_ERR_PRA, 1, OSEEIEVN );
		
        return( OSEEIEVN );							// 異常終了
    }


	/********************************************************************************************/
	/*	本処理																					*/
	/********************************************************************************************/
	/************************************************/
	/*	メイルボックス管理テーブル個別部を検索し、	*/
	/*	当該プロセスのメッセージキューＩＤを取得	*/
	/************************************************/
	iMsgQIdFlg = D_MSGQ_NOEXIST;					// MsgQId存在チェックフラグの初期化
													// メイルボックス管理テーブル個別部の
	ptEmbcInd = (TEmbcTableInd *)(ptEmbc + 1);		// 先頭アドレスを取得
    
    DbgMsg01( DLv04, ( OutPut, "***** ptEmbcInd  : %lx\n", ptEmbcInd));

/*****	障害対応（TBCS0098）Start										修正日：2003.05.22	*****/
/************************************************************************************************/
/*	D_MBTBL_UTMAX → ptEmbc->lIndPartNum に修正													*/
/************************************************************************************************/
//	for( iMsgCnt = D_MBTBL_UTMIN; iMsgCnt <= D_MBTBL_UTMAX ; iMsgCnt++ )
	for( iMsgCnt = D_MBTBL_UTMIN; iMsgCnt < ptEmbc->lIndPartNum; iMsgCnt++ )
/*****	障害対応（TBCS0098） End										修正日：2003.05.22	*****/
	{
		ptEmbcIndTemp = ptEmbcInd + iMsgCnt;		// 作業用メイルボックス管理テーブル個別部の
													// ポインタを設定

		if(pid == ptEmbcIndTemp->lPCode)			// （引数の）プロセス識別子とメイルボックス管理
		{											// テーブル個別部のプロセス識別子が一致した場合

			lMsgQId = ptEmbcIndTemp->lMsgQId;		// 変数にメッセージキューＩＤを設定
			iMsgQIdFlg = D_MSGQ_EXIST;				// MsgQId存在チェックフラグに「あり」を設定
/*****	障害対応（TBCS0098）Start										修正日：2003.05.22	*****/
/************************************************************************************************/
/*	break文を追加																				*/
/************************************************************************************************/
			break;									// ループを抜ける
/*****	障害対応（TBCS0098） End										修正日：2003.05.22	*****/
		}
	}
	if( D_MSGQ_NOEXIST == iMsgQIdFlg )				// MsgQId存在チェックフラグが「なし」の場合
	{
		DbgMsg01( DLv05, ( OutPut, "***** 02:Err\n") );

		os_trcget2( D_MD_OSEVENT, D_T_ERR_SYS, 1, OSEENEXS );

        return( OSEENEXS );							// 異常終了
    }
    DbgMsg01( DLv04, ( OutPut, "***** lMsgQId:%lx\n", lMsgQId));

	/************************************************/
    /*	メッセージの送信データを編集				*/
	/************************************************/
    tSndMsg.mtype = D_EVENT_MSGTYPE + evn;          // メッセージタイプの設定
    DbgMsg01( DLv04, ( OutPut, "***** tSndMsg.mtype : %ld\n", tSndMsg.mtype));

    do{
                                                    // 時間を取得
		os_trcget2( D_MD_OSEVENT, D_T_SYS_GETTIMEOFDAY, 2, &tTmVal, D_VALUE_TZONE );
        iGetTmDay = gettimeofday( &tTmVal, D_VALUE_TZONE );
		os_trcget2( D_MD_OSEVENT, D_T_SYS_END, 1, iGetTmDay );
        											// 異常終了の場合
        if( D_ERR_GETTMDAY == iGetTmDay && EINTR != errno )
        {
			DbgMsg01( DLv05, ( OutPut, "***** 03:Err\n") );
            goto err_osevent;						// エラー処理へ
        }
    } while( D_ERR_GETTMDAY == iGetTmDay );
    
//	sprintf( tSndMsg.mtext, "%ld", tTmVal.tv_sec);
												    // 20030330 修正
	sprintf( tSndMsg.mtext, "%08lx", tTmVal.tv_sec);// 取得時間（秒）を文字列に変換して設定
	DbgMsg01( DLv05, ( OutPut, "***** tSndMsg.mtext :%s\n", tSndMsg.mtext));

	/************************************************/
    /*	メッセージの送信							*/
	/************************************************/
    do{                                             // メッセージの送信
//		os_trcget2( D_MD_OSEVENT, D_T_SYS_MSGSND, 4, lMsgQId, &tSndMsg, 
//								sizeof(tSndMsg.mtext[D_AREA_SIZE]), IPC_NOWAIT );
//		iMsgSnd = msgsnd( lMsgQId, &tSndMsg, sizeof(tSndMsg.mtext[D_AREA_SIZE]), IPC_NOWAIT );
													// 20030330 修正
		os_trcget2( D_MD_OSEVENT, D_T_SYS_MSGSND, 4, lMsgQId, &tSndMsg, sizeof(long), IPC_NOWAIT );
		iMsgSnd = msgsnd( lMsgQId, &tSndMsg, sizeof(long), IPC_NOWAIT );
		os_trcget2( D_MD_OSEVENT, D_T_SYS_END, 1, iMsgSnd );
        
        if( D_ERR_MSGSND == iMsgSnd )				// 異常終了の場合
        {
			DbgMsg01( DLv05, ( OutPut, "***** 04:msgsnd Err Mess :%s\n", strerror(errno) ) );
            goto err_osevent;						// エラー処理へ
        }
    } while( D_ERR_MSGSND == iMsgSnd );

//	DbgMsg01( DLv04, ( OutPut, "***** End osevent\n"));
	
	os_trcget2( D_MD_OSEVENT, D_T_TRA_OUT, 1, NORMAL );
	
    return( NORMAL );								// 正常終了


	/********************************************************************************************/
	/*	異常処理																				*/
	/********************************************************************************************/
err_osevent:

    switch( errno ){
         case EINVAL: 
         		DbgMsg01( DLv05, ( OutPut, "***** Err OSEENEXS\n"));
         		
        	  os_trcget2( D_MD_OSEVENT, D_T_ERR_SYS, 1, OSEENEXS );	
              return( OSEENEXS ); 
              break;
         case EIDRM:
         case ENOMEM: 
         		DbgMsg01( DLv05, ( OutPut, "***** Err OSEEWKEX\n"));
         		
         	  os_trcget2( D_MD_OSEVENT, D_T_ERR_SYS, 1, OSEEWKEX );	
              return( OSEEWKEX ); 
              break;
         default: 
              os_trcget2( D_MD_OSEVENT, D_T_ERR_ABT, 0 );
         			
              os_treterm(os_EndCod(D_END_TYPE1), (D_MD_OSEVENT << 16) | D_T_ERR_SYS );
    }

}

/************************************************************************************************/
/* End                                                                                          */
/************************************************************************************************/
