/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 操作管理													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 メッセージの制御											*/
/* ＜モジュールＩＤ＞				 osioctl1													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０８月１１日     故障管理番号（ＴＢＣＳ０２７３）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/*																								*/
/*		ログメッセージ送信先の特定プロセスの登録処理を行う。									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<osimsio.h>																	*/
/*																								*/
/*		long	osioctl1( long fildes, long request, long *arg, long argsiz )					*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long		fildes				ファイル記述子(内部では未使用）							*/
/*		long		request				制御種別												*/
/*		long		*arg				制御値													*/
/*		long		argsiz				制御値サイズ（4：固定）									*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		OSIMSEPID		illegal PID												*/
/*						OSIMSEARGP		invalid argument parameter								*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include	"osimsio.h"								// 
#include	"osioctl1_ins.h"						// 内部参照用（個別）

//#include	"osioctl1.h"							// osimsio.h へ組み込み

/****************************************************************************/
/*																			*/
/*  ＜関数名＞	  osioctl1													*/
/*																			*/
/*  ＜機能概要＞  ログメッセージの送信先の特定プロセスの登録処理			*/
/*																			*/
/****************************************************************************/
long osioctl1( long fildes, long request, long *arg, long argsiz )
{
/****************************************************************************/
/* 初期処理																	*/
/****************************************************************************/

//    DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
    
   	os_trcget2( D_MD_OSIOCTL1, D_T_TRA_IN, 4, fildes, request, arg, argsiz );

	if( OSIMSPRS != request )					// 制御種別チェック
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSIMSEPID ) );
		
		os_trcget2( D_MD_OSIOCTL1, D_T_ERR_PRA, 1, OSIMSEPID );
		
		return( OSIMSEPID );					// illegal PID
	}

    if( NULL ==  arg )							// 制御値引数NULLチェック
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSIMSEPID ) );
		
		os_trcget2( D_MD_OSIOCTL1, D_T_ERR_PRA , 1, OSIMSEPID );
		
		return( OSIMSEPID );
	}

    if( D_RESERVED_PID_CODE != ( D_CHECK_PID_MASK & *arg ))		// プロセス起動種別チェック
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSIMSEPID ) );
		
		os_trcget2( D_MD_OSIOCTL1, D_T_ERR_PRA , 1, OSIMSEPID );
		
		return( OSIMSEPID );
	}

    if( D_OSIOCTL1_ARGSIZ != argsiz )			// サイズチェック(4固定)
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSIMSEARGP ) );
		
		os_trcget2( D_MD_OSIOCTL1, D_T_ERR_PRA, 1, OSIMSEARGP );
		
		return( OSIMSEARGP );					// invalid argument parameter
	}

/****************************************************************************/
/* 本処理																	*/
/****************************************************************************/
	ptEmmc->lPCode = *arg ;						// 送信先の特定プロセス識別子設定

	os_trcget2( D_MD_OSIOCTL1, D_T_TRA_OUT, 1, NORMAL );

	return( NORMAL );							// 正常終了コードを返却する

}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
