/****************************************************************************/
/*  著作権  ２００２                                                        */
/*            株式会社ＮＴＴデータ                                          */
/*              金融ビジネス事業本部                                        */
/*                                                                          */
/*                                                                          */
/*  収容物  ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ              */
/****************************************************************************/
/* ＜対象業務名＞                  ＴＲＡＤＥエミュレータ                   */
/* ＜対象業務ＩＤ＞                ＴＲＥ                                   */
/* ＜サービス項目名＞              データ操作                               */
/* ＜サービス項目ＩＤ＞            ＸＸＸＸＸＸＸ                           */
/* ＜モジュール名＞                非完了型 ファイルへの直接書き込み        */
/* ＜モジュールＩＤ＞              osiwritd                                 */
/* ＜モジュール通番＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜適用機種名＞                  汎用サーバ                               */
/* ＜適用ＯＳ＞                    Ｌｉｎｕｘ                               */
/* ＜開発環境＞                    ＲＨＡＳ２．１                           */
/* ＜記述言語＞                    Ｃ言語                                   */
/* ＜モジュール形態＞              関数                                     */
/* ＜機能区分＞                                                             */
/* ＜対象データ＞                                                           */
/* ＜工程・階層区分＞                                                       */
/*--------------------------------------------------------------------------*/
/* ＜開発システム名＞              ＬＡＬａ−ＳＭＰシステム                 */
/* ＜開発システム番号＞            ＰＰ４０Ｂ００１２２０                   */
/*--------------------------------------------------------------------------*/
/* ＜開発担当名＞                  ＣＢ事ビジネス企画担当(メ−カ：サプライ) */
/* ＜電話番号＞                    148-1457(03-5437-1457)                   */
/*--------------------------------------------------------------------------*/
/* ＜設計者名＞                    ＣＢ事ビジネス企画担当                   */
/* ＜設計年月日＞                  ２００２年　９月２７日                   */
/* ＜設計修正者名＞                                                         */
/* ＜設計修正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜ソース作成者＞                ＣＢ事ビジネス企画担当(メ−カ:ＸＸＸＸ)  */
/* ＜ソース作成年月日＞            ２００２年　１１月０１日                 */
/* ＜ソース修正者＞                                                         */
/* ＜ソース正年月日及び修正ＩＤ＞                                           */
/*--------------------------------------------------------------------------*/
/* ＜見積ステップ数＞              ステップ                                 */
/*--------------------------------------------------------------------------*/
/* ＜機能概要＞                                                             */
/*   データ直接書込み (非完了型)                                            */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜呼出形式＞                                                             */
/*      long osiwritd( long rd, long fildes, char *buf,                     */
/*                                           long len, long pos )           */
/*                                                                          */
/* ＜仮引数＞                                                               */
/*      long        rd                  要求識別子(-1)                      */
/*      long        fildes              ファイル記述子                      */
/*                                      「0 < ファイル記述子 <=             */
/*                                              ファイル管理テーブルの      */
/*                                                         管理部個別部数」 */
/*      char        *buf                データ格納バッファ                  */
/*      long        len                 書込みレコード数(１以上)            */
/*      long        pos                 書込み位置(１以上)                  */
/*                                                                          */
/* ＜返却値＞                                                               */
/*     書込んだデータのバイト数                                             */
/*                                                                          */
/*--------------------------------------------------------------------------*/
/* ＜入出力データ構造＞                                                     */
/* ＜制限事項＞                                                             */
/*     特になし                                                             */
/* ＜使用外部モジュールＩＤ＞                                               */
/* ＜呼出元のモジュールＩＤ＞                                               */
/*                                                                          */
/*                                                                          */
/****************************************************************************/
/******************************** 標準ヘッダ・ファイル **********************/
#include <errno.h>                      // エラーＮｏ取得用
#include <stdio.h>                      // 

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "osiwritd.h"
#include "osiwritd_ins.h"               // 内部参照用（個別）
#include "oswritd.h"                    // oswritd用

/****************************************************************************/
/*                                                                          */
/*  ＜関数名＞    osiwritd                                                  */
/*                                                                          */
/*  ＜機能概要＞  データ直接書込み (非完了型)                               */
/*                                                                          */
/****************************************************************************/
long osiwritd( long rd, long fildes, char *buf, long len, long pos )
{
    long lCommonRet;                    // 共通関数リターン値


//	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
	os_trcget2( D_MD_OSIWRITD, D_T_TRA_IN, 5, rd, fildes, buf, len, pos );


/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
    if( rd != D_RD )                    // 要求識別子のチェック
    {
        DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSFEIVRD ) );
		os_trcget2( D_MD_OSIWRITD, D_T_ERR_PRA, 1, OSFEIVRD );
        return( OSFEIVRD );
    }


/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
                                        // ファイル直接書込み
    lCommonRet = oswritd( fildes, buf, len, pos ); 


	os_trcget2( D_MD_OSIWRITD, D_T_TRA_OUT, 1, lCommonRet );
//    DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );

    return( lCommonRet );               // oswritdの返却値

}
/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
