/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 リザルト・例外												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 リクエスト識別子の予約解除									*/
/* ＜モジュールＩＤ＞				 osrelrd													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*      リクエスト識別子の予約解除                                                              */
/*      予約されているリクエスト識別子を指定個数分解除する。                                    */
/*      なお、複数個の予約を取り消す場合には、対象となるリクエスト識別子は、                    */
/*      連続していなければならない。                                                            */
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<oscreat.h>																	*/
/*																								*/
/*        long	osrelrd(rd, no)                                                                 */
/*																								*/
/* ＜仮引数＞																					*/
/*      long    rd                                                                              */
/*      long    no                                                                              */
/*																								*/
/* ＜返却値＞																					*/
/*      NORMAL      ：正常に予約を取り消した                                                    */
/*      OSEEIVNO	：個数が正の値でない、又は値が大きすぎる                                    */
/*      OSEEIVRD    ：リクエスト識別子の値が不当である                                          */
/*      OSEENRSV    ：指定範囲のリクエスト識別子のうち予約されていないものがある                */
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/************************************************************************************************/
/*  インクルードファイル                                                                        */
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/


/***************************** 利用者作成ヘッダ・ファイル ***************************************/
#include	"osrelrd.h"
#include	"osrelrd_ins.h"


long	osrelrd(rd, no)
long	rd;											/* リクエスト識別子							*/
long	no;											/* 個数										*/
{
	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	long			lCnt1;							/* ループカウンタ1							*/
	long			lCnt2;							/* ループカウンタ2							*/
	long			lCnt3;							/* ループカウンタ3							*/
	long			lRet;							/* 返却値									*/
	TErdcTableInd	*ptErdcp = NULL;				/* ｒｄ管理テーブル個別部ポインタ			*/


	os_trcget2(  D_MD_OSRELRD, D_T_TRA_IN, 2, rd, no );
	
													/* 関数入口									*/
//	DbgMsg01( DLv02, ( OutPut, "\n***** %s:Start DbgSubFnc\n", "osrelrd" ) );

	/********************************************************************************************/
	/*  初期処理                                                                                */
	/********************************************************************************************/
	lCnt1 = 0;
	lCnt2 = 0;
	lCnt3 = 0;
	lRet  = 0;


	ptErdcp = (TErdcTableInd *)(ptErdc + 1);		/* ｒｄ管理個別部の先頭アドレス設定			*/

//	DbgMsg01(DLv04, (OutPut, "\n***** %s:%s rd=%08x, no=%#d \n ", "osrelrd",
//			"パラメータ", rd, no));


	/************************************************/
	/*  引数チェック								*/
	/************************************************/
	/****************************************/
	/* リクエスト識別子（rd）のチェック		*/
	/****************************************/
													/* ループ処理								*/
//2003.02.19	for(lCnt1 = 0; lCnt1 < ptErdc->lMaxIndNumpt; lCnt1++)
	for(lCnt1 = 0; lCnt1 < ptMyEPRC->lMaxReqNum; lCnt1++)
	{
		if (rd == ptErdcp->lRCode)					/* リクエスト識別子が一致した場合			*/
		{
			break;									/* ループを抜ける							*/
		}

//		DbgMsg01(DLv04, (OutPut, "\n***** %s:Roop Count=%#d 回目  ", "osrelrd", (lCnt1+1)));
//		DbgMsg01(DLv04, (OutPut, "ptErdcp=%08x, lRCode=%08x \n", ptErdcp, ptErdcp->lRCode));

		ptErdcp++;									/* 次アドレスへポインタを進める				*/
	}


//2003.02.19	if (lCnt1 >= ptErdc->lMaxIndNumpt)				/* ｒｄ管理テーブル個別部の最大値を超過		*/
	if (lCnt1 >= ptMyEPRC->lMaxReqNum)				/* ｒｄ管理テーブル個別部の最大値を超過		*/
	{												/* ｒｄ管理テーブルの個別部が存在しない場合 */
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  %s \n", "osrelrd",
			"処理異常!!", "該当するｒｄ管理テーブルの個別部はありません。"));
			
		os_trcget2(  D_MD_OSRELRD, D_T_ERR_PRA, 1, OSEEIVRD );
			
		return(OSEEIVRD);							/* 異常終了（invalid req descriptor）		*/
	}


	/****************************************/
	/* 個数（no）のチェック					*/
	/****************************************/
//2003.02.19	if ((0 >= no) || (ptErdc->lMaxIndNum < no))		/* 0以下、又はrd管理テーブル個別部数の		*/
	if ((0 >= no) || (ptMyEPRC->lMaxReqNum < no))		/* 0以下、又はrd管理テーブル個別部数の		*/
	{												/* 最大値を超過した場合						*/
		DbgMsg01(DLv05, (OutPut, "***** %s:%s  %s  no=%#d\n", "osrelrd",
			"処理異常!!", "指定された個数が「0」以下、又は値が大きすぎる。", no));
			
		os_trcget2(  D_MD_OSRELRD, D_T_ERR_PRA, 1, OSEEIVNO );	

		return(OSEEIVNO);							/* 異常終了（invalid number）				*/
	}

	DbgMsg01(DLv04, (OutPut, "\n***** %s:Roop1 Count=%#d 回目  ", "osrelrd", lCnt1));
	DbgMsg01(DLv04, (OutPut, "ptErdcp=%08x \n", ptErdcp));


    /********************************************************************************************/
    /*  メイン処理                                                                              */
    /********************************************************************************************/
	/****************************************/
	/*  リクエスト状態の予約状態チェック	*/
	/****************************************/
	for (lCnt2 = 0; lCnt2 < no; lCnt2++)
	{
		DbgMsg01(DLv04, (OutPut, "\n***** %s:Roop2 Count=%#d 回目  ", "osrelrd", lCnt3));
		DbgMsg01(DLv04, (OutPut, "cResStat=%02x \n", (ptErdcp + lCnt3)->tReqStat.cResStat));

													/* リクエスト状態の予約状態が				*/
													/* 				予約済(0x01)以外の場合		*/
		if (D_ERDC_RESSTAT_RES != (ptErdcp + lCnt2)->tReqStat.cResStat)
		{
			DbgMsg01(DLv05, (OutPut, "***** %s:%s  %s  no=%#d\n", "osrelrd", "処理異常!!",
					"指定範囲のリクエスト識別子のうち、予約されていないのものがある。", no));
					
			os_trcget2(  D_MD_OSRELRD, D_T_ERR_PRA, 1, OSEENRSV );	
					
			return(OSEENRSV);						/* 異常終了（used）							*/
		}
	}


	/****************************************************/
	/*  リクエスト状態の予約状態を未予約(0x00)に設定	*/
	/*  また、非完了要求状態により使用状態も更新		*/
	/****************************************************/
	for (lCnt3 = 0; lCnt3 < no; lCnt3++)
	{
		DbgMsg01(DLv04, (OutPut, "\n***** %s:Roop3 Count=%#d 回目  ", "osrelrd", lCnt3));
		DbgMsg01(DLv04, (OutPut, "cResStat=%02x \n", (ptErdcp + lCnt3)->tReqStat.cResStat));
		DbgMsg01(DLv04, (OutPut, "cUCompStat=%02x \n", (ptErdcp + lCnt3)->tReqStat.cUCompStat));

													/* リクエスト状態の予約状態を				*/
													/* 				未予約(0x00)に設定			*/
		(ptErdcp + lCnt3)->tReqStat.cResStat = D_ERDC_RESSTAT_NONE;

													/* リクエスト状態の非完了要求状態が			*/
													/* 				予約済(0x01)の場合			*/
		if (D_ERDC_UCOMPSTAT_REQ == (ptErdcp + lCnt3)->tReqStat.cUCompStat)
		{
													/* リクエスト状態の使用状態を				*/
													/* 				使用中(0x01)に設定			*/
			(ptErdcp + lCnt3)->tReqStat.cUseStat = D_ERDC_USESTAT_USE;
		}
	}


    /********************************************************************************************/
    /*  終了処理                                                                                */
    /********************************************************************************************/
													/* 関数出口									*/
//	DbgMsg01( DLv02, ( OutPut, "\n***** %s: End  DbgSubFnc\n", "osrelrd" ) );
	
	os_trcget2(  D_MD_OSRELRD, D_T_TRA_OUT, 1, NORMAL );

	return (NORMAL);								/* 正常終了									*/
}


/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/
