/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 イベント制御												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 セマフォへの信号送出										*/
/* ＜モジュールＩＤ＞				 ossigsp													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* ＜ソース修正者＞ 			 	 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０７月２２日		故障管理番号（ＴＢＣＳ０２３４）*/
/* ＜ソース修正者＞                  ＣＢ事ビジネス企画担当(メーカー：サプライ新保)             */
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０８月１１日     故障管理番号（ＴＢＣＳ０２７６）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 セマフォへの信号送信  																		*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<ossigsp.h>																	*/
/*																								*/
/*	   	long	ossigsp( long spid, long count )												*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	spid;		セマフォ識別子（0以外の正値）										*/
/*		long	count;		加算値（0x0000〜0x7ffff）											*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了	NORMAL																		*/
/*		異常終了	OSEEISPI																	*/
/*					OSEEICNT																	*/
/*					OSEENEXS																	*/
/*					OSEEWKEX																	*/
/*					OSEEDELD																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/sem.h>
#include <errno.h>
/*****************************  利用者作成ヘッダ・ファイル  *************************************/
#include "ossigsp.h"
#include "ossigsp_ins.h"                          // 内部参照用（個別）

/**************************************************************************************************/
/* 機能：セマフォへの信号送信                                                                     */
/* 作成日：2002年8月14日                                                                          */
/* 変更日：                                                                                       */
/* 作成者：江川                                                                                   */
/* 呼出形式：                                                                                     */
/*   long ossigsp( long spid, long count )                                                        */
/*     long spid           セマフォ識別子（0x000a0000〜0x000affff又は0x00030000〜0x0003ffff）     */
/*     long count          加算値（0x0000〜0x7ffff）                                              */
/*                                                                                                */
/**************************************************************************************************/
long ossigsp( long spid, long count )
{
    /********************************************************************************************/
	/*	変数定義																				*/
	/********************************************************************************************/
    int   iSemId;                                 // セマフォID
    int   iSemOp;                                 // semopの返却値
    char  acSemKey[9];                            // セマフォ用
    long  lSemKey = 0;                            // ntok用
    
	/********************************************************************************************/
	/*	初期処理																				*/
	/********************************************************************************************/
	os_trcget2( D_MD_OSSIGSP, D_T_TRA_IN, 2, spid, count );

//	DbgMsg01( DLv02, ( OutPut, "***** Start ossigsp\n") );
//	DbgMsg01( DLv04, ( OutPut, "***** spid:%08x\n", spid) );
//	DbgMsg01( DLv04, ( OutPut, "***** count :%x\n", count) );
    //********************************************
    //***** 引数チェック
    //*****
    //if( D_OS_SPIDMIN >= spid )                  // 20021218 修正
    if( (0x03 != (spid >> 16)) && (0x0a != (spid >> 16)) )
    {                                             // セマフォ識別子
    	DbgMsg01( DLv05, ( OutPut, "***** 01:Err OSEEISPI\n") );
    	
   		os_trcget2( D_MD_OSSIGSP, D_T_ERR_PRA, 1, OSEEISPI );
    	
        return( OSEEISPI );
    }

    if(( D_OS_ADDMIN > count ) || ( D_OS_ADDMAX < count ))
    {                                             // 加算値
    	DbgMsg01( DLv05, ( OutPut, "***** 02:Err OSEEICNT\n") );
    	
    	os_trcget2( D_MD_OSSIGSP, D_T_ERR_PRA, 1, OSEEICNT );
    	
        return( OSEEICNT );
    }

    /********************************************************************************************/
	/*	本処理																					*/
	/********************************************************************************************/
    //********************************************
    //***** セマフォIDの取得
    //*****
    /*------2002/12/18 追加 ---------------------*/
    sprintf(acSemKey, "%08lx", spid);
    lSemKey = BlpMpf_ntok(acSemKey,D_NTOK_ID);
    /*-------------------------------------------*/
    do{
        //iSemId = semget( spid, D_SEM_SIZE, IPC_EXCL ); // 20021218 修正
		os_trcget2( D_MD_OSSIGSP, D_T_SYS_SEMGET, 3, lSemKey, D_SEM_SIZE, IPC_EXCL );
        iSemId = semget( lSemKey, D_SEM_SIZE, IPC_EXCL );
		os_trcget2( D_MD_OSSIGSP, D_T_SYS_END, 1, iSemId );
        
        if( D_ERR_SEMGET == iSemId && EINTR != errno )
        {
			DbgMsg01( DLv05, ( OutPut, "***** 03:semget Err:%s\n", strerror(errno) ) );
			DbgMsg01( DLv05, ( OutPut, "***** Err semget iSemId:%08x\n", iSemId) );
            goto err_ossigsp;
        }
        DbgMsg01( DLv04, ( OutPut, "***** Semget ループ iSemId:%08x\n", iSemId) );
    } while( D_ERR_SEMGET == iSemId );
    DbgMsg01( DLv04, ( OutPut, "***** semget iSemId:%08x\n") );

    //********************************************
    //***** セマフォ値の加算
    //*****
    tSemBuf.sem_num = D_SEM_NUM;                  // セマフォ配列の要素番号設定
    tSemBuf.sem_op = count;                       // セマフォの加算値設定
/*****	故障管理番号TBCS0234の対応		Start							修正日：2003.07.22	*****/
/************************************************************************************************/
/*	sem_flgの設定を「SEM_UNDO」に変更															*/
/************************************************************************************************/
	tSemBuf.sem_flg = SEM_UNDO;					  // セマフォの操作フラグ設定
/*****	故障管理番号TBCS0234の対応		 End							修正日：2003.07.22	*****/

      
    os_trcget2( D_MD_OSSIGSP, D_T_SYS_SEMOP, 3, iSemId, &tSemBuf, D_SEM_SIZE );
    
    iSemOp = semop( iSemId, &tSemBuf, D_SEM_SIZE );
    
    os_trcget2( D_MD_OSSIGSP, D_T_SYS_END, 1, iSemOp );
    
    if( D_ERR_SEMOP == iSemOp )
    {
		DbgMsg01( DLv05, ( OutPut, "***** 04:semop Err:%s\n", strerror(errno) ) );
		DbgMsg01( DLv05, ( OutPut, "***** Err semop iSemCtl:%08x\n", iSemOp) );
		
        goto err_ossigsp;
    }
    DbgMsg01( DLv04, ( OutPut, "***** semop iSemCtl:%08x\n", iSemOp) );

//	DbgMsg01( DLv02, ( OutPut, "***** End ossigsp\n") );
	
	os_trcget2( D_MD_OSSIGSP, D_T_TRA_OUT, 1, NORMAL );
	
    return( NORMAL );

//************************************************
//***** 異常処理
//*****
err_ossigsp:

    switch( errno ){
    case ENOENT:
    DbgMsg01( DLv05, ( OutPut, "***** 05: Err ENOENT\n") );
    os_trcget2( D_MD_OSSIGSP, D_T_ERR_SYS, 1, errno    );
    return( OSEENEXS ); 
    break;
    
    case ENOMEM:
    DbgMsg01( DLv05, ( OutPut, "***** 06: Err ENOMEM\n") );
    case ENOSPC:
    DbgMsg01( DLv05, ( OutPut, "***** 07: Err ENOSPC\n") );
    case ERANGE:
    DbgMsg01( DLv05, ( OutPut, "***** 08: Err ERANGE\n") );
    os_trcget2( D_MD_OSSIGSP, D_T_ERR_SYS, 1, errno    );
    return( OSEEWKEX ); 
    break;
    
    case EIDRM :
    DbgMsg01( DLv05, ( OutPut, "***** 09: Err EIDRM\n") );
    os_trcget2( D_MD_OSSIGSP, D_T_ERR_SYS, 1, errno    );
    return( OSEEDELD ); 
    break;
    
    case EINVAL:
    DbgMsg01( DLv05, ( OutPut, "***** 10: Err EINVAL\n") );
    os_trcget2( D_MD_OSSIGSP, D_T_ERR_SYS, 1, errno    );
    return( OSEEISPI ); 
    break;
    
    default:
    DbgMsg01( DLv05, ( OutPut, "***** 11: Err ABORT\n") );
    os_trcget2( D_MD_OSSIGSP, D_T_ERR_ABT, 1, errno );
    os_treterm(os_EndCod(D_END_TYPE1), (D_MD_OSSIGSP << 16) | D_T_ERR_SYS );
    }

}
/**************************************************************************************************/
/* End                                                                                            */
/**************************************************************************************************/
