/************************************************************************************************/
/*  著作権  ２００２                                                                            */
/*            株式会社ＮＴＴデータ                                                              */
/*              金融ビジネス事業本部                                                            */
/*                                                                                              */
/*                                                                                              */
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞               タイマ制御                                                  */
/* ＜サービス項目ＩＤ＞             ＸＸＸＸＸＸＸ                                              */
/* ＜モジュール名＞                 インターバルタイマカウント値の取得                          */
/* ＜モジュールＩＤ＞               ossnstm                                                     */
/* ＜モジュール通番＞                                                                           */
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞                   汎用サーバ                                                  */
/* ＜適用ＯＳ＞                     Ｌｉｎｕｘ                                                  */
/* ＜開発環境＞                     ＲＨＡＳ２．１                                              */
/* ＜記述言語＞                     Ｃ言語                                                      */
/* ＜モジュール形態＞               関数                                                        */
/* ＜機能区分＞                                                                                 */
/* ＜対象データ＞                                                                               */
/* ＜工程・階層区分＞                                                                           */
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞                      148-1457(03-5437-1457)                                     */
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞                      ＣＢ事ビジネス企画担当                                     */
/* ＜設計年月日＞                    ２００２年  ９月２７日                                     */
/* ＜設計修正者名＞                                                                             */
/* ＜設計修正年月日及び修正ＩＤ＞                                                               */
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞                  ＣＢ事ビジネス企画担当(:ＸＸＸＸ)                          */
/* 作成者：梶原                                                                                 */
/* ＜ソース作成年月日＞              ２００２年  ９月２７日                                     */
/* 作成日：2002年9月26日                                                                        */
/* ＜ソース修正者＞                                                                             */
/* ＜ソース正年月日及び修正ＩＤ＞                                                               */
/* 変更日：2002年10月23日                                                                       */
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞                ステップ                                                   */
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞                                                                                 */
/*   インターバルタイマのカウント値の取得                                                       */
/*                                                                                              */
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞                                                                                 */
/*      #include    <ossnstm.h>                                                                 */
/*                                                                                              */
/*      long    ossnstm()                                                                       */
/*                                                                                              */
/* ＜仮引数＞                                                                                   */
/*      なし                                                                                    */
/*                                                                                              */
/* ＜返却値＞                                                                                   */
/*      正常終了        ミリ秒(10ミリ秒単位)                                                    */
/*      異常終了        OSEESETE                                                                */
/*                                                                                              */
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞                                                                         */
/* ＜制限事項＞                                                                                 */
/*     特になし                                                                                 */
/* ＜使用外部モジュールＩＤ＞                                                                   */
/* ＜呼出元のモジュールＩＤ＞                                                                   */
/*                                                                                              */
/*                                                                                              */
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <sys/time.h>
#include <errno.h>

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "ossnstm.h"
#include "ossnstm_ins.h"							// 内部参照用（個別）

/****************************************************************************/
/* 機能：インターバルタイマのカウント値の取得                               */
/* 作成日：2002年9月26日                                                    */
/* 変更日：2002年10月23日                                                   */
/* 作成者：梶原                                                             */
/* 呼出形式：                                                               */
/*   long ossnstm( void )                                                   */
/*                                                                          */
/****************************************************************************/
long ossnstm()
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	int iRet;										// 関数の結果返却
	struct timeval tNowTime;						// 時間格納体
	struct itimerval tTimer;						// インタバル時間格納体
/*****	障害対応（TBCS0065）	Start									修正日：2003.04.23	*****/
	long lMSec = 0;									// 返却値（ミリ秒）
	long lMusec = 0;								// マイクロ秒時間（ミリ秒）
	double dMsec = 0;								// 秒時間（ミリ秒）
	double dMsec1 = 0;								// 秒時間（ミリ秒）
	double dMsum = 0;								// 合計時間（ミリ秒）
	double dRetMsec = 0;							// 返却値（10ミリ秒）
	long lSSec = 0;
	long lRetTMsec = 0;
	long lMSum = 0;
/*****	障害対応（TBCS0065）	 End									修正日：2003.04.23	*****/


	os_trcget2( D_MD_OSSNSTM, D_T_TRA_IN, 0 );
//	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );


/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
/*****	障害対応（TBCS0065）	Start									修正日：2003.04.23	*****/
//	os_trcget2( D_MD_OSSNSTM, D_T_SYS_GETITIMER, 2, &tTimer, NULL );  
//	iRet = getitimer(ITIMER_REAL, &tTimer);			// インタバルタイマのカウント値を取得
	os_trcget2( D_MD_OSSNSTM, D_T_SYS_GETTIMEOFDAY, 2, &tNowTime, NULL );  
	iRet = gettimeofday(&tNowTime, NULL);			// 時間を取得
	os_trcget2( D_MD_OSSNSTM, D_T_SYS_END, 2, iRet, errno ); 

	if( D_ERR_SYS == iRet )							// 日時の取得に失敗した時
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEESETE ) );
		
		os_trcget2( D_MD_OSSNSTM, D_T_ERR_SYS, 1, OSEESETE ); 
		
		return( OSEESETE );							// OSEESETEを返却
	}

//	tNowTime = tTimer.it_value;
/*****	障害対応（TBCS0065）	 End									修正日：2003.04.23	*****/

	DbgMsg01( DLv02, ( OutPut, "***** %s:tNowTime.tv_sec :%ld\n", D_PROC_NAME, tNowTime.tv_sec ) );
	DbgMsg01( DLv02, ( OutPut, "***** %s:tNowTime.tv_usec:%ld\n", D_PROC_NAME, tNowTime.tv_usec) );

/*****	障害対応（TBCS0065）	Start									修正日：2003.04.23	*****/
													// 残り時間を10ミリ秒単位で返す
//	lMSec = (tNowTime.tv_sec * (D_MSEC_VAL/D_DOWNTIME_TEN)) +
//			 (tNowTime.tv_usec / (D_MSEC_VAL * D_DOWNTIME_TEN));

													// 時間をミリ秒単位に変換
	lSSec = tNowTime.tv_sec & 0x000FFFFF;
	lMSec = lSSec * D_MSEC_VAL;
	lMusec = tNowTime.tv_usec / D_MSEC_VAL;
	lMSum = lMSec + lMusec;

/*****	障害対応（TBCS0065）	 End									修正日：2003.04.23	*****/

	DbgMsg01( DLv02, ( OutPut, "***** %s:lMSec    :%ld \n", D_PROC_NAME, lMSec ) );
	DbgMsg01( DLv02, ( OutPut, "***** %s:lMusec   :%ld \n", D_PROC_NAME, lMusec ) );


													// マイクロ秒をミリ秒に変換
													//  (10ミリ秒未満切り捨て)
//	lMSec = ((( long )( tNowTime.tv_usec / D_MSEC_VAL / D_DOWNTIME_TEN )) * D_DOWNTIME_TEN );
//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );


/*****	障害対応（TBCS0065）	Start									修正日：2003.04.23	*****/
//	os_trcget2( D_MD_OSSNSTM, D_T_TRA_OUT, 1, lMSec );
//	return( lMSec );								// ミリ秒を返却し終了

													// 合計時間を１０ミリ秒単位に変換
	lRetTMsec = lMSum / D_DOWNTIME_TEN * D_DOWNTIME_TEN;
	DbgMsg01( DLv02, ( OutPut, "***** %s:lRetTMsec :%d \n", D_PROC_NAME, lRetTMsec ) );

	os_trcget2( D_MD_OSSNSTM, D_T_TRA_OUT, 1, lRetTMsec );
	return( lRetTMsec );
/*****	障害対応（TBCS0065）	 End									修正日：2003.04.23	*****/
}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/

