/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 バッファプール管理											*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 未使用ユニット数の取得										*/
/* ＜モジュールＩＤ＞				 ossnsfu													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ五味)				*/
/* ＜ソース作成年月日＞ 			 ２００２年１０月２３日 									*/
/* ＜ソース修正者＞ 			 	 ＣＢ事ビジネス企画担当(メーカー：サプライ新保)				*/
/* ＜ソース修正年月日及び修正ＩＤ＞  ２００３年０７月１６日  	故障管理番号（ＴＢＣＳ０１９２）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/* 		指定したバッファプール内の未使用ユニットの数を問い合わせる。							*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<ossnsfu.h>																	*/
/*																								*/
/*		long	ossnsfu( long poolid )															*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long		poolid			プール識別子												*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		未使用ユニット数														*/
/*		異常終了		OSEEIPLI			プール識別子が不当である。							*/
/*						OSEENEXS			指定バッファプールが存在しない。					*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
/*****  障害対応（TBCS0192）	Start									修正日：2003.07.16  *****/
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/sem.h>
#include <unistd.h>
#include <errno.h>
/*****  障害対応（TBCS0192）	End										修正日：2003.07.16  *****/
/*****************************  利用者作成ヘッダ・ファイル  *************************************/
#include "ossnsfu.h"
#include "ossnsfu_ins.h"				// 内部参照用（個別）

/****************************************************************************/
/* 機能：未使用ユニット数の取得                                             */
/* 作成日：2002年10月23日                                                   */
/* 変更日：                                                                 */
/* 作成者：五味                                                             */
/* 呼出形式：                                                               */
/*   long ossnsfu( long poolid )                                            */
/*     long poolid         プール識別子                                     */
/*                                                                          */
/****************************************************************************/
long ossnsfu( long poolid )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	long lRet;							// 返却値
	TEbpcTableInd *ptBpIndAdr;			// バッファプール管理テーブル個別部のアドレス
/*****  障害対応（TBCS0192）	Start									修正日：2003.07.16  *****/
	struct sembuf tSembuf;				// セマフォ構造体
/*****  障害対応（TBCS0192）	End										修正日：2003.07.16  *****/
	
	os_trcget2(D_MD_OSSNSFU,D_T_TRA_IN,1,poolid);
        
//	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );

	/************************************************/
	/*	バッファプール作成済みチェック				*/
	/************************************************/
	lRet = os_GetEbpcTableInd( poolid, (void **)&ptBpIndAdr );
										// バッファプール管理テーブルから対象個別部アドレスの取得
	if( lRet != NORMAL )				// 対象個別部のアドレスの取得に失敗した時
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, lRet ) );
        
        os_trcget2(D_MD_OSSNSFU,D_T_TRA_OUT,1,lRet);
		
		return( lRet );					// os_GetEbpcTableInd共通関数の返却値を返却
	}

	if( ptBpIndAdr->cStat != D_STAT_CREATED )
	{									// 作成状態が作成済でない時
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEENEXS ) );
        
        os_trcget2(D_MD_OSSNSFU,D_T_TRA_OUT,1,OSEENEXS);
		
		return( OSEENEXS );				// OSEENEXSを返却
	}

/*****  障害対応（TBCS0192）	Start									修正日：2003.07.16  *****/
	/************************************************/
	/*	バッファプール個別部のロック				*/
	/************************************************/
	tSembuf.sem_num	= D_SEMNUM_NONE;
	tSembuf.sem_op	= D_SEMOP_LOCK;
	tSembuf.sem_flg	= SEM_UNDO;
							
	for( ; ; )
	{
		os_trcget2( D_MD_OSSNSFU, D_T_SYS_SEMOP, 3, ptBpIndAdr->lSemId, &tSembuf, D_SEM_NSOPS );
		lRet = semop( ptBpIndAdr->lSemId, &tSembuf, D_SEM_NSOPS );
										// バッファプール個別部のロック
		os_trcget2( D_MD_OSSNSFU, D_T_SYS_END, 1, lRet );

		if( lRet == D_ERR_SYS )
		{								// ロックできなかった時
			switch( errno )
			{
				case EINTR:				// EINTRの時
					break;				// リトライ

				default:				// その他の時
					DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEWKEX ) );
					os_trcget2( D_MD_OSSNSFU,  D_T_ERR_SYS, 1, OSEEWKEX );
					return( OSEEWKEX );	// OSEEWKEXを返却
			}
		}
		else							// バッファプールアクセスのロック成功
		{
			break;						// 処理を抜ける
		}
	}

	/************************************************/
	/*	バッファプール個別部のロック解除			*/
	/************************************************/
	tSembuf.sem_num	= D_SEMNUM_NONE;
	tSembuf.sem_op	= D_SEMOP_UNLOCK;
	tSembuf.sem_flg	= SEM_UNDO;
							
	for( ; ; )
	{
		os_trcget2( D_MD_OSSNSFU, D_T_SYS_SEMOP, 3, ptBpIndAdr->lSemId, &tSembuf, D_SEM_NSOPS );
		lRet = semop( ptBpIndAdr->lSemId, &tSembuf, D_SEM_NSOPS );
										// バッファプール個別部のロック解除
		os_trcget2( D_MD_OSSNSFU, D_T_SYS_END, 2, lRet, errno );

		if( lRet == D_ERR_SYS )
		{								// ロック解除できなかった時
			switch( errno )
			{
				case EINTR:				// EINTRの時
					break;				// リトライ

				default:				// その他の時
					os_trcget2( D_MD_OSSNSFU,  D_T_ERR_SYS, 2, -1 , errno ); 

					DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, -1 ) );
					os_treterm(os_EndCod(D_END_TYPE1), (D_MD_OSSNSFU << 16) | D_T_ERR_SYS );
			}
		}
		else							// バッファプールアクセスのロック解除成功
		{
			break;						// 処理を抜ける
		}
	}
/*****  障害対応（TBCS0192）	End										修正日：2003.07.16  *****/

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/

//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
       
    os_trcget2(D_MD_OSSNSFU,D_T_TRA_OUT,1,ptBpIndAdr->lEmpUnitNum);
		
	return( ptBpIndAdr->lEmpUnitNum );	// 空きユニット数を返却
}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
