/************************************************************************************************/
/*	著作権	２００２																			*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 メッセージ通信												*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 メッセージの受信状態取得									*/
/* ＜モジュールＩＤ＞				 ossnsms													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年０９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー：サプライ)					*/
/* ＜ソース作成年月日＞ 			 ２００２年０９月２７日 									*/
/* ＜ソース修正者＞ 				 サプライ　藤里												*/
/* ＜ソース修正年月日及び修正ＩＤ＞	 ２００３年０５月１５日		故障管理番号（ＴＢＣＳ００８８）*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*		自プロセス又は、メイルボックスのメッセージ到着数を調べる。								*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<ossnsms_ins.h>																*/
/*																								*/
/* 		long	ossnsms( long mpid )															*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long		mpid		メイルボックス識別子											*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		到着しているメッセージの数												*/
/*		異常終了		OSEEIMPI			指定したメイルボックス識別子が不当である。			*/
/*						OSEENEXS			指定したメイルボックスが存在しない。				*/
/*						OSEEWKEX			システム作業域が確保できない。						*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*		特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/************************************************************************************************/
/*	インクルードファイル																		*/
/************************************************************************************************/
/************************************************************************************************/
/*								共通ヘッダ・ファイル											*/
/************************************************************************************************/
#include <string.h>
#include <stdio.h>
#include <errno.h>

/************************************************************************************************/
/*								利用者作成ヘッダ・ファイル										*/
/************************************************************************************************/
#include "ossnsms.h"
#include "ossnsms_ins.h"

/************************************************************************************************/
/*																								*/
/*	＜関数名＞	 ossnsms.c																		*/
/*																								*/
/*	＜機能概要＞ メッセージ受信状態の取得                           							*/
/*				 																				*/
/*																								*/
/************************************************************************************************/
long ossnsms(long mpid)
{

	/********************************************************************************************/
    /*  ＳＧ設定ワーク領域                          						 					*/
    /********************************************************************************************/
	long lAssort = 0;								// 種別
	long lTsuban = 0;								// 通番


	/********************************************************************************************/
	/*  ワーク領域                                                                              */
	/********************************************************************************************/
	long lProRet =	0;								// プロセス識別子の返却値
	long lPartStart = 0;							// 初めの個別部位置
	long lCnt = 0;									// メイルボックス個別部の位置
	long lArrive = 0;								// メッセージ到着数
	TEmbcTableInd *ptEmbcInd = NULL;				// メイルボックス個別部情報	
	TEprcTableInd *ptEprcInd = NULL;				// プロセス個別部情報
	TMsgInfo *ptMsgInfoPoint = NULL;				// メッセージ構造体アドレス
	TMsgHed *ptMsgHed = NULL;						// メッセージアドレス


	/********************************************************************************************/
	/*	 初期処理																				*/
	/********************************************************************************************/
	os_trcget2( D_MD_OSSNSMS, D_T_TRA_IN, 1, mpid  );


													// プロセス管理の個別部情報の先頭アドレス
													// を求める
    ptEprcInd = (TEprcTableInd *)((long)ptEprc + sizeof(TEprcTable));

													// メイルプックス個別部情報の先頭アドレス
													// を求める
	ptEmbcInd = (TEmbcTableInd *)((long)ptEmbc + sizeof(TEmbcTable));

//	DbgMsg01(DLv02, (OutPut, "(222222) ****** mpid == %ld\n", mpid));

	/*------------------------------*/
	/*  引数の確認                  */
	/*------------------------------*/
	if (0 > mpid)									// mpidが0の場合は
	{
		os_trcget2( D_MD_OSSNSMS, D_T_ERR_PRA, 1, OSEEIMPI );

		return(OSEEIMPI);							// エラーメッセージ
	}

	/********************************************************************************************/
	/*	本処理																					*/
	/********************************************************************************************/
	if (mpid == D_MPID_MYPROCESS)					// プロセス又はメイルプックス識別子がない場合
	{

		lProRet = os_MyProSearch(ptEprcInd); 	    // プロセス識別子の妥当性チェック

		if(D_ERR_SYS == lProRet)					// 異常終了の場合
		{
			os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEENEXS  );

			return(OSEENEXS);						// プロセス識別子存在しない時
		}

		lCnt = os_MyMBoxSearch(lProRet, ptEmbcInd);	// メイルボクッス識別子の妥当性チェック

		if(D_ERR_SYS == lCnt)						// 異常終了の場合
		{
			os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEENEXS  );
			
			return(OSEENEXS);						// メイルボクッス識別子存在しない時
		}

		DbgMsg01(DLv02, (OutPut, "&&&&&&  lCnt = %ld\n", lCnt));

	}
	else
	{

		lAssort = os_GetAsso(mpid);     			// 種別の取得

		lTsuban = os_GetSerNum(mpid);				// 通番の取得

		switch (lAssort)
		{
			case 2:									// 種別が2の場合
													// 通番のサイズを確認する
				if((lTsuban < D_OSSNSMS_TUBAN_MIN) ||
				   (lTsuban > D_OSSNSMS_TUBAN_MAX))
				{
/*****	障害対応（TBCS0088）Start										修正日：2003.05.15	*****/
/************************************************************************************************/
/*	エラー返却値の誤り（OSEEIMBI → OSEEIMPIに修正）											*/
/************************************************************************************************/
//					os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEEIMBI );
//					return(OSEEIMBI);				// エラーメッセージ
					os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEEIMPI );
					return(OSEEIMPI);				// エラーメッセージ
/*****	障害対応（TBCS0088） End										修正日：2003.05.15	*****/
				}

													// メイルボックス管理テーブルの検索
				lCnt = os_MBISearch(ptEmbcInd, lPartStart, ptEmbc->lIndPartNum - 1, mpid);

				DbgMsg01(DLv02, (OutPut, "(1)  LCNT = %ld\n", lCnt));

				if(D_ERR_SYS == lCnt)				// 検索が見つからなかった場合は
				{
					os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEENEXS );

					return(OSEENEXS);				// エラーメッセージ
				}
				break;
			default:
				DbgMsg01(DLv02, (OutPut, "(2) ****** RETURN OSEEIMPI\n"));

/*****	障害対応（TBCS0088）Start										修正日：2003.05.15	*****/
/************************************************************************************************/
/*	エラー返却値の誤り（OSEEIMBI → OSEEIMPIに修正）											*/
/************************************************************************************************/
//				os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEEIMBI );
//				return(OSEEIMBI);					// エラーメッセージ
				os_trcget2( D_MD_OSSNSMS, D_T_ERR_SYS, 1, OSEEIMPI );
				return(OSEEIMPI);					// エラーメッセージ
/*****	障害対応（TBCS0088） End										修正日：2003.05.15	*****/
				break;
		}
	}

	/*------------------------------*/
	/* 到着数の取得                 */
	/*------------------------------*/

	if(0 == (ptEmbcInd + lCnt)->tSubMsgQ.lMsgCnt)	// 格納数0の場合
	{
		os_trcget2( D_MD_OSSNSMS, D_T_TRA_OUT, 1, lArrive );
		
		return(lArrive);							// メッセージ到着数を返却する
	}

													// サブメッセージキュの先頭アドレスを求める
    ptMsgInfoPoint = (ptEmbcInd + lCnt)->tSubMsgQ.ptNxtAdr;
  	DbgMsg01(DLv02, (OutPut, "(3)  ptMsgInfoPoint = %u\n", ptMsgInfoPoint));
   	DbgMsg01(DLv02, (OutPut, "(4)  lMsgCnt        = %ld\n", (ptEmbcInd + lCnt)->tSubMsgQ.lMsgCnt));

	/************************************/
	/*  サブメッセージキューの検索		*/
	/************************************/
	while(ptMsgInfoPoint->ptNxtAdr != NULL)
	{
	    ptMsgHed = ptMsgInfoPoint->pvMsgAdr;		// メッセージ情報を取得

		DbgMsg01(DLv02, (OutPut, "(5) ptMsgInfoPoint->pvMsgAdr= %x \n", ptMsgInfoPoint->pvMsgAdr));
		DbgMsg01(DLv02, (OutPut, "(6) ptMsgHed                = %x \n", ptMsgHed));
		DbgMsg01(DLv02, (OutPut, "(7) ptMsgInfoPoint          = %x \n", ptMsgInfoPoint));
		DbgMsg01(DLv02, (OutPut, "(8) ptMsgHed->lMsgType      = %ld\n", ptMsgHed->lMsgType));
//		DbgMsg01(DLv02, (OutPut, "(9) ptMsgHed       = %s\n", ptMsgHed + 1));

		/************************************/
		/*  メッセージ内容チェック			*/
		/************************************/
													// メイルボックス識別子が「自プロセス」かつ
													// メッセージタイプが「プロセス宛」の場合
													// 又は
													// 種別が「メイルボックス」かつ
													// メッセージタイプが「メイルボックス宛」の場合
    	if(((D_MPID_MYPROCESS == mpid) && ((ptMsgHed->lMsgType == D_MTYPE06) || 
		  (ptMsgHed->lMsgType == D_MTYPE08))) || ((D_ASSO_MAILBOX == lAssort) &&  
		   ((ptMsgHed->lMsgType == D_MTYPE05) || (ptMsgHed->lMsgType == D_MTYPE07))))
		{
			lArrive += 1;							// メッセージ到着数カウントアップ
		}
													// 次のメッセージアドレスへ
		ptMsgInfoPoint = (TMsgInfo *)ptMsgInfoPoint->ptNxtAdr;
	}

/*****	障害対応（TBCS0088）Start										修正日：2003.05.15	*****/
/************************************************************************************************/
/*	サブメッセージキューの検索誤り																*/
/*  （最後のデータがカウントされない件の対応）													*/
/************************************************************************************************/
	if (NULL != ptMsgInfoPoint->pvMsgAdr)			// 最後のメッセージ情報アドレスがNULL以外の場合
	{
	    ptMsgHed = ptMsgInfoPoint->pvMsgAdr;		// メッセージ情報を取得

		DbgMsg01(DLv02, (OutPut, "(10) ptMsgInfoPoint     = %x \n", ptMsgInfoPoint));
		DbgMsg01(DLv02, (OutPut, "(11) ptMsgHed           = %x \n", ptMsgHed));
		DbgMsg01(DLv02, (OutPut, "(12) ptMsgHed->lMsgType = %ld\n", ptMsgHed->lMsgType));

		/************************************/
		/*  メッセージ内容チェック			*/
		/************************************/
													// メイルボックス識別子が「自プロセス」かつ
													// メッセージタイプが「プロセス宛」の場合
													// 又は
													// 種別が「メイルボックス」かつ
													// メッセージタイプが「メイルボックス宛」の場合
    	if(((D_MPID_MYPROCESS == mpid) && ((ptMsgHed->lMsgType == D_MTYPE06) || 
		  (ptMsgHed->lMsgType == D_MTYPE08))) || ((D_ASSO_MAILBOX == lAssort) &&  
		   ((ptMsgHed->lMsgType == D_MTYPE05) || (ptMsgHed->lMsgType == D_MTYPE07))))
		{
			lArrive += 1;							// メッセージ到着数カウントアップ
		}
	}
/*****	障害対応（TBCS0088） End										修正日：2003.05.15	*****/


	/********************************************************************************************/
	/*	終了処理																				*/
	/********************************************************************************************/
//	DbgMsg01(DLv02, (OutPut, "(10) lArrive = %ld\n", lArrive));

	os_trcget2( D_MD_OSSNSMS, D_T_TRA_OUT, 1, lArrive );

	return(lArrive);									// メッセージ到着数を返却
}
/************************************************************************************************/
/*  End                                                                                         */
/************************************************************************************************/

