/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 バッファプール管理											*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 ユニットサイズの取得										*/
/* ＜モジュールＩＤ＞				 ossnsus													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(メーカー:ＸＸＸＸ)					*/
/* 作成者：五味                                                             */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日：2002年10月21日                                                   */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/* 機能：ユニットサイズの取得                                               */
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<oscreat.h>																	*/
/*																								*/
/*   long ossnsus( long poolid )                                            */
/*																								*/
/* ＜仮引数＞																					*/
/*     long poolid         プール識別子                                     */
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了			iFilId+1(iFilIdはファイル記述子カウント用)							*/
/*		異常終了			-1																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include "ossnsus.h"
#include "ossnsus_ins.h"				// 内部参照用（個別）

/****************************************************************************/
/* 機能：ユニットサイズの取得                                               */
/* 作成日：2002年10月21日                                                   */
/* 変更日：                                                                 */
/* 作成者：五味                                                             */
/* 呼出形式：                                                               */
/*   long ossnsus( long poolid )                                            */
/*     long poolid         プール識別子                                     */
/*                                                                          */
/****************************************************************************/
long ossnsus( long poolid )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	long lRet;							// 返却値
	TEbpcTableInd *ptBpIndAdr;			// バッファプール管理テーブル個別部のアドレス

	os_trcget2(D_MD_OSSNSUS,D_T_TRA_IN,1,poolid);

//	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );

	lRet = os_GetEbpcTableInd( poolid, (void **)&ptBpIndAdr );
										// バッファプール管理テーブルから対象個別部アドレスの取得
	if( lRet != NORMAL )				// 対象個別部のアドレスの取得に失敗した時
	{
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, lRet ) );
        
        os_trcget2(D_MD_OSSNSUS,D_T_TRA_OUT,1,lRet);
		
		return( lRet );					// os_GetEbpcTableInd共通関数の返却値を返却
	}

	if( ptBpIndAdr->cStat != D_STAT_CREATED )
	{									// 作成状態が作成済でない時
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEENEXS ) );
        
        os_trcget2(D_MD_OSSNSUS,D_T_TRA_OUT,1,OSEENEXS);
		
		return( OSEENEXS );				// OSEENEXSを返却
	}

/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/

//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
    
    os_trcget2(D_MD_OSSNSUS,D_T_TRA_OUT,1,ptBpIndAdr->lUnitSize);
	
	return( ptBpIndAdr->lUnitSize );	// ユニットサイズを返却
}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
