/************************************************************************************************/
/*	著作権	２００２							                               					*/
/*			  株式会社ＮＴＴデータ																*/
/*				金融ビジネス事業本部															*/
/*																								*/
/*																								*/
/*	収容物	ＬＡＬａ−ＳＭＰシステム    ＴＲＡＤＥエミュレータ									*/
/************************************************************************************************/
/* ＜対象業務名＞					 ＴＲＡＤＥエミュレータ										*/
/* ＜対象業務ＩＤ＞ 				 ＴＲＥ 													*/
/* ＜サービス項目名＞				 タイマ制御													*/
/* ＜サービス項目ＩＤ＞ 			 ＸＸＸＸＸＸＸ												*/
/* ＜モジュール名＞					 システム時刻設定											*/
/* ＜モジュールＩＤ＞				 osstdat													*/
/* ＜モジュール通番＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜適用機種名＞					 汎用サーバ													*/
/* ＜適用ＯＳ＞ 					 Ｌｉｎｕｘ 												*/
/* ＜開発環境＞ 					 ＲＨＡＳ２．１												*/
/* ＜記述言語＞ 					 Ｃ言語 													*/
/* ＜モジュール形態＞				 関数														*/
/* ＜機能区分＞ 																				*/
/* ＜対象データ＞																				*/
/* ＜工程・階層区分＞																			*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発システム名＞				 ＬＡＬａ−ＳＭＰシステム									*/
/* ＜開発システム番号＞ 			 ＰＰ４０Ｂ００１２２０										*/
/*----------------------------------------------------------------------------------------------*/
/* ＜開発担当名＞					 ＣＢ事ビジネス企画担当(メーカー：サプライ)			    	*/
/* ＜電話番号＞ 					 148-1457(03-5437-1457) 									*/
/*----------------------------------------------------------------------------------------------*/
/* ＜設計者名＞ 					 ＣＢ事ビジネス企画担当										*/
/* ＜設計年月日＞					 ２００２年　９月２７日 									*/
/* ＜設計修正者名＞ 																			*/
/* ＜設計修正年月日及び修正ＩＤ＞																*/
/*----------------------------------------------------------------------------------------------*/
/* ＜ソース作成者＞ 				 ＣＢ事ビジネス企画担当(:ＸＸＸＸ)						*/
/* 作成者：梶原                                                             */
/* ＜ソース作成年月日＞ 			 ２００２年　９月２７日 									*/
/* 作成日：2002年9月30日                                                    */
/* ＜ソース修正者＞ 			 	 															*/
/* ＜ソース正年月日及び修正ＩＤ＞    															*/
/* 変更日：2002年11月6日                                                    */
/*----------------------------------------------------------------------------------------------*/
/* ＜見積ステップ数＞				 ステップ													*/
/*----------------------------------------------------------------------------------------------*/
/* ＜機能概要＞ 																				*/
/*	 システム日付、時刻の設定																	*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜呼出形式＞ 																				*/
/*		#include	<osstdat.h>																	*/
/*																								*/
/*	   	long	osstdat( long day, long time )													*/
/*																								*/
/* ＜仮引数＞																					*/
/*		long	day;		日付																*/
/*		long	time;		時刻																*/
/*																								*/
/* ＜返却値＞																					*/
/*		正常終了		NORMAL																	*/
/*		異常終了		OSEEIVAL																*/
/*						OSEESETE																*/
/*																								*/
/*----------------------------------------------------------------------------------------------*/
/* ＜入出力データ構造＞ 																		*/
/* ＜制限事項＞ 																				*/
/*	   特になし 																				*/
/* ＜使用外部モジュールＩＤ＞																	*/
/* ＜呼出元のモジュールＩＤ＞																	*/
/*																								*/
/*																								*/
/************************************************************************************************/
/******************************** 標準ヘッダ・ファイル ******************************************/
#include <time.h>
#include <errno.h>

/***************************** 利用者作成ヘッダ・ファイル *******************/
#include "osstdat.h"
#include "osstdat_ins.h"				// 内部参照用（個別）

/****************************************************************************/
/* 機能：システム日付、時刻の設定                                           */
/* 作成日：2002年9月30日                                                    */
/* 変更日：2002年11月6日                                                    */
/* 作成者：梶原                                                             */
/* 呼出形式：                                                               */
/*   long osstdat( long day, long time )                                    */
/*     long day            日付                                             */
/*     long time           時刻                                             */
/*                                                                          */
/****************************************************************************/
long osstdat( long day, long time )
{
/****************************************************************************/
/* 初期処理                                                                 */
/****************************************************************************/
	int iRet;							// 関数の結果返却
	long lRet;							// 共通関数の結果返却
	time_t lSetTime;					// 設定時間
	struct tm tDate;					// 日時格納体
	

	os_trcget2( D_MD_OSSTDAT, D_T_TRA_IN, 2, day, time  );

	
//	DbgMsg01( DLv02, ( OutPut, "***** %s:Start DbgMainFnc\n", D_PROC_NAME ) );
	
	lRet = os_DayTime2Date( day, time, &tDate );
										// 日付時刻を日時に変換
	if( NORMAL != lRet )				// 日時変換に失敗した時
	{
		os_trcget2( D_MD_OSSTDAT, D_T_ERR_PRA, 1, OSEEIVAL );
		
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEEIVAL ) );
		return( OSEEIVAL );				// OSEEIVALを返却
	}
	
/****************************************************************************/
/* 本処理                                                                   */
/****************************************************************************/
	os_trcget2( D_MD_OSSTDAT,  D_T_SYS_MKTIME, 1, &tDate );   
	
	lSetTime = mktime( &tDate );		// 現在日時の経過秒数取得
	
	os_trcget2( D_MD_OSSTDAT,  D_T_SYS_END, 2, lSetTime, errno );
	
	if( D_ERR_SYS == lSetTime )			// 経過秒数取得に失敗した時
	{
		os_trcget2( D_MD_OSSTDAT,  D_T_ERR_SYS, 1, OSEESETE );
		
		DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEESETE ) );
		return( OSEESETE );				// OSEESETEを返却
	}
	
	os_trcget2( D_MD_OSSTDAT, D_T_SYS_STIME, 1, &lSetTime );
	
	iRet = stime( &lSetTime );			// システム日付と時刻の設定
	
	os_trcget2( D_MD_OSSTDAT, D_T_SYS_END, 2, iRet, errno );
	
	if( D_ERR_SYS == iRet )				// 設定に失敗した時
	{
		goto err_osstdat;				// 異常処理に遷移
	}
	
	os_trcget2( D_MD_OSSTDAT, D_T_TRA_OUT, 1, NORMAL  );
	
//	DbgMsg01( DLv02, ( OutPut, "***** %s:End DbgMainFnc\n", D_PROC_NAME ) );
	return( NORMAL );					// NORMALを返却し終了
	
/****************************************************************************/
/* 異常処理                                                                 */
/****************************************************************************/
err_osstdat:
	switch( errno )
	{
		case EPERM:						// EPERMの時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, OSEESETE ) );
			
			os_trcget2( D_MD_OSSTDAT, D_T_ERR_SYS, 1, errno );
			
			return( OSEESETE );			// OSEESETEを返却
			break;
				
		default:						// その他の時
			DbgMsg01( DLv05, ( OutPut, "***** %s:Err Function:%x\n", D_PROC_NAME, -1 ) );
			
			os_trcget2( D_MD_OSSTDAT, D_T_ERR_SYS, 1, errno  );
			os_treterm(os_EndCod(D_END_TYPE1), (D_MD_OSSTDAT << 16) | D_T_ERR_SYS );
			//return( -1 );				// アボート処理
	}
}

/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/

