/*****************************************************************************/
/* 信金システム  システムコール                                              */
/* 機能： 自プロセスの終了                                                   */
/* 作成日：2002年11月06日                                                    */
/* 変更日：2003年02月04日                                                    */
/* 作成者：大野  正喜                                                        */
/*                                                                           */
/* Copyright(C) 2002, Supply Corporation.                                    */
/* All Rights Reserved.                                                      */
/*****************************************************************************/
/* 標準ヘッダファイル */
#include<stdlib.h>             //exit,abort用ヘッダ

/* 利用者作正ヘッダファイル */
#include "osterm.h"
#include "osterm_ins.h"

/*****************************************************************************/
/* 機能： 自プロセスの終了                                                   */
/* 作成日：2002年11月06日                                                    */
/* 変更日：2003年02月04日                                                    */
/* 作成者：大野  正喜                                                        */
/* 呼出形式：long osterm(long code)                                          */
/*                                                                           */
/*           long  code  終了コード                                          */
/*                                                                           */
/*****************************************************************************/
long osterm(long code)
{
	/******************/
	/*    変数定義    */
	/******************/
	long lRes = 0;
	
	os_trcget2( D_MD_OSTERM, D_T_TRA_IN, 1, code );
	
	/******************/
	/*     本処理     */
	/******************/
	// 自プロセステーブル 「詳細情報」、「終了コード」へ引数の値を格納
	
	ptMyEPRC->lEndCode = code;				// 終了コード格納

	os_trcget2( D_MD_OSTERM, D_T_SYS_KILL, 2, lMyPid, SIGTERM);
	lRes = kill(lMyPid, SIGTERM);				// シグナル kill(自pid, SIGTERM); 発行
	if(NORMAL != lRes)
	{
		os_trcget2( D_MD_OSTERM, D_T_ERR_SYS, 1, errno);
		os_treterm( os_EndCod(D_END_TYPE1), (D_MD_OSTERM << 16) | D_T_ERR_SYS );
		// エラー
	}
	
	/******************/
	/*    終了処理    */
	/******************/
	os_trcget2( D_MD_OSTERM, D_T_TRA_OUT, 0);
	do
	{
		lRes = pause();							// 無限処理待ち合わせ
	}while(1);

}
/*****************************************************************************/
/* End                                                                       */
/*****************************************************************************/
